IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(2).
01 B          PIC 9(2).
01 C          PIC 9(2).
01 D          PIC 9(2).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B C D.
  IF A * 100 + B <= C * 100 + D THEN DISPLAY "Takahashi"
  ELSE DISPLAY "Aoki".
  STOP RUN.

