IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S1         PIC X(2).
01 S2         PIC X(2).

PROCEDURE DIVISION.
  ACCEPT S1.
  ACCEPT S2.
  IF "#" = S1(1:1) AND S2(2:1) AND "#" NOT = S1(2:1) AND S2(1:1)
    DISPLAY "No"
  ELSE IF "#" = S1(2:1) AND S2(1:1)
  AND "#" NOT = S1(1:1) AND S2(2:1)
    DISPLAY "No"
  ELSE
    DISPLAY "Yes".
  STOP RUN.

