IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(200000).
01 REDEFINES INDATA.
   03 S       PIC X OCCURS 200000.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN.
  CLOSE SYSIN.
  SORT S ASCENDING S.
  DISPLAY FUNCTION TRIM(INDATA).
  STOP RUN.

