IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC 9(19).
01 ans        PIC 9(10).
01 cur        PIC 9(19).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT X.
  MOVE 100 TO cur.
  PERFORM UNTIL X <= cur
    ADD 1 TO ans
    MULTIPLY cur BY 1.01 GIVING cur
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

