IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 C1         PIC X(3).
01 C2         PIC X(3).

PROCEDURE DIVISION.
  ACCEPT C1.
  ACCEPT C2.
  IF C1(1:1) = C2(3:1)
    AND C1(2:1) = C2(2:1) AND C1(3:1) = C2(1:1) THEN
    DISPLAY "YES"
  ELSE
    DISPLAY "NO"
  END-IF.
  STOP RUN.

