IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 H          PIC 9(10).
01 S11.
   03 S       PIC X(100) OCCURS 100 DEPENDING H.
01 W          PIC 9(10).
01 X          PIC 9(10).
01 Y          PIC 9(10).
01 ans        PIC 9(10) VALUE ZERO.
01 i          PIC 9(10) COMP.
01 ln         PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO H W X Y.
  PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
    ACCEPT S(i)
  END-PERFORM.
  *> UP DOWN LEFT RIGHT
  PERFORM VARYING i FROM X BY -1
  UNTIL i <= ZERO OR "#" = S(i)(Y:1)
    ADD 1 TO ans
  END-PERFORM.
  PERFORM VARYING i FROM X BY 1
  UNTIL H < i OR "#" = S(i)(Y:1)
    ADD 1 TO ans
  END-PERFORM.
  PERFORM VARYING i FROM Y BY -1
  UNTIL i <= ZERO OR "#" = S(X)(i:1)
    ADD 1 TO ans
  END-PERFORM.
  PERFORM VARYING i FROM Y BY 1
  UNTIL W < i OR "#" = S(X)(i:1)
    ADD 1 TO ans
  END-PERFORM.
  SUBTRACT 3 FROM ans.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

