IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC X(3).

PROCEDURE DIVISION.
  ACCEPT N.
  DISPLAY N(2:2).
  STOP RUN.

