IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(20000).

WORKING-STORAGE SECTION.
01 ln         PIC X(20000).
01 maxlen     PIC 9(10) VALUE 100 COMP.
01 cur        PIC 9(10) VALUE 1 COMP.
01 i          PIC 9(10) VALUE 1 COMP.
01 j          PIC 9(10) COMP.
01 len        PIC 9(10) COMP.
01 zs         PIC Z(9)9.
01 N          PIC 9(10).
01 a          PIC 9(10).
01 flg        PIC 9(1).
01 ix         PIC 9(10) VALUE 1.
01 ai1.
   03 ai11 OCCURS 1000 DEPENDING N INDEXED aix.
      05 ai   PIC S9(10) VALUE ZERO.

PROCEDURE DIVISION.
  ACCEPT N.
  OPEN INPUT SYSIN.
  READ SYSIN INTO ln.
  CLOSE SYSIN.
  MOVE N TO maxlen.
  MOVE 1 TO ix.
  PERFORM maxlen TIMES
    PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
    END-PERFORM
    COMPUTE len = j - cur
    MOVE ln(cur:len) TO a
    MOVE ZERO TO flg
    SET aix TO 1
    SEARCH ai11
      WHEN ai(aix) = a
        MOVE 1 TO flg
    END-SEARCH
    IF ZERO = flg
      MOVE a TO ai(ix)
      ADD 1 TO ix
    END-IF
    COMPUTE cur = j + 1
    ADD 1 TO i
  END-PERFORM.
  SUBTRACT 1 FROM ix
  MOVE ix TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.