IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC X(19).
01 B          PIC X(19).
01 X11.
   03 X1      PIC X(19) VALUE ZERO.
   03 X       REDEFINES X1 PIC 9 OCCURS 19.
01 Y11.
   03 Y1      PIC X(19) VALUE ZERO.
   03 Y       REDEFINES Y1 PIC 9 OCCURS 19.
01 aix        PIC 9(10) VALUE 19 COMP.
01 bix        PIC 9(10) VALUE 19 COMP.
01 flg        PIC 9 VALUE ZERO.
01 i          PIC 9(10) COMP.
01 lena       PIC 9(10).
01 lenb       PIC 9(10).
01 ln         PIC X(50).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B.
  MOVE FUNCTION STORED-CHAR-LENGTH(A) TO lena.
  MOVE FUNCTION STORED-CHAR-LENGTH(B) TO lenb.
  PERFORM VARYING i FROM lena BY -1 UNTIL i = ZERO
    MOVE A(i:1) TO X1(aix:1)
    SUBTRACT 1 FROM aix
  END-PERFORM.
  PERFORM VARYING i FROM lenb BY -1 UNTIL i = ZERO
    MOVE B(i:1) TO Y1(bix:1)
    SUBTRACT 1 FROM bix
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 19 < i
    IF 10 <= X(i) + Y(i) MOVE 1 TO flg EXIT PERFORM
  END-PERFORM.
  IF 1 = flg DISPLAY "Hard" ELSE DISPLAY "Easy".
  STOP RUN.

