IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X11.
   03 X1      PIC 9(4).
   03 X REDEFINES X1 PIC 9(1) OCCURS 4.
01 d          PIC 9(10).
01 r1         PIC 9(10).
01 r2         PIC 9(10).
01 r3         PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT X1.
  MOVE X(1) TO d.
  ADD 1 TO d.
  DIVIDE d BY 10 GIVING d REMAINDER r1.
  MOVE X(2) TO d.
  ADD 1 TO d.
  DIVIDE d BY 10 GIVING d REMAINDER r2.
  MOVE X(3) TO d.
  ADD 1 TO d.
  DIVIDE d BY 10 GIVING d REMAINDER r3.
  IF X(1) = X(2) AND X(3) AND X(4) DISPLAY "Weak"
  ELSE IF r1 = X(2) AND r2 = X(3) AND r3 = X(4) DISPLAY "Weak"
  ELSE DISPLAY "Strong".
  STOP RUN.

