IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 a          PIC S9(10).
01 ans        PIC -(9)9.
01 b          PIC S9(10).
01 c          PIC S9(10).
01 d          PIC S9(10).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO a b.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO c d.
  SUBTRACT c FROM b GIVING ans.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

