IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A1.
   03 A       PIC 9(10) OCCURS 3.
01 ans        PIC X(30).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A(1) A(2) A(3).
  SORT A ASCENDING A.
  IF A(3) - A(2) = A(2) - A(1) DISPLAY "Yes" ELSE DISPLAY "No".
  STOP RUN.

