IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN_B ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
SELECT SYSIN_S ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN_B.
01 INDATA_B   PIC X(2200000).
FD SYSIN_S.
01 INDATA_S   PIC X(2200).

WORKING-STORAGE SECTION.
01 L          PIC 9(10).
01 N          PIC 9(10).
01 Q          PIC 9(10).
01 a11.
   03 a1      OCCURS 200000.
      05 a    PIC 9(10) OCCURS 200000.
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 ln         PIC X(30).
01 pt         PIC S9(10).
01 s          PIC 9(10).
01 t          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO N Q.
  IF 1000 < N
    OPEN INPUT SYSIN_S
  ELSE
    OPEN INPUT SYSIN_B
  END-IF.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF 1000 < N
      READ SYSIN_S INTO INDATA_S
    ELSE
      READ SYSIN_B INTO INDATA_B
    END-IF
    MOVE 1 TO pt
    IF 1000 < N
      UNSTRING INDATA_S DELIMITED SPACE INTO L POINTER pt
    ELSE
      UNSTRING INDATA_B DELIMITED SPACE INTO L POINTER pt
    END-IF
    PERFORM VARYING j FROM 1 BY 1 UNTIL L < j
      IF 1000 < N
        UNSTRING INDATA_S DELIMITED SPACE INTO A(i j) POINTER pt
      ELSE
        UNSTRING INDATA_B DELIMITED SPACE INTO A(i j) POINTER pt
      END-IF
    END-PERFORM
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL Q < i
    IF 1000 < N
      READ SYSIN_S INTO INDATA_S
      UNSTRING INDATA_S DELIMITED SPACE INTO s t
    ELSE
      READ SYSIN_B INTO INDATA_B
      UNSTRING INDATA_B DELIMITED SPACE INTO s t
    END-IF
    MOVE A(s t) TO zs
    DISPLAY FUNCTION TRIM(zs)
  END-PERFORM.
  IF 1000 <= N
    CLOSE SYSIN_S
  ELSE
    CLOSE SYSIN_B
  END-IF.
  STOP RUN.

