IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 L          PIC 9(10).
01 R          PIC 9(10).
01 atcoder    PIC X(30) VALUE "atcoder".
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO L R.
  DISPLAY atcoder(L : R - L + 1).
  STOP RUN.

