IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC S9(3).
01 B          PIC S9(3).
01 C          PIC S9(3).
01 ln         PIC X(14).
01 zs         PIC -(4)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B C.
  IF A = B THEN
    MOVE C TO zs
  ELSE
    IF B = C THEN
      MOVE A TO zs
    ELSE
      MOVE B TO zs
    END-IF
  END-IF.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

