IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D          PIC 9(10).
01 N          PIC 9(10).
01 X          PIC 9(10).
01 ans        PIC X(10).
01 zs         PIC Z(11).

PROCEDURE DIVISION.
  ACCEPT N.
  DIVIDE 2 INTO N GIVING X REMAINDER D.
  IF D NOT = 0 THEN
    MULTIPLY 2 BY N
  END-IF
  MOVE N TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

