IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 a          PIC 9(10).
01 b          PIC 9(10).
01 c          PIC 9(10).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO a b c.
  IF c <= b AND b <= a DISPLAY "Yes"
  ELSE IF a <= b AND b <= c DISPLAY "Yes"
  ELSE DISPLAY "No".
  STOP RUN.

