IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S         PIC X(15).

PROCEDURE DIVISION.
  ACCEPT S.
  IF "Hello,World!" = S DISPLAY "AC" ELSE DISPLAY "WA".
  STOP RUN.

