IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D         PIC 9(10).
01 S         PIC 9(10).
01 T         PIC 9(10).
01 V         PIC 9(10).
01 ln        PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO V T S D.
  IF V * T <= D AND D <= V * S THEN
    DISPLAY "No"
  ELSE
    DISPLAY "Yes"
  END-IF.
  STOP RUN.

