IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 M          PIC 9(2).

PROCEDURE DIVISION.
  ACCEPT M.
  SUBTRACT M FROM 48 GIVING M.
  DISPLAY M.
  STOP RUN.

