IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 flg        PIC 9(1) VALUE 1.
01 len        PIC 9(10).
01 ln         PIC X(50).
01 pre        PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO pre.
  PERFORM UNTIL FUNCTION STORED-CHAR-LENGTH(ln) <= ZERO
    MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
    IF ln(len - 1:2) = "ch" THEN
      MOVE SPACE TO ln(len - 1:2)
    END-IF
    MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
    IF ln(len:1) = "o" THEN
      MOVE SPACE TO ln(len:1)
    END-IF
    MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
    IF ln(len:1) = "k" THEN
      MOVE SPACE TO ln(len:1)
    END-IF
    MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
    IF ln(len:1) = "u" THEN
      MOVE SPACE TO ln(len:1)
    END-IF
    IF pre = FUNCTION STORED-CHAR-LENGTH(ln) THEN
      MOVE ZERO TO flg
      EXIT PERFORM
    END-IF
    MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO pre
  END-PERFORM.
  IF ZERO = flg THEN
    DISPLAY "NO"
  ELSE
    DISPLAY "YES"
  END-IF.
  STOP RUN.

