IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(4).

PROCEDURE DIVISION.
  ACCEPT S.
  MOVE S(3:1) TO S(4:1).
  MOVE S(2:1) TO S(3:1).
  MOVE S(1:1) TO S(2:1).
  MOVE ZERO TO S(1:1).
  DISPLAY S.
  STOP RUN.

