IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(7).
01 m          PIC 9(3).
01 n          PIC 9(3).
01 tmp        PIC 9(4).
01 zs         PIC Z(5).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO n m.
  SUBTRACT 1 FROM n.
  SUBTRACT 1 FROM m.
  MULTIPLY n BY m GIVING tmp.
  MOVE tmp TO ZS.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

