IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 S          PIC X(100).
01 cur        PIC X(1).
01 i          PIC 9(10) COMP.
01 l          PIC 9(10) COMP.
01 ln         PIC X(100).
01 r          PIC 9(10) COMP.

PROCEDURE DIVISION.
  ACCEPT S.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED BY SPACE INTO l r
    PERFORM VARYING r FROM r BY -1 UNTIL r <= l
      MOVE S(l:1) TO cur
      MOVE S(r:1) TO S(l:1)
      MOVE cur TO S(r:1)
      ADD 1 TO l
    END-PERFORM
  END-PERFORM.
  DISPLAY FUNCTION TRIM(S).
  STOP RUN.

