IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 x          PIC 9(10).
01 y          PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO x y.
  IF x < y THEN
    DISPLAY "Better"
  ELSE
    DISPLAY "Worse"
  END-IF.
  STOP RUN.

