IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 n          PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT n.
  IF n ** 2 < 2 ** n DISPLAY "Yes" ELSE DISPLAY "No".
  STOP RUN.

