IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  SYSIN.
01 INDATA PIC X(500000).

WORKING-STORAGE SECTION.
01 A11.
   03 A      PIC S9(10) OCCURS 100000 DEPENDING N.
01 AB        PIC S9(10) VALUE ZERO.
01 B11.
   03 B      PIC S9(10) OCCURS 100000 DEPENDING N.
01 N         PIC 9(10).
01 i         PIC 9(10) COMP.
01 lna       PIC X(500000).
01 lnb       PIC X(500000).
01 pt        PIC S9(10).

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO N.
  READ SYSIN INTO lna.
  READ SYSIN INTO lnb.
  CLOSE SYSIN.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING lna DELIMITED SPACE INTO A(i) WITH POINTER pt
  END-PERFORM.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING lnb DELIMITED SPACE INTO B(i) WITH POINTER pt
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    COMPUTE AB = AB + A(i) * B(i)
  END-PERFORM.
  IF ZERO = AB THEN
    DISPLAY "Yes"
  ELSE
    DISPLAY "No"
  END-IF.
  STOP RUN.

