IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(5).
01 N          PIC 9(10).
01 d          PIC 9(10).
01 r          PIC 9(10).
01 B          PIC 9(10).
01 ans        PIC X(2).

PROCEDURE DIVISION.
  ACCEPT S.
  ACCEPT N.
  SUBTRACT 1 FROM N.
  DIVIDE N BY 5 GIVING d REMAINDER r.
  STRING
    S(d + 1:1)
    S(r + 1:1)
    INTO ans
  END-STRING
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

