IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 N          PIC 9(10).
01 X          PIC 9(10).
01 Y          PIC 9(10).
01 ans        PIC Z(9)9.
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO N A X Y.
  IF N <= A COMPUTE ans = N * X
  ELSE COMPUTE ans = A * X + (N - A) * Y.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

