IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 W          PIC 9(10).
01 ans        PIC Z(9)9.
01 d          PIC 9(10).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO N W.
  DIVIDE N BY W GIVING d.
  MOVE d TO ans.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

