IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X         PIC 9(10).
01 Y         PIC 9(10).
01 ln        PIC X(30).
01 yen       PIC S9(10).
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO X Y.
  SUBTRACT X FROM y GIVING yen.
  IF yen < ZERO MOVE ZERO TO yen.
  ADD 9 TO yen.
  COMPUTE zs = yen / 10.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

