IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 cur1.
   03 cur     PIC 9(10) VALUE ZERO OCCURS 30 DEPENDING N.
01 num1.
   03 num     PIC 9(10) VALUE ZERO OCCURS 30 DEPENDING N.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    INITIALIZE cur1
    PERFORM VARYING j FROM 1 BY 1 UNTIL i < j
      IF 1 = j OR i = j MOVE 1 TO cur(j)
      ELSE COMPUTE cur(j) = num(j - 1) + num(j) END-IF
      MOVE cur(j) TO zs
      DISPLAY FUNCTION TRIM(zs) SPACE WITH NO ADVANCING
    END-PERFORM
    MOVE cur1 TO num1
    DISPLAY SPACE
  END-PERFORM.
  STOP RUN.

