IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(200000).

WORKING-STORAGE SECTION.
01 i          PIC 9(6) BINARY.
01 j          PIC 9(6) BINARY.
01 len        PIC 9(6).
01 ln1.
   03 ln      PIC X(1) OCCURS 200000.
01 zs         PIC Z(7).

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO ln1.
  CLOSE SYSIN.
  COMPUTE len = FUNCTION STORED-CHAR-LENGTH(ln1).
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    IF ln(i) = 'A' THEN
      EXIT PERFORM
    END-IF
  END-PERFORM.
  PERFORM VARYING j FROM len BY -1 UNTIL j < 1
    IF ln(j) = 'Z' THEN
      EXIT PERFORM
    END-IF
  END-PERFORM.
  SUBTRACT i FROM j.
  ADD 1 TO j.
  MOVE j TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

