IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N         PIC X(19).
01 flnum     PIC 9(9)V9(10).
01 i         PIC S9(10) COMP.
01 j         PIC 9(10) VALUE 20.
01 len       PIC 9(10).
01 num       PIC 9(9)V9(10) VALUE 0.0000000001.
01 two       BINARY-DOUBLE VALUE 2.
01 xnum      PIC X(20) VALUE "000000000.0000000000".
01 zs        PIC Z(18)9.

PROCEDURE DIVISION.
  ACCEPT N.
  MOVE FUNCTION STORED-CHAR-LENGTH(N) TO len.
  PERFORM VARYING i FROM len BY -1 UNTIL i <= ZERO
    IF j NOT = 10 MOVE N(i:1) TO xnum(j:1)
    ELSE SUBTRACT 1 FROM j MOVE N(i:1) TO xnum(j:1)
    END-IF
    SUBTRACT 1 FROM j
  END-PERFORM.
  MOVE xnum TO flnum.
  MOVE ZERO TO i.
  PERFORM WITH TEST AFTER
  VARYING i FROM ZERO BY 1 UNTIL flnum < num
    MULTIPLY two BY num
  END-PERFORM.
  MOVE i TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

