IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 P1.
   03 P       PIC 9(10) OCCURS 50.
01 ans        PIC 9(10) VALUE 1.
01 flg        PIC 9(1) VALUE ZERO.
01 i          PIC 9(10) COMP.
01 idx        PIC 9(10).
01 ln         PIC X(400).
01 pt         PIC S9(10) VALUE 1.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  ACCEPT ln.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N - 1 < i
    UNSTRING ln DELIMITED SPACE INTO P(i) POINTER pt
  END-PERFORM.
  SUBTRACT 1 FROM N GIVING idx.
  PERFORM UNTIL 1 = P(idx)
    MOVE P(idx) TO idx
    SUBTRACT 1 FROM idx
    ADD 1 TO ans
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

