IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC 9(10).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B.
  IF ZERO < A AND ZERO = B DISPLAY "Gold"
  ELSE IF ZERO = A AND ZERO < B DISPLAY "Silver"
  ELSE DISPLAY "Alloy".
  STOP RUN.

