IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ans       PIC Z(9)9.
01 ln        PIC X(30).
01 x         PIC 9(10).
01 y         PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO x y.
  IF x = y MOVE x TO ans ELSE COMPUTE ans = 3 - x - y.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

