IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(2).

PROCEDURE DIVISION.
  ACCEPT ln.
  IF ln(1:1) = 9 OR ln(2:1) = 9 THEN
    DISPLAY "Yes"
  ELSE
    DISPLAY "No"
  END-IF
  STOP RUN.

