IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(2).
01 i          PIC 9(2).
01 lucas      PIC 9(18).
01 ppr        PIC 9(18).
01 pr         PIC 9(18).
01 tmp        PIC 9(18).
01 zs         PIC Z(18)9.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM LUCASNUMBER.
  MOVE lucas TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

LUCASNUMBER SECTION.
  MOVE 2 TO ppr.
  MOVE 1 TO pr.
  PERFORM VARYING i FROM 2 BY 1 UNTIL N < i
    ADD ppr pr GIVING lucas
    MOVE pr TO ppr
    MOVE lucas TO pr
  END-PERFORM.
  IF N = 1 THEN
    MOVE 1 TO lucas
  END-IF.

