IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 H          PIC 9(10).
01 W          PIC 9(10).
01 dvh        PIC 9(10).
01 dvw        PIC 9(10).
01 rmh        PIC 9(10).
01 rmw        PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO W H.
  DIVIDE W BY 16 GIVING dvw REMAINDER rmw.
  DIVIDE H BY 9 GIVING dvh REMAINDER rmh.
  IF ZERO = rmw AND ZERO = rmh THEN
  DISPLAY "16:9"
  ELSE
  DISPLAY "4:3"
  END-IF.
  STOP RUN.

