IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D          PIC 9(10).
01 N          PIC 9(10).
01 X          PIC S9(10).
01 Y          PIC S9(10).
01 cnt        PIC 9(10) VALUE ZERO COMP.
01 i          PIC 9(10).
01 ln         PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO N D.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED BY SPACE INTO X Y
    IF FUNCTION SQRT(X ** 2 + Y ** 2) <= D THEN
      ADD 1 TO cnt
    END-IF
  END-PERFORM.
  MOVE cnt TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

