IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(9).
01 REDEFINES S.
   03 SC      PIC X OCCURS 9.
01 i          PIC 9(10) COMP.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT S.
  SORT SC ASCENDING SC.
  PERFORM VARYING i FROM ZERO BY 1 UNTIL 9 < i
    IF i NOT = FUNCTION NUMVAL(SC(i + 1)) EXIT PERFORM
  END-PERFORM.
  MOVE i TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

