IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 C              PIC X(1).

PROCEDURE DIVISION.
  ACCEPT C.
  DISPLAY FUNCTION CHAR(FUNCTION ORD(C) + 1).
  STOP RUN.
