IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(4).
01 B          PIC 9(4).
01 C          PIC 9(4).
01 D          PIC 9(4).
01 X          PIC 9(4).
01 Y          PIC 9(4).
01 zs         PIC Z(5).

PROCEDURE DIVISION.
  ACCEPT A.
  ACCEPT B.
  ACCEPT C.
  ACCEPT D.
  MOVE FUNCTION MIN(A, B) TO X.
  MOVE FUNCTION MIN(C, D) TO Y.
  ADD X TO Y.
  MOVE Y TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

