IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(800000).

WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 chebyshev  BINARY-DOUBLE VALUE ZERO.
01 euclidean  FLOAT-LONG VALUE ZERO.
01 i          PIC 9(10) COMP.
01 ln         PIC X(800000).
01 pt         PIC 9(10) VALUE 1 COMP.
01 taxicab    BINARY-DOUBLE VALUE ZERO.
01 x          PIC 9(11).
01 zsc        PIC Z(10)9.
01 zse        PIC Z(10)9.9(15).
01 zst        PIC Z(10)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO N.
  READ SYSIN INTO ln.
  CLOSE SYSIN.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED BY SPACE INTO x WITH POINTER pt
    ADD x TO taxicab
    COMPUTE euclidean = euclidean + x ** 2
    IF chebyshev < x THEN
      MOVE x TO chebyshev
    END-IF
  END-PERFORM.
  COMPUTE euclidean = euclidean ** 0.5.
  MOVE chebyshev TO zsc.
  MOVE euclidean TO zse.
  MOVE taxicab TO zst.
  DISPLAY FUNCTION TRIM(zst).
  DISPLAY FUNCTION TRIM(zse).
  DISPLAY FUNCTION TRIM(zsc).
  STOP RUN.

