IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(400).
01 i          PIC 9(10) VALUE 1 COMP.
01 j          PIC 9(10) COMP.
01 N          PIC 9(10).
01 s1.
   03 s       PIC X(50) OCCURS 50 DEPENDING ON N.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
      MOVE ln(j:1) TO s(j)(N - i + 1:1)
    END-PERFORM
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    DISPLAY FUNCTION TRIM(s(i))
  END-PERFORM.
  STOP RUN.

