IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X         PIC 9(10).
01 Y         PIC 9(10).
01 ln        PIC X(30).
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED "." INTO X Y.
  MOVE X TO zs.
  IF ZERO <= Y AND Y <= 2
    DISPLAY FUNCTION TRIM(zs) "-"
  ELSE IF 3 <= Y AND Y <= 6
    DISPLAY FUNCTION TRIM(zs)
  ELSE
    DISPLAY FUNCTION TRIM(zs) "+"
  END-IF.
  STOP RUN.

