IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 c          PIC X(1).

PROCEDURE DIVISION.
  ACCEPT c.
  IF c = 'a' OR 'e' OR 'i' OR 'o' OR 'u'
    DISPLAY "vowel"
  ELSE
    DISPLAY "consonant"
  END-IF.
  STOP RUN.

