IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(11000).

WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 A1.
   03 A       PIC 9(10) OCCURS 1000 DEPENDING N.
01 B1.
   03 B       PIC 9(10) OCCURS 1000 DEPENDING N.
01 ans1       PIC 9(10) VALUE ZERO COMP.
01 ans2       PIC 9(10) VALUE ZERO COMP.
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 ln         PIC X(30).
01 pt         PIC S9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO N.
  READ SYSIN.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING INDATA DELIMITED SPACE INTO A(i) POINTER pt
  END-PERFORM.
  READ SYSIN.
  CLOSE SYSIN.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING INDATA DELIMITED SPACE INTO B(i) POINTER pt
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF A(i) = B(i) ADD 1 TO ans1
    ELSE
      PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
        IF A(i) = B(j) ADD 1 TO ans2 EXIT PERFORM
      END-PERFORM
  END-PERFORM.
  MOVE ans1 TO zs.
  DISPLAY FUNCTION TRIM(zs).
  MOVE ans2 TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

