IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 i          PIC 9(10) VALUE 1 COMP.
01 S          PIC X(10).
01 ACGT       PIC X(4) VALUE "ACGT".
01 cnt        PIC 9(10) VALUE ZERO.
01 num        PIC 9(10) VALUE ZERO.
01 ans        PIC 9(10) VALUE ZERO.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT S.
  PERFORM VARYING i FROM 1 BY 1
  UNTIL FUNCTION STORED-CHAR-LENGTH(S) < i
    MOVE ZERO TO cnt
    INSPECT ACGT TALLYING cnt FOR ALL S(i:1)
    IF ZERO < cnt
      ADD 1 TO num
    ELSE
      MOVE ZERO TO num
    END-IF
    IF ans < num
      MOVE num TO ans
    END-IF
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.
