IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC Z(9)9.
01 B          PIC Z(9)9.
01 C          PIC Z(9)9.
01 D          PIC Z(9)9.
01 S1.
   03 S       PIC X(10) OCCURS 10.
01 h          PIC S9(1).
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 v          PIC S9(1).

PROCEDURE DIVISION.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 10 < i
    ACCEPT S(i)
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 10 < i
    PERFORM VARYING j FROM 1 BY 1 UNTIL 10 < j
      IF "#" = S(i)(j:1)
        IF v = 0 MOVE i TO A MOVE 1 TO v END-IF
        IF h = 0 MOVE j TO C MOVE 1 TO h END-IF
      ELSE
        IF h = 1
          SUBTRACT 1 FROM j GIVING D
          MOVE -1 TO h
        END-IF
      END-IF
    END-PERFORM
    IF v = 1 AND "." = S(i)(FUNCTION NUMVAL(C):1)
      SUBTRACT 1 FROM i GIVING B
      MOVE -1 TO v
    END-IF
    IF h = 1 SUBTRACT 1 FROM j GIVING D
      MOVE -1 TO h
    END-IF
  END-PERFORM.
  IF v = 1 SUBTRACT 1 FROM i GIVING B.
  DISPLAY FUNCTION TRIM(A) SPACE FUNCTION TRIM(B).
  DISPLAY FUNCTION TRIM(C) SPACE FUNCTION TRIM(D).
  STOP RUN.

