IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 S1.
   03 S11 OCCURS 50 DEPENDING N INDEXED IXS.
      05 S    PIC X(50).
      05 num  PIC 9(10) VALUE ZERO.
01 cur        PIC X(50).
01 flg        PIC 9(1).
01 i          PIC 9(10) VALUE 1 COMP.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM N TIMES
    ACCEPT cur
    MOVE ZERO TO flg
    SET IXS TO 1
    SEARCH S11
      AT END
        CONTINUE
      WHEN cur = S(IXS)
        MOVE 1 TO flg
        ADD 1 TO num(IXS)
      WHEN ZERO = FUNCTION STORED-CHAR-LENGTH(S(IXS))
        MOVE ZERO TO flg
    END-SEARCH
    IF ZERO = flg
      MOVE cur TO S(i)
      ADD 1 TO num(i)
      ADD 1 TO i
    END-IF
  END-PERFORM.
  SORT S11 DESCENDING num ASCENDING S.
  DISPLAY FUNCTION TRIM(S(1)).
  STOP RUN.

