IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S         PIC X(3).
01 a         PIC 9(10).
01 b         PIC 9(10).
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT S.
  MOVE S(1:1) TO a.
  MOVE S(3:1) TO b.
  COMPUTE zs = a * b.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

