IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 R1.
   03 R       PIC 9(10) OCCURS 1000 DEPENDING ON N.
01 a          PIC S9(10)V9(10).
01 cur        PIC 9(10) VALUE 1 COMP.
01 d          PIC 9(10).
01 i          PIC 9(10) VALUE 1 COMP.
01 num        PIC S9(10)V9(10).
01 rm         PIC 9(10).
01 zs         PIC Z(9)9.9(10).

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT R(i)
  END-PERFORM.
  SORT R DESCENDING R.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    COMPUTE num = R(i) * R(i) * FUNCTION PI
    DIVIDE i BY 2 GIVING d REMAINDER rm
    IF ZERO = rm THEN
      ADD num TO a
    ELSE
      SUBTRACT num FROM a
    END-IF
  END-PERFORM.
  MOVE a TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

