IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D          PIC 9(10).
01 M          PIC 9(10).
01 dv         PIC 9(10).
01 ln         PIC X(5).
01 rm         PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO M D.
  DIVIDE M BY D GIVING dv REMAINDER rm.
  IF ZERO = rm THEN
    DISPLAY "YES"
  ELSE
    DISPLAY "NO"
  END-IF.
  STOP RUN.

