IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A1.
   03 A       PIC 9(10) OCCURS 100 DEPENDING N.
01 B1.
   03 B       PIC 9(10) OCCURS 100 DEPENDING N.
01 N          PIC 9(10).
01 ary1.
   03 ary     PIC S9(10) VALUE ZERO OCCURS 1001.
01 ans        PIC 9(10) VALUE ZERO COMP.
01 i          PIC 9(10) COMP.
01 ln         PIC X(500).
01 pt         PIC S9(10).
01 upper      PIC 9(10) VALUE 1001.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  ACCEPT ln.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED SPACE INTO A(i) WITH POINTER pt
  END-PERFORM.
  ACCEPT ln.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED SPACE INTO B(i) WITH POINTER pt
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ADD 1 TO ary(A(i))
    SUBTRACT 1 FROM ary(B(i) + 1)
  END-PERFORM.
  PERFORM VARYING i FROM 2 BY 1 UNTIL upper < i
    ADD ary(i - 1) TO ary(i)
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL upper < i
    IF N = ary(i) ADD 1 TO ans
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

