IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ans        PIC 9(19).
01 r          PIC 9(10).
01 zs         PIC Z(18)9.

PROCEDURE DIVISION.
  ACCEPT r.
  COMPUTE ans = r ** 2.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

