IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC 9(10).
01 C          PIC 9(10).
01 ans        PIC 9(10).
01 ln         PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B C.
  IF A < B + C
    COMPUTE ans = B + C - A
    MOVE ans TO zs
    DISPLAY FUNCTION TRIM(zs)
  ELSE
    DISPLAY ZERO
  END-IF.
  STOP RUN.

