IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC S9(10).
01 Y          PIC S9(10).
01 Z          PIC S9(10).
01 ans        PIC X(30).
01 ln         PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO X Y Z.
  IF X < ZERO AND Y < ZERO AND X < Y AND Z < Y
  DISPLAY -1 STOP RUN.
  IF ZERO < X AND ZERO < Y AND Y < X AND Y < Z
  DISPLAY -1 STOP RUN.
  IF X < ZERO AND Z < ZERO MOVE X TO zs
  ELSE IF ZERO < X AND ZERO < Z MOVE X TO zs
  ELSE IF X < ZERO AND Y < X MOVE X TO zs
  ELSE IF ZERO < X AND X < Y MOVE X TO zs
  ELSE IF X < ZERO AND ZERO < Y MOVE X TO zs
  ELSE IF ZERO < X AND Y < ZERO MOVE X TO zs
  ELSE COMPUTE zs = FUNCTION ABS(Z) + FUNCTION ABS(X - Z).
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

