IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC 9(10).
01 C          PIC 9(10).
01 X          PIC 9(10).
01 ln         PIC X(30).
01 zs         PIC Z(9)9.9(12) VALUE 0.0.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B C X.
  IF X <= A MOVE 1 TO zs
  ELSE IF A < X AND X <= B COMPUTE zs = C / (B - A).
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

