IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC X(201).
01 i          PIC 9(10) COMP.
01 len        PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT X.
  MOVE FUNCTION STORED-CHAR-LENGTH(X) TO len.
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    IF "." = X(i:1) SUBTRACT 1 FROM i EXIT PERFORM
  END-PERFORM.
  DISPLAY FUNCTION TRIM(X(1:i)).
  STOP RUN.

