IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 FCT1.
   03 FCT    PIC 9(10) OCCURS 10.
01 P         PIC 9(10).
01 ans       PIC 9(10) VALUE ZERO.
01 d         PIC 9(10).
01 i         PIC 9(10) COMP.
01 r         PIC 9(10).
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT P.
  MOVE 1 TO FCT(1).
  PERFORM VARYING i FROM 2 BY 1 UNTIL 10 < i
    COMPUTE FCT(i) = i * FCT(i - 1)
  END-PERFORM.
  PERFORM VARYING i FROM 10 BY -1 UNTIL i < 1
    DIVIDE P BY FCT(i) GIVING d REMAINDER r
    IF FCT(i) <= P COMPUTE ans = ans + d MOVE r TO P
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

