IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA PIC X(100000).

WORKING-STORAGE SECTION.
01 L         PIC 9(10).
01 R         PIC 9(10).
01 S         PIC X(100000).
01 chr       PIC X(1).
01 i         PIC 9(10) COMP.
01 j         PIC 9(10) COMP.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN.
  UNSTRING INDATA DELIMITED SPACE INTO L R.
  READ SYSIN INTO S.
  CLOSE SYSIN.
  MOVE R TO j.
  PERFORM VARYING i FROM L BY 1 UNTIL j <= i
    MOVE S(j:1) TO chr
    MOVE S(i:1) TO S(j:1)
    MOVE chr TO S(i:1)
    SUBTRACT 1 FROM j
  END-PERFORM.
  DISPLAY FUNCTION TRIM(S).
  STOP RUN.

