IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A1         PIC 9(10).
01 A2         PIC 9(10).
01 A3         PIC 9(10).
01 A4         PIC 9(10).
01 ans        PIC Z(9)9.
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A1 A2 A3 A4.
  COMPUTE ans = FUNCTION MIN(A1 A2 A3 A4).
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

