IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(3).
01 tmp        PIC 9(4).
01 zs         PIC Z(5).

PROCEDURE DIVISION.
  ACCEPT N.
  COMPUTE tmp = N * (N + 1) / 2.
  MOVE tmp TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

