IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 K          PIC 9(10).
01 N          PIC 9(10).
01 ans        PIC 9(10) VALUE ZERO.
01 i          PIC 9(10) COMP.
01 ln         PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO N K.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    COMPUTE ans = ans + i * 100 * K + (1 + K) * K / 2
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

