IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC 9(10).
01 C          PIC 9(10).
01 V          PIC S9(10).
01 turn       PIC X(1) VALUE "T".
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO V A B C.
  PERFORM UNTIL V < ZERO
    IF "T" = turn SUBTRACT A FROM V MOVE "F" TO turn
    ELSE IF "F" = turn SUBTRACT B FROM V MOVE "M" TO turn
    ELSE IF "M" = turn SUBTRACT C FROM V MOVE "T" TO turn
  END-PERFORM.
  DISPLAY turn.
  STOP RUN.

