IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(2200000).

WORKING-STORAGE SECTION.
01 A1.
   03 A       PIC 9(10) OCCURS 200000 DEPENDING N INDEXED IXA.
01 CPA1.
   03 CPA     PIC 9(10) OCCURS 200000 DEPENDING N.
01 N          PIC 9(10).
01 ans        PIC Z(9)9.
01 i          PIC 9(10) COMP.
01 idx        PIC 9(10).
01 pt         PIC S9(10) VALUE 1.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO N.
  READ SYSIN.
  CLOSE SYSIN.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING INDATA DELIMITED SPACE INTO A(i) POINTER pt
    MOVE A(i) TO CPA(i)
  END-PERFORM.
  SORT CPA DESCENDING CPA.
  SEARCH A
    WHEN CPA(2) = A(IXA)
      MOVE IXA TO idx
  END-SEARCH.
  MOVE idx TO ans.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

