IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 A          PIC 9(10).
01 AB         PIC 9(10).
01 B          PIC 9(10).
01 D          PIC 9(10).
01 R          PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  MULTIPLY A BY B GIVING AB.
  DIVIDE AB BY 2 GIVING D REMAINDER R.
  IF ZERO = R
    DISPLAY "No"
  ELSE
    DISPLAY "Yes"
  END-IF.
  STOP RUN.
