IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S              PIC X(100).
01 ans            PIC X(100).

PROCEDURE DIVISION.
  ACCEPT S.
  MOVE ALL "x" TO ans(1:FUNCTION STORED-CHAR-LENGTH(S))
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

