IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 N          PIC 9(10).
01 K          PIC 9(10).
01 d          PIC 9(10).
01 ln         PIC X(30).
01 r          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO N K A.
  COMPUTE d = A + K - 1.
  DIVIDE d BY N GIVING d REMAINDER r.
  MOVE N TO zs.
  IF ZERO < r MOVE r TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

