IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S         PIC X(10).
01 T         PIC X(12) VALUE "oxxoxxoxxoxx".
01 flg       PIC 9(1) VALUE ZERO.
01 i         PIC 9(10).
01 slen      PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT S.
  MOVE FUNCTION STORED-CHAR-LENGTH(S) TO slen.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 12 - slen + 1 < i
    IF S(1:slen) = T(i:slen) MOVE 1 TO flg EXIT PERFORM
  END-PERFORM.
  IF ZERO = flg DISPLAY "No" ELSE DISPLAY "Yes".
  STOP RUN.

