IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(100).

WORKING-STORAGE SECTION.
01 A1.
   03 A       PIC S9(10) OCCURS 100 DEPENDING ON N INDEXED IXA.
01 N          PIC 9(10).
01 cur        PIC 9(10).
01 flg        PIC 9(1).
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) VALUE 1 COMP.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    READ SYSIN INTO cur
    MOVE ZERO TO flg
    SET IXA TO 1
    SEARCH A
      AT END
        CONTINUE
      WHEN cur = A(IXA)
        MOVE 1 TO flg
      WHEN ZERO = A(IXA)
        MOVE ZERO TO flg
    END-SEARCH
    IF ZERO = flg
      MOVE cur TO A(j)
      ADD 1 TO j
    END-IF
  END-PERFORM.
  CLOSE SYSIN.
  SORT A DESCENDING A.
  MOVE A(2) TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

