IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 X          PIC 9(10).
01 A          PIC 9(10).
01 ans        PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO X A.
  IF X < A
    MOVE "0" TO ans
  ELSE
    MOVE "10" TO ans
  END-IF.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.
