IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A1.
   03 A       PIC 9(1) VALUE ZERO OCCURS 100000.
01 N          PIC 9(10).
01 cnt        PIC 9(10) VALUE ZERO COMP.
01 cur        PIC 9(10).
01 i          PIC 9(10) VALUE 1 COMP.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT cur
    IF 1 = A(cur) THEN
      ADD 1 TO cnt
    ELSE
      MOVE 1 TO A(cur)
    END-IF
  END-PERFORM.
  MOVE cnt TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

