IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(200000).

WORKING-STORAGE SECTION.
01 S          PIC X(200000).
01 T          PIC X(200000).
01 ans        PIC 9(10) VALUE ZERO COMP.
01 i          PIC 9(10) COMP.
01 len        PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO INDATA.
  MOVE INDATA TO S.
  READ SYSIN INTO INDATA.
  MOVE INDATA TO T.
  CLOSE SYSIN.
  MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    IF S(i : 1) NOT = T(i : 1)
      ADD 1 TO ans
    END-IF
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

