IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 X          PIC 9(10).
01 Y          PIC 9(10).
01 Z          PIC 9(10).
01 cnt        PIC 9(10) COMP.
01 i          PIC 9(10) COMP.
01 ln         PIC X(4000).
01 pt         PIC S9(10).
01 score1.
   03 score OCCURS 1000 DEPENDING N.
      05 num  PIC 9(10).
      05 A    PIC 9(10).
      05 B    PIC 9(10).
      05 AB   PIC 9(10).
      05 pass PIC 9(1) VALUE ZERO.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO N X Y Z.
  ACCEPT ln.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    MOVE i TO num(i)
    UNSTRING ln DELIMITED SPACE INTO A(i) POINTER pt
  END-PERFORM.
  ACCEPT ln.
  MOVE 1 TO pt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED SPACE INTO B(i) POINTER pt
    ADD A(i) TO B(i) GIVING AB(i)
  END-PERFORM.
  SORT score DESCENDING A ASCENDING num.
  MOVE ZERO TO cnt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF X <= cnt EXIT PERFORM END-IF
    MOVE 1 TO pass(i) ADD 1 TO cnt
  END-PERFORM.
  SORT score DESCENDING B ASCENDING num.
  MOVE ZERO TO cnt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF Y <= cnt EXIT PERFORM END-IF
    IF ZERO = pass(i) MOVE 1 TO pass(i) ADD 1 TO cnt
  END-PERFORM.
  SORT score DESCENDING AB ASCENDING num.
  MOVE ZERO TO cnt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF Z <= cnt EXIT PERFORM END-IF
    IF ZERO = pass(i) MOVE 1 TO pass(i) ADD 1 TO cnt
  END-PERFORM.
  SORT score ASCENDING num.
  MOVE ZERO TO cnt.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF X + Y + Z <= cnt EXIT PERFORM END-IF
    IF pass(i) = 1 MOVE num(i) TO zs DISPLAY FUNCTION TRIM(zs)
  END-PERFORM.
  STOP RUN.

