IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S              PIC X(30).

PROCEDURE DIVISION.
  ACCEPT S.
  IF S(3:1) = S(4:1) AND S(5:1) = S(6:1)
      DISPLAY "Yes"
  ELSE
      DISPLAY "No"
  END-IF.
  STOP RUN.
