IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S1.
   03 S       PIC X(10) OCCURS 3.
01 T          PIC X(1000).
01 ans        PIC X(11000).
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) VALUE 1.
01 len        PIC 9(10).
01 slen1.
   03 slen    PIC 9(10) OCCURS 3.

PROCEDURE DIVISION.
  ACCEPT S(1).
  ACCEPT S(2).
  ACCEPT S(3).
  ACCEPT T.
  MOVE FUNCTION STORED-CHAR-LENGTH(T) TO len.
  MOVE FUNCTION STORED-CHAR-LENGTH(S(1)) TO slen(1).
  MOVE FUNCTION STORED-CHAR-LENGTH(S(2)) TO slen(2).
  MOVE FUNCTION STORED-CHAR-LENGTH(S(3)) TO slen(3).
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    MOVE FUNCTION TRIM(S(FUNCTION NUMVAL(T(i:1))))
    TO ans(j:slen(FUNCTION NUMVAL(T(i:1))))
    COMPUTE j = j + slen(FUNCTION NUMVAL(T(i:1)))
  END-PERFORM.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

