IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 2B         PIC 9(10) VALUE ZERO.
01 3B         PIC 9(10) VALUE ZERO.
01 H          PIC 9(10) VALUE ZERO.
01 HR         PIC 9(10) VALUE ZERO.
01 S          PIC X(2).

PROCEDURE DIVISION.
  PERFORM 4 TIMES
    ACCEPT S
    EVALUATE FUNCTION TRIM(S)
      WHEN "H"
        ADD 1 TO H
      WHEN "2B"
        ADD 1 TO 2B
      WHEN "3B"
        ADD 1 TO 3B
      WHEN "HR"
        ADD 1 TO HR
    END-EVALUATE
  END-PERFORM.
  IF 1 = H AND 2B AND 3B AND HR DISPLAY "Yes" ELSE DISPLAY "No".
  STOP RUN.

