IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 C          PIC 9(10).
01 H          PIC 9(10).
01 R          PIC 9(10).
01 W          PIC 9(10).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO H W.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO R C.
  IF 1 = H AND 1 = W DISPLAY 0
  ELSE IF H = 1 AND 1 < C AND C < W DISPLAY 2
  ELSE IF H = 1 DISPLAY 1
  ELSE IF W = 1 AND 1 < R AND R < H DISPLAY 2
  ELSE IF W = 1 DISPLAY 1
  ELSE IF 1 < R AND R < H AND 1 < C AND C < W DISPLAY 4
  ELSE IF (R = 1 OR H) AND (C = 1 OR W) DISPLAY 2
  ELSE DISPLAY 3.
  STOP RUN.

