IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(2).

PROCEDURE DIVISION.
  ACCEPT N.
  EVALUATE N
    WHEN 10
      DISPLAY 2
      DISPLAY 2
      DISPLAY 8
    WHEN 9
      DISPLAY 2
      DISPLAY 1
      DISPLAY 8
    WHEN 8
      DISPLAY 1
      DISPLAY 8
    WHEN 7
      DISPLAY 3
      DISPLAY 1
      DISPLAY 2
      DISPLAY 4
    WHEN 6
      DISPLAY 2
      DISPLAY 2
      DISPLAY 4
    WHEN 5
      DISPLAY 2
      DISPLAY 1
      DISPLAY 4
    WHEN 4
      DISPLAY 1
      DISPLAY 4
    WHEN 3
      DISPLAY 2
      DISPLAY 1
      DISPLAY 2
    WHEN 2
      DISPLAY 1
      DISPLAY 2
    WHEN 1
      DISPLAY 1
      DISPLAY 1
  END-EVALUATE.
  STOP RUN.

