IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 s          PIC X(19).

PROCEDURE DIVISION.
  ACCEPT s.
  INSPECT s REPLACING ALL "," BY SPACE.
  DISPLAY s.
  STOP RUN.

