IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 x          PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT x.
  IF ZERO = x THEN
    DISPLAY 1
  ELSE
    DISPLAY ZERO
  END-IF.
  STOP RUN.

