IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 A          PIC 9(10).
01 B          PIC 9(10).
01 d          PIC 9(10).
01 r          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  DIVIDE B BY A GIVING d REMAINDER r.
  IF ZERO < r THEN
    ADD 1 TO d
  END-IF.
  MOVE d TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

