IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(10).
01 ans        PIC 9(10).
01 n          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  PERFORM 12 TIMES
    ACCEPT S
    MOVE ZERO TO n
    INSPECT S TALLYING n FOR ALL "r"
    IF ZERO < n THEN
      ADD 1 TO ans
    END-IF
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

