IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ans        PIC 9(10) VALUE ZERO.
01 zs         PIC Z(9)9.
01 i          PIC 9(10) VALUE 1 COMP.
01 D          PIC 9(10).
01 R          PIC 9(10).
01 AE1.
   03 AE11 OCCURS 5.
      05 AE   PIC 9(10).
01 L1.
   03 L11 OCCURS 5.
      05 L    PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT AE(1).
  ACCEPT AE(2).
  ACCEPT AE(3).
  ACCEPT AE(4).
  ACCEPT AE(5).
  PERFORM VARYING i FROM 1 BY 1 UNTIL 5 < i
    DIVIDE AE(i) BY 10 GIVING D REMAINDER R
    IF ZERO < R
      COMPUTE L(i) = 10 - R
    END-IF
    ADD AE(i) TO ans
  END-PERFORM.
  SORT L11 DESCENDING L.
  PERFORM VARYING i FROM 2 BY 1 UNTIL 5 < i
    ADD L(i) TO ans
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs)
  STOP RUN.
