IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          BINARY-DOUBLE UNSIGNED.
01 B          BINARY-DOUBLE UNSIGNED.
01 K          BINARY-DOUBLE UNSIGNED.
01 cnt        PIC 9(10) VALUE ZERO COMP.
01 ln         PIC X(50).
01 num        BINARY-DOUBLE UNSIGNED.
01 zs         PIC Z(19)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B K.
  MOVE A TO num.
  PERFORM UNTIL B <= num
    MULTIPLY K BY num
    ADD 1 TO cnt
  END-PERFORM
  MOVE cnt TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

