IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC X(2).
01 X1         PIC 9(10).
01 X2         PIC 9(10).
01 ans        PIC 9(10) VALUE ZERO.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT X.
  MOVE X(1:1) TO X1.
  MOVE X(2:1) TO X2.
  ADD X1 TO ans.
  ADD X2 TO ans.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

