IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ft         PIC 9(10).
01 fft        PIC 9(10).
01 fftt       PIC 9(10).
01 ret        PIC 9(10).
01 t          PIC 9(10).
01 x          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT t.
  MOVE t TO x.
  CALL "f" USING BY CONTENT x BY REFERENCE ret.
  MOVE ret TO ft.
  ADD t TO ft GIVING x.
  CALL "f" USING BY CONTENT x BY REFERENCE ret.
  MOVE ret TO fftt.
  CALL "f" USING BY CONTENT ft BY REFERENCE ret.
  MOVE ret TO fft.
  ADD fftt TO fft GIVING x.
  CALL "f" USING BY CONTENT x BY REFERENCE ret.
  MOVE ret TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.
END PROGRAM PROGRAM_ID.

IDENTIFICATION DIVISION.
PROGRAM-ID. f.

DATA DIVISION.
LINKAGE SECTION.
01 x          PIC 9(10).
01 ret        PIC 9(10).

PROCEDURE DIVISION USING x ret.
  INITIALIZE ret
  COMPUTE ret = x ** 2 + 2 * x + 3.
END PROGRAM f.

