IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ABC1.
   03 ABC     PIC 9(10) OCCURS 3.
01 ans        PIC Z(9)9.
01 i          PIC 9(10) COMP.
01 ln         PIC X(30).
01 pt         PIC S9(10) VALUE 1.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
    UNSTRING ln DELIMITED SPACE INTO ABC(i) POINTER pt
  END-PERFORM.
  SORT ABC DESCENDING ABC.
  COMPUTE ans = ABC(1) + ABC(2).
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

