IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(50).
01 len        PIC 9(2).

PROCEDURE DIVISION.
  ACCEPT S.
  COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
  IF S(len:1) = 'T' THEN
      DISPLAY "YES"
  ELSE
      DISPLAY "NO"
  END-IF.
  STOP RUN.

