IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10) VALUE ZERO.
01 N          PIC 9(10).
01 X          PIC 9(10).
01 d          PIC 9(10).
01 i          PIC 9(10).
01 ln         PIC X(400).
01 pt         PIC S9(10) VALUE 1.
01 sm         PIC 9(10) VALUE ZERO.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO N X.
  ACCEPT ln.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED SPACE INTO A POINTER pt
    ADD A TO sm
  END-PERFORM.
  DIVIDE N BY 2 GIVING d.
  IF sm - d <= X DISPLAY "Yes" ELSE DISPLAY "No".
  STOP RUN.

