IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC X(3).
01 B          PIC X(3).
01 BA        PIC X(10).
01 ln         PIC X(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  STRING
    FUNCTION TRIM(B)
    SPACE
    FUNCTION TRIM(A)
    INTO BA
  END-STRING.
  DISPLAY FUNCTION TRIM(BA)
  STOP RUN.

