IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INF        PIC 9(10) VALUE 1000000007.
01 N          PIC 9(6).
01 i          PIC 9(6).
01 tmp        PIC 9(16).
01 zs         PIC Z(17).

PROCEDURE DIVISION.
  ACCEPT N.
  MOVE 1 TO tmp.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    MULTIPLY i BY tmp
    COMPUTE tmp = FUNCTION MOD(tmp, INF)
  END-PERFORM.
  MOVE tmp TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

