IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 W         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT W.
  STRING
    FUNCTION TRIM(W)
    "s"
    INTO W
  END-STRING.
  DISPLAY FUNCTION TRIM(W).
  STOP RUN.

