IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N         PIC 9(10).
01 P         PIC 9(10).
01 V         PIC 9(10).
01 X         PIC 9(10).
01 alc       FLOAT-LONG VALUE ZERO.
01 ans       PIC Z(9)9.
01 i         PIC 9(10).
01 ln        PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO N X.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED SPACE INTO V P
    COMPUTE alc = alc + V * P / 100
    IF X < alc THEN
      EXIT PERFORM
    END-IF
  END-PERFORM.
  IF alc <= X THEN
    DISPLAY -1
  ELSE
    MOVE i TO ans
    DISPLAY FUNCTION TRIM(ans)
  END-IF.
  STOP RUN.

