IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 X          PIC 9(10).
01 Y          PIC 9(10).
01 ln         PIC X(30).
01 q          PIC 9(10).
01 r          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO X Y N.
  DIVIDE N BY 3 GIVING q REMAINDER r.
  COMPUTE zs = FUNCTION MIN(N * X q * Y + r * X).
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

