IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(100000).

WORKING-STORAGE SECTION.
01 i          PIC 9(6) BINARY.
01 len        PIC 9(6).
01 ln         PIC X(50000).
01 m          PIC 9(1).
01 p          PIC 9(5) BINARY.
01 s1.
   03 s       PIC X(1) OCCURS 100000.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO s1.
  CLOSE SYSIN.
  MOVE 1 TO p.
  COMPUTE len = FUNCTION STORED-CHAR-LENGTH(s1).
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    COMPUTE m = FUNCTION MOD(i, 2)
    IF m = 1 THEN
      STRING
        s(i)
        INTO ln WITH POINTER p
      END-STRING
    END-IF
  END-PERFORM
  DISPLAY ln(1:FUNCTION STORED-CHAR-LENGTH(ln)).
  STOP RUN.

