IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 N          PIC 9(10).
01 K          PIC 9(10).
01 ans        PIC X(30).
01 d          PIC 9(3).
01 r          PIC 9(3).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO N K.
  DIVIDE K INTO N GIVING d REMAINDER r.
  IF ZERO = r
    DISPLAY ZERO
  ELSE
    DISPLAY 1
  END-IF.
  STOP RUN.

