IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(10).
01 a          PIC 9(10).
01 b          PIC 9(10).
01 chr        PIC X(1).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT S.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO a b.
  MOVE S(b:1) TO chr.
  MOVE S(a:1) TO S(b:1).
  MOVE chr TO S(a:1).
  DISPLAY FUNCTION TRIM(S).
  STOP RUN.

