IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 HH         PIC 9(2) VALUE 21.
01 K          PIC 9(10).
01 MM         PIC 9(2) VALUE ZERO.
01 q          PIC 9(10).
01 r          PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT K.
  DIVIDE K BY 60 GIVING q REMAINDER r.
  ADD q TO HH.
  ADD r TO MM.
  DISPLAY HH ":" MM.
  STOP RUN.

