IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 ST1.
   03 ST      OCCURS 1000 DEPENDING N.
      05 S    PIC X(15).
      05 T    PIC 9(10).
01 B          PIC 9(10).
01 i          PIC 9(10) COMP.
01 ln         PIC X(30).
01 pt         PIC S9(10) VALUE 1.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED SPACE INTO S(i) T(i)
  END-PERFORM.
  SORT ST DESCENDING T.
  DISPLAY FUNCTION TRIM(S(2)).
  STOP RUN.

