IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 d          PIC 9(10).
01 n          PIC 9(10).
01 r          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT n.
  DIVIDE n BY 2 GIVING d REMAINDER r.
  IF r = 1 THEN
    ADD 1 TO n
  ELSE
    SUBTRACT 1 FROM n
  END-IF.
  MOVE n TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

