IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(30).
01 pp         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT S.
  STRING
    FUNCTION TRIM(S)
    "pp"
    INTO pp
  END-STRING.
  DISPLAY FUNCTION TRIM(pp).
  STOP RUN.

