IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A         PIC 9(10).
01 AB        PIC 9(10).
01 B         PIC 9(10).
01 ln        PIC X(50).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B.
  ADD A TO B GIVING AB.
  IF 15 <= AB AND 8 <= B THEN
    DISPLAY 1
  ELSE
    IF 10 <= AB AND 3 <= B THEN
      DISPLAY 2
    ELSE
      IF 3 <= AB THEN
        DISPLAY 3
      ELSE
        DISPLAY 4
      END-IF
    END-IF
  END-IF.
  STOP RUN.

