IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N         PIC 9(10).
01 ST1.
   03 ST     PIC X(30) OCCURS 1000 DEPENDING N INDEXED IXST.
01 flg       PIC 9(1) VALUE ZERO.
01 i         PIC 9(10) COMP.
01 j         PIC 9(10) VALUE 1 COMP.
01 nm        PIC X(30).

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT nm
    SET IXST TO 1
    SEARCH ST
      WHEN SPACE = ST(IXST)
        CONTINUE
      WHEN nm = ST(IXST)
        MOVE 1 TO flg
    END-SEARCH
    IF 1 = flg EXIT PERFORM
    ELSE MOVE nm TO ST(j) ADD 1 TO j
  END-PERFORM.
  IF 1 = flg DISPLAY "Yes" ELSE DISPLAY "No"
  STOP RUN.

