IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 C          PIC X(100).
01 H          PIC 9(3).
01 W          PIC 9(3).
01 i          PIC 9(3).
01 ln         PIC X(7).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO H W.
  PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
    ACCEPT C
    DISPLAY C(1:FUNCTION STORED-CHAR-LENGTH(C))
    DISPLAY C(1:FUNCTION STORED-CHAR-LENGTH(C))
  END-PERFORM.
  STOP RUN.

