IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC S9(10).
01 ln         PIC X(21).
01 t          PIC 9(10).
01 tmp        PIC 9(10).
01 zs         PIC Z(10)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO X t.
  SUBTRACT t FROM X.
  IF X < 0 THEN
    MOVE 0 TO tmp
  ELSE
    MOVE X TO tmp
  END-IF.
  MOVE tmp TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

