IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 S1.
   03 S       PIC 9(10) OCCURS 20 DEPENDING N.
01 a          PIC 9(10) COMP.
01 ans        PIC 9(10) VALUE ZERO.
01 ar         PIC 9(10).
01 b          PIC 9(10) COMP.
01 flg        PIC 9(1).
01 i          PIC 9(10) COMP.
01 ln         PIC X(100).
01 pt         PIC S9(10) VALUE 1.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  ACCEPT ln.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED SPACE INTO S(i) POINTER pt
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    MOVE ZERO TO flg
    PERFORM VARYING a FROM 1 BY 1 UNTIL 1000 < a
      PERFORM VARYING b FROM 1 BY 1 UNTIL 1000 < b
        COMPUTE ar = 4 * a * b + 3 * a + 3 * b
        IF ar = S(i) MOVE 1 TO flg EXIT PERFORM
        ELSE IF 1000 < ar EXIT PERFORM
      END-PERFORM
      IF 1 = flg EXIT PERFORM
    END-PERFORM
    IF ZERO = flg ADD 1 TO ans
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

