IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Y          PIC 9(4).
01 q          PIC 9(4).
01 r          PIC 9(4).
01 year       PIC 9(4).

PROCEDURE DIVISION.
  ACCEPT Y.
  DIVIDE Y BY 4 GIVING q REMAINDER r.
  EVALUATE r
    WHEN ZERO COMPUTE year = Y + 2
    WHEN 1 COMPUTE year = Y + 1
    WHEN 2 MOVE Y TO year
    WHEN OTHER COMPUTE year = Y + 3
  END-EVALUATE.
  DISPLAY year.
  STOP RUN.

