IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D          PIC 9(3).
01 R          PIC 9(3).
01 a          PIC 9(3).
01 b          PIC 9(3).
01 ln         PIC X(7).
01 zs         PIC Z(3)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO a b.
  ADD a TO b.
  DIVIDE 2 INTO b GIVING D REMAINDER R.
  ADD R TO D.
  MOVE D TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

