IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D         PIC 9(10).
01 N         PIC 9(10).
01 S         PIC 9(10).
01 X         PIC 9(10).
01 Y         PIC 9(10).
01 flg       PIC 9(1) VALUE ZERO.
01 i         PIC 9(10).
01 ln        PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO N S D.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED SPACE INTO X Y
    IF X < S AND D < Y THEN
      MOVE 1 TO flg
      EXIT PERFORM
    END-IF
  END-PERFORM.
  IF 1 = flg THEN
    DISPLAY "Yes"
  ELSE
    DISPLAY "No"
  END-IF.
  STOP RUN.

