IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LN         PIC X(30).
01 A          PIC 9(10).
01 B          PIC 9(10).
01 ANS        PIC Z(9)9(1).

PROCEDURE DIVISION.
  ACCEPT LN.
  UNSTRING LN DELIMITED BY SPACE INTO A B.
  MULTIPLY A BY B GIVING ANS.
  DISPLAY FUNCTION TRIM(ANS).
  STOP RUN.
