IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A1.
   03 A      PIC 9(10) OCCURS 1000 DEPENDING N INDEXED IXA.
01 B1.
   03 B      PIC 9(10) OCCURS 1000 DEPENDING N INDEXED IXB.
01 CA1.
   03 CA     PIC 9(10) OCCURS 1000 DEPENDING N.
01 CB1.
   03 CB     PIC 9(10) OCCURS 1000 DEPENDING N.
01 N         PIC 9(10).
01 ans       PIC 9(10).
01 i         PIC 9(10) COMP.
01 idxa      PIC 9(10) COMP.
01 idxb      PIC 9(10) COMP.
01 j         PIC 9(10) COMP.
01 k         PIC 9(10) COMP.
01 ln        PIC X(30).
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED SPACE INTO A(i) B(i)
    MOVE A(i) TO CA(i)
    MOVE B(i) TO CB(i)
  END-PERFORM.
  SORT CA ASCENDING CA.
  SORT CB ASCENDING CB.
  SEARCH A
    WHEN A(IXA) = CA(1)
      MOVE IXA TO idxa
  END-SEARCH.
  SEARCH B
    WHEN B(IXB) = CB(1)
      MOVE IXB TO idxb
  END-SEARCH.
  IF idxa = idxb THEN
    COMPUTE ans = FUNCTION MIN(
      FUNCTION MAX(CA(1), CB(2))
      FUNCTION MAX(CA(2), CB(1))
      CA(1) + CB(1)
    )
  ELSE
    COMPUTE ans = FUNCTION MAX(CA(1), CB(1))
  END-IF.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

