IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(100000).

WORKING-STORAGE SECTION.
01 S          PIC X(100000).
01 T          PIC 9(10).
01 a          PIC 9(10).
01 d          PIC 9(10).
01 dd         PIC 9(10).
01 dm         PIC 9(10).
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 len        PIC 9(10) COMP.
01 ln         PIC X(400).
01 mn         PIC 9(10).
01 mx         PIC 9(10).
01 q          PIC S9(10) VALUE ZERO COMP.
01 x          PIC S9(10) VALUE ZERO COMP.
01 y          PIC S9(10) VALUE ZERO COMP.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO S.
  READ SYSIN INTO T.
  CLOSE SYSIN.
  COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    EVALUATE S(i:1)
    WHEN "L"
      SUBTRACT 1 FROM x
    WHEN "R"
      ADD 1 TO x
    WHEN "U"
      ADD 1 TO y
    WHEN "D"
      SUBTRACT 1 FROM y
    WHEN OTHER
      ADD 1 TO q
    END-EVALUATE
  END-PERFORM.
  COMPUTE a = FUNCTION ABS(x) + FUNCTION ABS(y).
  COMPUTE mx = a + q.
  COMPUTE mn = a - q.
  IF a < q THEN
    COMPUTE d = q - a
    DIVIDE d BY 2 GIVING dd REMAINDER dm
    IF dm = 1 THEN
      MOVE 1 TO mn
    ELSE
      MOVE ZERO TO mn
    END-IF
  END-IF.
  IF 1 = T THEN
    MOVE mx TO zs
  ELSE
    MOVE mn TO zs
  END-IF.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

