IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT A.
  MULTIPLY A BY 2 GIVING A.
  MOVE A TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

