IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC X(3).
01 AB         PIC X(6).
01 B          PIC X(3).
01 ans        PIC 9(10).
01 ln         PIC X(7).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  STRING
    FUNCTION TRIM(A)
    FUNCTION TRIM(B)
    INTO AB
  END-STRING.
  MOVE FUNCTION TRIM(AB) TO ans.
  MULTIPLY ans BY 2 GIVING ans.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

