IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(3).

PROCEDURE DIVISION.
  ACCEPT S.
  IF S(1:1) = S(2:1) AND S(3:1) DISPLAY 1
  ELSE IF S(1:1) NOT = S(2:1) AND S(3:1) AND S(2:1) NOT = S(3:1)
    DISPLAY 6
  ELSE DISPLAY 3.
  STOP RUN.

