IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA PIC X(100000).

WORKING-STORAGE SECTION.
01 S         PIC X(100000).
01 ans       PIC X(100000) VALUE SPACE.
01 i         PIC 9(10) COMP.
01 len       PIC 9(10).

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO S.
  CLOSE SYSIN.
  MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
  INSPECT S REPLACING ALL "6" BY "_".
  INSPECT S REPLACING ALL "9" BY "6".
  INSPECT S REPLACING ALL "_" BY "9".
  PERFORM VARYING i FROM len BY -1 UNTIL i <= ZERO
    MOVE S(i:1) TO ans(len - i + 1:1)
  END-PERFORM.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

