IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 T1.
   03 T       PIC S9(10) OCCURS 100 DEPENDING N.
01 i          PIC 9(10) COMP.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT T(i)
  END-PERFORM.
  SORT T ASCENDING T.
  MOVE T(1) TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

