IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(100000).

WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 d          PIC 9(10).
01 i          PIC 9(10) COMP.
01 r          PIC 9(10).

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO N.
  READ SYSIN.
  CLOSE SYSIN.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF "1" = INDATA(i:1) EXIT PERFORM
  END-PERFORM.
  DIVIDE i BY 2 GIVING d REMAINDER r.
  IF ZERO = r DISPLAY "Aoki" ELSE DISPLAY "Takahashi".
  STOP RUN.

