IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 ans        PIC X(30).
01 hour       PIC 9(2).
01 min        PIC 9(2).
01 sec        PIC 9(2).

PROCEDURE DIVISION.
  ACCEPT N.
  DIVIDE N BY 60 GIVING N REMAINDER sec.
  DIVIDE N BY 60 GIVING N REMAINDER min.
  DIVIDE N BY 60 GIVING N REMAINDER hour.
  STRING
    hour
    ":"
    min
    ":"
    sec INTO ans
  END-STRING.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

