IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA PIC X(100000).

WORKING-STORAGE SECTION.
01 S         PIC X(100000).
01 T         PIC X(100000).
01 K         PIC S9(10).
01 diff      PIC S9(10).
01 flg       PIC 9(1) VALUE ZERO.
01 i         PIC 9(10) COMP.
01 len       PIC 9(10).
01 num       PIC 9(10).
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO S.
  READ SYSIN INTO T.
  CLOSE SYSIN.
  COMPUTE num = FUNCTION ORD("z") - FUNCTION ORD("a") + 1.
  COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
  COMPUTE K = FUNCTION ORD(T(1:1)) - FUNCTION ORD(S(1:1)).
  IF K < ZERO ADD num TO K.
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    COMPUTE diff = FUNCTION ORD(T(i:1)) - FUNCTION ORD(S(i:1))
    IF diff < ZERO ADD num TO diff END-IF
    IF K NOT = diff MOVE 1 TO flg
  END-PERFORM.
  IF ZERO = flg DISPLAY "Yes" ELSE DISPLAY "No".
  STOP RUN.

