IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ans        PIC X(3).
01 c1         PIC X(3).
01 c2         PIC X(3).
01 c3         PIC X(3).

PROCEDURE DIVISION.
  ACCEPT c1.
  ACCEPT c2.
  ACCEPT c3.
  STRING
    c1(1:1)
    c2(2:1)
    c3(3:1)
    INTO ans
  END-STRING.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

