IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC S9(10).
01 ln         PIC X(23).
01 op         PIC X(1).
01 zs         PIC -(10)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A op B.
  IF op = '+' THEN
    ADD A TO B
  ELSE
    SUBTRACT B FROM A GIVING B
  END-IF.
  MOVE B TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

