IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA    PIC X(1100000).

WORKING-STORAGE SECTION.
01 A         PIC 9(10).
01 N         PIC 9(10).
01 X         PIC 9(10).
01 ans       PIC X(1100000) VALUE SPACE.
01 i         PIC 9(10) COMP.
01 ln        PIC X(1100000).
01 str       PIC Z(9)9.
01 pt        PIC S9(10) VALUE 1.
01 pta       PIC S9(10) VALUE 1.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO ln.
  UNSTRING ln DELIMITED SPACE INTO N X.
  READ SYSIN INTO ln.
  CLOSE SYSIN.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED SPACE INTO A WITH POINTER pt
    IF A NOT = X THEN
      MOVE A TO str
      STRING
        SPACE
        FUNCTION TRIM(str)
        INTO ans
        WITH POINTER pta
      END-STRING
    END-IF
  END-PERFORM.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

