IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC 9(10).
01 ln         PIC X(30).
01 zs         PIC Z(9)9(1).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B.
  MULTIPLY A BY B GIVING zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

