IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 S          PIC X(1000).

PROCEDURE DIVISION.
  ACCEPT N.
  ACCEPT S.
  DISPLAY S(N:1).
  STOP RUN.

