IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  IF 12 = N THEN
    MOVE 1 TO N
  ELSE
    ADD 1 TO N
  END-IF.
  MOVE N TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

