IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 zs         PIC Z(11).

PROCEDURE DIVISION.
  ACCEPT A.
  COMPUTE A = A ** 0.25.
  MOVE A TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

