IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D         PIC 9(10).
01 zs        PIC Z(2)9.9(2).

PROCEDURE DIVISION.
  ACCEPT D.
  COMPUTE zs = D / 100.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

