IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 N      PIC 9(3).
    01 tmp    PIC 9(6).
    01 tmpN   PIC 9(3).
    01 zs     PIC Z(7).

PROCEDURE DIVISION.
  ACCEPT N.
  DIVIDE 15 INTO N GIVING tmpN.
  COMPUTE tmp = 800 * N - tmpN * 200.
  MOVE tmp TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

