IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A1.
   03 A       PIC 9(10) OCCURS 1000 DEPENDING N.
01 N          PIC 9(10).
01 i          PIC 9(10) VALUE 1 COMP.
01 len        PIC 9(10) COMP.
01 ln         PIC X(5000).
01 pt         PIC S9(10) VALUE 1.

PROCEDURE DIVISION.
  ACCEPT N.
  ACCEPT ln.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING ln DELIMITED SPACE INTO A(i) POINTER pt
  END-PERFORM.
  SORT A ASCENDING A.
  MOVE 1 TO i.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF i NOT = A(i) EXIT PERFORM
  END-PERFORM.
  IF N < i DISPLAY "Yes" ELSE DISPLAY "No".
  STOP RUN.

