IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A1.
   03 A      PIC 9(10) OCCURS 100000 DEPENDING N.
01 N         PIC 9(10).
01 P1.
   03 P      PIC 9(10) OCCURS 100000 DEPENDING N.
01 X1.
   03 X      PIC S9(10) OCCURS 100000 DEPENDING N.
01 ans       PIC 9(10) VALUE 1000000007.
01 i         PIC 9(10) COMP.
01 ln        PIC X(50).
01 mx        PIC S9(10) VALUE -1000000007.
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED SPACE INTO A(i) P(i) X(i)
    SUBTRACT A(i) FROM X(i)
    IF mx < X(i) THEN
      MOVE X(i) TO mx
    END-IF
  END-PERFORM.
  IF mx <= ZERO THEN
    DISPLAY -1
  ELSE
    PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
      IF ZERO < X(i) AND P(i) < ans THEN
        MOVE P(i) TO ans
      END-IF
    END-PERFORM
    MOVE ans TO zs
    DISPLAY FUNCTION TRIM(zs)
  END-IF.
  STOP RUN.

