IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC 9(10).
01 ans        PIC 9(10).
01 ln         PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  IF 2 * B < A THEN
    COMPUTE ans = A - 2 * B
    MOVE ans TO zs
    DISPLAY FUNCTION TRIM(zs)
  ELSE
    DISPLAY 0
  END-IF.
  STOP RUN.

