IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(10000).

WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 A          PIC 9(10).
01 ary1.
   03 ary     PIC 9(1) VALUE ZERO OCCURS 2001.
01 i          PIC 9(10) COMP.
01 ln         PIC X(30).
01 pt         PIC S9(10) VALUE 1.
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN INTO N.
  READ SYSIN.
  CLOSE SYSIN.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING INDATA DELIMITED SPACE INTO A POINTER pt
    ADD 1 TO Ary(A + 1)
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 2001 < i
    IF ZERO = Ary(i) COMPUTE zs = i - 1 EXIT PERFORM
  END-PERFORM.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

