IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A11.
   03 A1      OCCURS 2.
      05 A    PIC 9(10) OCCURS 2.
01 C          PIC 9(10).
01 R          PIC 9(10).
01 i          PIC 9(10).
01 ln         PIC X(30).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO R C.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 2 < i
    ACCEPT ln
    UNSTRING ln DELIMITED SPACE INTO A(i 1) A(i 2)
  END-PERFORM.
  MOVE A(R C) TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

