IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 a          PIC 9(3).
01 b          PIC 9(3).
01 h          PIC 9(5).
01 zs         PIC Z(6).

PROCEDURE DIVISION.
  ACCEPT a.
  ACCEPT b.
  ACCEPT h.
  ADD a TO b.
  MULTIPLY b BY h.
  DIVIDE 2 INTO h.
  MOVE h TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

