IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B          PIC 9(10).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  IF A = 1 THEN
    ADD 13 TO A
  END-IF.
  IF B = 1 THEN
    ADD 13 TO B
  END-IF.
  IF B < A THEN
    DISPLAY "Alice"
  ELSE
    IF A < B THEN
      DISPLAY "Bob"
    ELSE
      DISPLAY "Draw"
    END-IF
  END-IF.
  STOP RUN.

