IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N         PIC 9(3).

PROCEDURE DIVISION.
  ACCEPT N.
  IF 42 <= N ADD 1 TO N.
  DISPLAY "AGC" N.
  STOP RUN.

