IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 H          PIC 9(10).
01 B          PIC 9(10).
01 x          PIC 9(10)V9(9).
01 zs         PIC Z(9)9.9(9).

PROCEDURE DIVISION.
  ACCEPT H.
  COMPUTE x = FUNCTION SQRT(H * (12800000 + H)).
  MOVE x TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.
