IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA     PIC X(1100000).

WORKING-STORAGE SECTION.
01 A          PIC 9(10).
01 B1.
   03 B       PIC 9(10) OCCURS 100000 DEPENDING HW.
01 H          PIC 9(10).
01 HW         PIC 9(10).
01 W          PIC 9(10).
01 cur        PIC 9(10).
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 pt         PIC S9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN.
  UNSTRING INDATA DELIMITED SPACE INTO H W.
  MULTIPLY H BY W GIVING HW.
  PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
    READ SYSIN
    MOVE 1 TO pt
    PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
      UNSTRING INDATA DELIMITED SPACE
      INTO B(i + H * (j - 1)) POINTER pt
    END-PERFORM
  END-PERFORM.
  CLOSE SYSIN.
  PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
    MOVE 1 TO pt
    PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
      MOVE B(i + H * (j - 1)) TO zs
      DISPLAY FUNCTION TRIM(zs) SPACE WITH NO ADVANCING
    END-PERFORM
    DISPLAY ""
  END-PERFORM.
  STOP RUN.

