IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 VV         PIC 9(2).
01 m          PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT m.
  IF m < 100 THEN
    MOVE ZERO TO VV
  ELSE
    IF 100 <= m AND m <= 5000 THEN
      DIVIDE m BY 100 GIVING VV
    ELSE
      IF 6000 <= m AND m <= 30000 THEN
        DIVIDE m BY 1000 GIVING VV
        ADD 50 TO VV
      ELSE
        IF 35000 <= m AND m <= 70000 THEN
          DIVIDE m BY 1000 GIVING VV
          SUBTRACT 30 FROM VV
          DIVIDE VV BY 5 GIVING VV
          ADD 80 TO VV
        ELSE
          MOVE 89 TO VV
        END-IF
      END-IF
    END-IF
  END-IF.
  DISPLAY VV.
  STOP RUN.

