IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN_B ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
SELECT SYSIN_S ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN_B.
01 INDATA_B   PIC X(1100000).
FD SYSIN_S.
01 INDATA_S   PIC X(22).

WORKING-STORAGE SECTION.
01 B1.
   03 B       PIC 9(10) OCCURS 100000 DEPENDING HW.
01 H          PIC 9(10).
01 HW         PIC 9(10).
01 W          PIC 9(10).
01 cur        PIC 9(10).
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 ln         PIC X(30).
01 pt         PIC S9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO H W.
  MULTIPLY H BY W GIVING HW.
  IF 50000 <= H
    OPEN INPUT SYSIN_S
    PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
      READ SYSIN_S
      MOVE 1 TO pt
      PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
        UNSTRING INDATA_S DELIMITED SPACE
        INTO B(i + H * (j - 1)) POINTER pt
      END-PERFORM
    END-PERFORM
    CLOSE SYSIN_S
  ELSE
    OPEN INPUT SYSIN_B
    PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
      READ SYSIN_B
      MOVE 1 TO pt
      PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
        UNSTRING INDATA_B DELIMITED SPACE
        INTO B(i + H * (j - 1)) POINTER pt
      END-PERFORM
    END-PERFORM
    CLOSE SYSIN_B
  END-IF.
  PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
    MOVE 1 TO pt
    PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
      MOVE B(i + H * (j - 1)) TO zs
      DISPLAY FUNCTION TRIM(zs) SPACE WITH NO ADVANCING
    END-PERFORM
    DISPLAY SPACE
  END-PERFORM.
  STOP RUN.

