IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(400).
01 maxlen     PIC 9(10) VALUE 100 COMP.
01 cur        PIC 9(10) VALUE 1 COMP.
01 i          PIC 9(10) VALUE 1 COMP.
01 j          PIC 9(10) COMP.
01 len        PIC 9(10) COMP.
01 zs         PIC Z(9)9.
01 N          PIC 9(10).
01 L          PIC 9(10).
01 LSUM       PIC 9(10) VALUE ZERO.
01 LMAX       PIC 9(10) VALUE ZERO.
01 A1.
   03 A11 OCCURS 100 DEPENDING ON N.
      05 A    PIC S9(10).

PROCEDURE DIVISION.
  ACCEPT N.
  ACCEPT ln.
  MOVE N TO maxlen.
  PERFORM maxlen TIMES
    PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
    END-PERFORM
    COMPUTE len = j - cur
    MOVE ln(cur:len) TO L
    COMPUTE cur = j + 1
    ADD 1 TO i
    ADD L TO LSUM
    IF LMAX < L
      MOVE L TO LMAX
    END-IF
  END-PERFORM.
  SUBTRACT LMAX FROM LSUM.
  IF LMAX < LSUM
    DISPLAY "Yes"
  ELSE
    DISPLAY "No"
  END-IF.
  STOP RUN.
