IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC X(10).
01 flg        PIC 9(1) VALUE 1.
01 half       PIC 9(10).
01 i          PIC 9(10) COMP.
01 len        PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT N.
  MOVE FUNCTION STORED-CHAR-LENGTH(N) TO len.
  PERFORM VARYING i FROM len BY -1 UNTIL N(i:1) NOT = ZERO
    MOVE SPACE TO N(i:1)
  END-PERFORM.
  MOVE FUNCTION STORED-CHAR-LENGTH(N) TO len.
  DIVIDE len BY 2 GIVING half.
  PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
    IF N(i:1) NOT = N(len - i + 1:1) MOVE ZERO TO flg EXIT PERFORM
  END-PERFORM.
  IF 1 = flg DISPLAY "Yes" ELSE DISPLAY "No".
  STOP RUN.

