IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 D1         PIC 9(10).
01 D2         PIC 9(10).
01 N          PIC 9(10).
01 cnt        PIC 9(10) VALUE ZERO.
01 i          PIC 9(10) COMP.
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i OR 3 <= cnt
    ACCEPT ln
    UNSTRING ln DELIMITED BY SPACE INTO D1 D2
    IF D1 = D2 THEN
      ADD 1 TO cnt
    ELSE
      MOVE ZERO TO cnt
    END-IF
  END-PERFORM.
  IF 3 <= cnt THEN
    DISPLAY "Yes"
  ELSE
    DISPLAY "No"
  END-IF.
  STOP RUN.

