IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 G          PIC 9(4).
01 R          PIC S9(4).
01 zs         PIC -(5)9.

PROCEDURE DIVISION.
  ACCEPT R.
  ACCEPT G.
  SUBTRACT R FROM G GIVING R.
  ADD G TO R.
  MOVE R TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

