IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(4).
01 ans        PIC X(3).
01 tmp        PIC 9(4).
01 zs         PIC Z(3)9.
PROCEDURE DIVISION.
  ACCEPT N.
  DIVIDE 3 INTO N GIVING tmp.
  MOVE tmp TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

