IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 a         PIC 9(10).
01 ans       PIC Z(9)9.
01 b         PIC 9(10).
01 c         PIC 9(10).
01 ln        PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO a b c.
  COMPUTE ans = 7 * 3 - a - b - c.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

