IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A         PIC 9(10).
01 B         PIC 9(10).
01 ans       PIC Z(9)9.9(20).
01 ln        PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B.
  COMPUTE ans = (1 - B / A) * 100.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

