IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC X(4).

PROCEDURE DIVISION.
  ACCEPT N.
  IF N(1:1) = N(2:1) AND N(3:1) AND N(4:1) THEN
    DISPLAY "SAME"
  ELSE
    DISPLAY "DIFFERENT"
  END-IF.
  STOP RUN.

