IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A11.
   03 A1      OCCURS 50.
      05 A    PIC 9(10) OCCURS 50.
01 H          PIC 9(10).
01 W          PIC 9(10).
01 flg        PIC 9(10) VALUE ZERO.
01 i          PIC 9(10) COMP.
01 j          PIC 9(10) COMP.
01 ln         PIC X(550).
01 pt         PIC S9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO H W.
  PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
    MOVE 1 TO pt
    ACCEPT ln
    PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
      UNSTRING ln DELIMITED SPACE INTO A(i j) POINTER pt
    END-PERFORM
  END-PERFORM.
  PERFORM VARYING i FROM 1 BY 1 UNTIL H - 1 < i
    PERFORM VARYING j FROM 1 BY 1 UNTIL W - 1 < j
      IF A(i + 1 j) + A(i j + 1) < A(i j) + A(i + 1 j + 1)
        MOVE 1 TO flg
        EXIT PERFORM
      END-IF
    END-PERFORM
    IF 1 = flg EXIT PERFORM END-IF
  END-PERFORM.
  IF 1 = flg DISPLAY "No" ELSE DISPLAY "Yes".
  STOP RUN.

