IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X         PIC 9(10).
01 d         PIC 9(10).
01 r         PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT X.
  DIVIDE X BY 100 GIVING d REMAINDER r.
  IF ZERO = X DISPLAY "No"
  ELSE IF ZERO < r DISPLAY "No"
  ELSE DISPLAY "Yes".
  STOP RUN.

