IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(400).
01 ans        PIC 9(10).
01 zs         PIC Z(9)9.
01 r          PIC 9(10).
01 D          PIC 9(10).
01 x          PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO r D x.
  PERFORM 10 TIMES
    COMPUTE x = r * x - D
    MOVE x TO zs
    DISPLAY FUNCTION TRIM(zs)
  END-PERFORM.
  STOP RUN.
