IDENTIFICATION DIVISION.
PROGRAM-ID. ABC_163_A.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 R          PIC 9(3)V9(7).
01 ans        PIC 9(3)V9(7).
01 pi         PIC 9(3)V9(7) VALUE 3.1415926.
01 zs         PIC Z(2)9.9(7).

PROCEDURE DIVISION.
  ACCEPT R.
  COMPUTE ans = 2 * R * pi.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

