IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC X(1).
01 Y          PIC X(1).
01 ln         PIC X(3).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO X Y.
  IF X < Y THEN
    DISPLAY '<'
  ELSE
    IF X = Y THEN
      DISPLAY '='
    ELSE
      DISPLAY '>'
    END-IF
  END-IF.
  STOP RUN.

