IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 C          PIC 9(10).
01 R          PIC 9(10).
01 QC         PIC 9(10).
01 QR         PIC 9(10).
01 RC         PIC 9(10).
01 RR         PIC 9(10).
01 ln         PIC X(30).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO R C.
  DIVIDE C BY 2 GIVING QC REMAINDER RC.
  DIVIDE R BY 2 GIVING QR REMAINDER RR.
  IF C < FUNCTION MIN(R 15 - R + 1)
  OR FUNCTION MAX(R 15 - R + 1) < C
    IF 1 = RC DISPLAY "black"
    ELSE DISPLAY "white"
  ELSE
    IF 1 = RR DISPLAY "black"
    ELSE DISPLAY "white".
  STOP RUN.

