IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC X(11).

PROCEDURE DIVISION.
  ACCEPT A.
  IF FUNCTION TRIM(A) = "a" THEN
    DISPLAY -1
  ELSE
    DISPLAY "a"
  END-IF.
  STOP RUN.

