IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 n          PIC 9(10).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT n.
  SUBTRACT 1 FROM n.
  MOVE n TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

