IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  INSPECT ln REPLACING FIRST "17/" BY "18/".
  DISPLAY ln.
  STOP RUN.

