IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 H         PIC 9(10).
01 M         PIC 9(10).
01 d         PIC 9(10).
01 ln        PIC X(30).
01 r         PIC 9(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO M H.
  DIVIDE H BY M GIVING d REMAINDER r.
  IF ZERO = r THEN
    DISPLAY "Yes"
  ELSE
    DISPLAY "No"
  END-IF.
  STOP RUN.

