IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ans        PIC Z(9)9.
01 x          PIC S9(10).

PROCEDURE DIVISION.
  ACCEPT x.
  IF ZERO <= x THEN
    MOVE x TO ans
  ELSE
    MOVE ZERO TO ans
  END-IF.
  DISPLAY FUNCTION TRIM(ans).
  STOP RUN.

