IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SYSIN.
01 INDATA PIC X(700000).

WORKING-STORAGE SECTION.
01 A1.
   03 A      PIC 9(10) OCCURS 100000 DEPENDING N.
01 N         PIC 9(10).
01 X         PIC 9(10).
01 ans       PIC 9(10) COMP.
01 bools1.
   03 bools  PIC 9(10) VALUE ZERO OCCURS 100000 DEPENDING N.
01 friend    PIC 9(10).
01 i         PIC 9(10) COMP.
01 pt        PIC 9(10) VALUE 1.
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN.
  READ SYSIN.
  UNSTRING INDATA DELIMITED SPACE INTO N X.
  READ SYSIN.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    UNSTRING INDATA DELIMITED SPACE INTO A(i) POINTER pt
  END-PERFORM.
  CLOSE SYSIN.
  MOVE X TO friend.
  PERFORM UNTIL ZERO NOT = bools(friend)
    ADD 1 TO ans
    MOVE 1 TO bools(friend)
    MOVE A(friend) TO friend
  END-PERFORM.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

