IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC X(50).
01 B          PIC X(50).

PROCEDURE DIVISION.
  ACCEPT A.
  ACCEPT B.
  IF FUNCTION STORED-CHAR-LENGTH(B)
  < FUNCTION STORED-CHAR-LENGTH(A) THEN
    DISPLAY FUNCTION TRIM(A)
  ELSE
    DISPLAY FUNCTION TRIM(B)
  END-IF.
  STOP RUN.

