IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 H          PIC 9(3).
01 SHP        PIC X(1) VALUE '#'.
01 W          PIC 9(3).
01 a          PIC X(100).
01 i          PIC 9(3).
01 ln         PIC X(7).
01 ln2        PIC X(102).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO H W.
  *> 初期化不要
  PERFORM VARYING i FROM 1 BY 1 UNTIL W + 2 < i
    STRING
      ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
      SHP
      INTO ln2
    END-STRING
  END-PERFORM.
  DISPLAY ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2)).
  PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
    ACCEPT a
    *> 初期化
    MOVE SHP TO ln2
    STRING
      ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
      a
      INTO ln2
    END-STRING
    STRING
      ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
      SHP
      INTO ln2
    END-STRING
    DISPLAY ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
  END-PERFORM.
  *> 初期化
  MOVE SPACE TO ln2.
  PERFORM VARYING i FROM 1 BY 1 UNTIL W + 2 < i
    STRING
      ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
      SHP
      INTO ln2
    END-STRING
  END-PERFORM.
  DISPLAY ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2)).
  STOP RUN.

