IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 n          PIC X(3).
01 i          PIC 9(10) COMP.

PROCEDURE DIVISION.
  ACCEPT n.
  PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
    IF n(i:1) = "1"
      MOVE "9" TO n(i:1)
    ELSE
      MOVE "1" TO n(i:1)
    END-IF
  END-PERFORM.
  DISPLAY n.
  STOP RUN.
