IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A         BINARY-DOUBLE.
01 A10       PIC 9(10) VALUE ZERO.
01 B         BINARY-DOUBLE.
01 B10       PIC 9(10) VALUE ZERO.
01 K         PIC 9(10).
01 d         PIC 9(10).
01 i         PIC 9(10) COMP.
01 ln        PIC X(50).
01 r         PIC 9(10).
01 zs        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT K.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B.
  PERFORM WITH TEST AFTER
  VARYING i FROM ZERO BY 1 UNTIL A <= ZERO
    DIVIDE A BY 10 GIVING A REMAINDER r
    COMPUTE A10 = A10 + r * K ** i
  END-PERFORM.
  PERFORM WITH TEST AFTER
  VARYING i FROM ZERO BY 1 UNTIL B <= ZERO
    DIVIDE B BY 10 GIVING B REMAINDER r
    COMPUTE B10 = B10 + r * K ** i
  END-PERFORM.
  COMPUTE zs = A10 * B10.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

