IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(7).
01 n          PIC 9(3).
01 tmp        PIC 9(3).
01 x          PIC 9(3).
01 zs         PIC Z(3)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO n x.
  COMPUTE tmp = FUNCTION MIN (x - 1, n - x).
  MOVE tmp TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

