IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 H1         PIC 9(10).
01 H2         PIC 9(10).
01 ans        PIC S9(30).
01 zs         PIC -(9)9.

PROCEDURE DIVISION.
  ACCEPT H1.
  ACCEPT H2.
  SUBTRACT H2 FROM H1 GIVING ans.
  MOVE ans TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

