IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 abc1.
   03 abc     PIC 9(10) OCCURS 3.
01 ln         PIC X(400).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO abc(1) abc(2) abc(3)
  SORT abc ASCENDING abc.
  MOVE abc(2) TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

