IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(10).
01 SP1.
   03 SP11 OCCURS 1000 DEPENDING ON N.
      05 S    PIC X(20).
      05 P    PIC 9(10).
01 ans        PIC X(20).
01 half       PIC 9(10).
01 i          PIC 9(10) COMP.
01 ln         PIC X(400).
01 num        PIC 9(10) VALUE ZERO.

PROCEDURE DIVISION.
  ACCEPT N.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    ACCEPT ln
    UNSTRING ln DELIMITED BY SPACE INTO S(i) P(i)
    ADD P(i) TO num
  END-PERFORM.
  DIVIDE num BY 2 GIVING half.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
    IF half < P(i) THEN
      MOVE S(i) TO ans
      EXIT PERFORM
    END-IF
  END-PERFORM.
  IF ZERO NOT = FUNCTION STORED-CHAR-LENGTH(ans) THEN
    DISPLAY FUNCTION TRIM(ans)
  ELSE
    DISPLAY "atcoder"
  END-IF.
  STOP RUN.

