IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 a          PIC X(1).
01 b          PIC X(1).
01 ln         PIC X(3).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO a b.
  IF a = 'H' THEN
    DISPLAY b
  ELSE
    IF b = 'H' THEN
      DISPLAY 'D'
    ELSE
      DISPLAY 'H'
    END-IF
  END-IF.
  STOP RUN.

