IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC 9(2).
01 T          PIC 9(4).
01 a          PIC 9(3).
01 b          PIC 9(4).
01 ln         PIC X(12).
01 zs         PIC Z(4)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE
  INTO N A B.
  IF A * N <= B THEN
    MULTIPLY A BY N GIVING T
  ELSE
    MOVE B TO T
  END-IF
  MOVE T TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

