IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A         PIC 9(10).
01 B         PIC 9(10).
01 W         PIC 9(10).
01 da        PIC 9(10).
01 db        PIC 9(10).
01 ln        PIC X(30).
01 rb        PIC 9(10).
01 za        PIC Z(9)9.
01 zb        PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED SPACE INTO A B W.
  MULTIPLY W BY 1000 GIVING W.
  DIVIDE W BY A GIVING da.
  DIVIDE W BY B GIVING db REMAINDER rb.
  IF ZERO NOT = rb THEN
    ADD 1 TO db
  END-IF.
  IF da < db THEN
    DISPLAY "UNSATISFIABLE"
  ELSE
    MOVE da TO za
    MOVE db TO zb
    DISPLAY FUNCTION TRIM(zb) SPACE FUNCTION TRIM(za)
  END-IF.
  STOP RUN.

