IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC X(1).

PROCEDURE DIVISION.
  ACCEPT X.
  EVALUATE X
    WHEN "A"
      DISPLAY 1
    WHEN "B"
      DISPLAY 2
    WHEN "C"
      DISPLAY 3
    WHEN "D"
      DISPLAY 4
    WHEN "E"
      DISPLAY 5
    WHEN OTHER
      CONTINUE
  END-EVALUATE.
  STOP RUN.

