IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(5).
01 B          PIC 9(9).
01 C          PIC 9(5).
01 D          PIC 9(9).
01 ln         PIC X(23).
01 zs         PIC Z(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B C D.
  MULTIPLY A BY B.
  MULTIPLY C BY D.
  COMPUTE B = FUNCTION MAX(B, D).
  MOVE B TO zs.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

