IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X          PIC 9(10)V9(3).
01 zs         PIC Z(9)9.

PROCEDURE DIVISION.
  ACCEPT X.
  COMPUTE zs ROUNDED = X.
  DISPLAY FUNCTION TRIM(zs).
  STOP RUN.

