000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_175_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 L1.
000007    03 L       PIC 9(10) OCCURS 100 DEPENDING N.
000008 01 N          PIC 9(10).
000009 01 cnt        PIC 9(10) VALUE ZERO COMP.
000010 01 cur        PIC 9(10) VALUE 1 COMP.
000011 01 i          PIC 9(10) VALUE 1 COMP.
000012 01 j          PIC 9(10) COMP.
000013 01 k          PIC 9(10) COMP.
000014 01 len        PIC 9(10) COMP.
000015 01 ln         PIC X(2000).
000016 01 zs         PIC Z(9)9.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT N.
000020   ACCEPT ln.
000021   PERFORM N TIMES
000022     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000023     END-PERFORM
000024     COMPUTE len = j - cur
000025     MOVE ln(cur:len) TO L(i)
000026     COMPUTE cur = j + 1
000027     ADD 1 TO i
000028   END-PERFORM.
000029   SORT L ASCENDING L.
000030   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000031     ADD 1 TO i GIVING j
000032     PERFORM VARYING j FROM j BY 1 UNTIL N < j
000033       ADD 1 TO j GIVING k
000034       PERFORM VARYING k FROM k BY 1 UNTIL N < k
000035         IF L(k) < L(i) + L(j)
000036         AND L(i) NOT = L(j)
000037         AND L(j) NOT = L(k)
000038         AND L(k) NOT = L(i) THEN
000039           ADD 1 TO cnt
000040         END-IF
000041       END-PERFORM
000042     END-PERFORM
000043   END-PERFORM.
000044   MOVE cnt TO zs.
000045   DISPLAY FUNCTION TRIM(zs).
000046   STOP RUN.

