000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_129_B.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005 01 ln         PIC X(400).
000006 01 maxlen     PIC 9(10) VALUE 100 COMP.
000007 01 cur        PIC 9(10) VALUE 1 COMP.
000008 01 i          PIC 9(10) VALUE 1 COMP.
000009 01 j          PIC 9(10) COMP.
000010 01 k          PIC 9(10) COMP.
000011 01 len        PIC 9(10) COMP.
000012 01 ans        PIC 9(10) VALUE 1000000007.
000013 01 num        PIC 9(10) VALUE ZERO.
000014 01 df         PIC 9(10) VALUE ZERO.
000015 01 sm         PIC 9(10) VALUE ZERO.
000016 01 zs         PIC Z(9)9.
000017 01 N          PIC 9(10).
000018 01 W1.
000019    03 W11 OCCURS 100 DEPENDING ON N.
000020       05 W    PIC S9(10).
000021 PROCEDURE DIVISION.
000022   ACCEPT N.
000023   ACCEPT ln.
000024   MOVE N TO maxlen.
000025   PERFORM maxlen TIMES
000026     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000027     END-PERFORM
000028     COMPUTE len = j - cur
000029     MOVE ln(cur:len) TO W(i)
000030     ADD W(i) TO sm
000031     COMPUTE cur = j + 1
000032     ADD 1 TO i
000033   END-PERFORM.
000034   PERFORM VARYING k FROM 1 BY 1 UNTIL N < k
000035     ADD W(k) TO num
000036     COMPUTE df = sm - 2 * num
000037     IF df < ans
000038       COMPUTE ans = df
000039     END-IF
000040   END-PERFORM.
000041   MOVE ans TO zs.
000042   DISPLAY FUNCTION TRIM(zs).
000043   STOP RUN.
