000001 PROGRAM-ID. ABC_271_A.
000002 DATA DIVISION.
000003 WORKING-STORAGE SECTION.
000004 01 VAL_A      PIC 9(10).
000005 01 VAL_B      PIC 9(10).
000006 01 NUM_OFF    EXTERNAL PIC 9(1).
000007 01 NUM_ON     EXTERNAL PIC 9(1).
000008 01 NUM_X      EXTERNAL PIC 9(1).
000009 01 X          PIC 9(10).
000010 01 a1.
000011    03 a11 OCCURS 20 DEPENDING ON n.
000012       05 a    PIC 9(10).
000013 01 b_txt      PIC X(32) VALUE SPACE.
000014 01 cur        PIC 9(10) VALUE 1 COMP.
000015 01 cr         PIC 9(10) VALUE 1.
000016 01 d_num      PIC 9(10) VALUE ZERO.
000017 01 h_a        PIC X(4) VALUE X"00000000".
000018 01 h_b        PIC X(4) VALUE X"00000000".
000019 01 h_num      PIC X(4) VALUE X"00000000".
000020 01 h_txt      PIC X(8) VALUE SPACE.
000021 01 i          PIC 9(10) VALUE 1 COMP.
000022 01 j          PIC 9(10) COMP.
000023 01 ln         PIC X(100).
000024 01 len        PIC 9(10) COMP.
000025 01 maxlen     PIC 9(10) VALUE 100 COMP.
000026 01 n          PIC 9(10).
000027 01 n_bit      PIC 9(1).
000028 01 r          PIC 9(10).
000029 01 sm         PIC 9(10) VALUE ZERO.
000030 01 x_th       PIC 9(2) VALUE ZERO.
000031 01 x_div      PIC 9(1) VALUE ZERO.
000032 01 zs         PIC Z(9)9.
000033 
000034 PROCEDURE DIVISION.
000035   ACCEPT ln.
000036   UNSTRING ln DELIMITED SPACE INTO VAL_A VAL_B.
000037   *> 外部データ
000038   *> 実行単位中の複数のプログラムで使用する定数を設定
000039   CALL "SET_EXTERNAL".
000040   *> 2進数 対応表 FROM 0 TO 15
000041   CALL "B_TABLE".
000042   *> 10進数 を 16進数 に変換
000043   CALL "DCM_TO_HEX" USING BY CONTENT VAL_A
000044                           BY REFERENCE h_a.
000045 *>   CALL "DCM_TO_HEX" USING BY CONTENT VAL_B
000046 *>                           BY REFERENCE h_b.
000047 *>   CALL "CBL_XOR" USING h_a, h_b, BY VALUE 4.
000048   *> 16進数 を 2進数、10進数 に変換
000049 *>   CALL "HEX_TO_OTHER" USING BY CONTENT h_b
000050   CALL "HEX_TO_OTHER" USING BY CONTENT h_a
000051                             BY REFERENCE b_txt
000052                             BY REFERENCE d_num
000053                             BY REFERENCE h_txt.
000054 *>   MOVE d_num TO zs.
000055 *>   DISPLAY FUNCTION TRIM(zs).
000056   DISPLAY h_txt(7:2).
000057   STOP RUN.
000058 END PROGRAM ABC_271_A.
000059 
000060 PROGRAM-ID. SET_EXTERNAL.
000061 *> 外部データ
000062 *> 実行単位中の複数のプログラムで使用する定数を設定
000063 *> external data
000064 *> Set constants used for multiple programs in running unit
000065 DATA DIVISION.
000066 WORKING-STORAGE SECTION.
000067     01 BNY     EXTERNAL PIC 9(1).
000068     01 BIT4    EXTERNAL PIC 9(1).
000069     01 BYT4    EXTERNAL PIC 9(1).
000070     01 BYT32   EXTERNAL PIC 9(2).
000071     01 BYT256  EXTERNAL PIC 9(3).
000072     01 HXD     EXTERNAL PIC 9(2).
000073     01 NUM_OFF EXTERNAL PIC 9(1).
000074     01 NUM_ON  EXTERNAL PIC 9(1).
000075     01 NUM_X   EXTERNAL PIC 9(1).
000076     01 OCT     EXTERNAL PIC 9(1).
000077 
000078 *> 16進数 対応表 FROM 0 TO 15
000079     01 H_TBL1 EXTERNAL.
000080         03 H_TBL11 OCCURS 16.
000081             05 H_TBL PIC X(1).
000082 
000083 PROCEDURE DIVISION.
000084     MOVE 2 TO BNY.
000085     MOVE 4 TO BIT4.
000086     MOVE 4 TO BYT4.
000087     MOVE 32 TO BYT32.
000088     MOVE 256 TO BYT256.
000089     MOVE 16 TO HXD.
000090     MOVE 0 TO NUM_OFF.
000091     MOVE 1 TO NUM_ON.
000092     MOVE 9 TO NUM_X.
000093     MOVE 8 TO OCT.
000094 
000095     MOVE "0123456789ABCDEF" TO H_TBL1.
000096 END PROGRAM SET_EXTERNAL.
000097 
000098 PROGRAM-ID. B_TABLE.
000099 *> 2進数 対応表 FROM 0 TO 15
000100 *> 0001
000101 *> 0010
000102 *> 中略
000103 *> 1111
000104 DATA DIVISION.
000105 WORKING-STORAGE SECTION.
000106 *> 16
000107     01 HXD     EXTERNAL PIC 9(2).
000108 *> 2
000109     01 BNY     EXTERNAL PIC 9(1).
000110 *> 4
000111     01 BYT4    EXTERNAL PIC 9(1).
000112 *> 8
000113     01 OCT     EXTERNAL PIC 9(1).
000114 
000115     01 p       PIC 9(1).
000116 
000117     01 i       PIC 9(8).
000118     01 j       PIC 9(8).
000119 
000120     01 q       PIC 9(2).
000121     01 r       PIC 9(1).
000122 
000123     01 s       PIC X(1).
000124     01 str     PIC X(4).
000125 
000126     01 len     PIC 9(1).
000127     01 idx     PIC 9(2).
000128 
000129 *> 2進数 対応表 FROM 0 TO 15
000130     01 B_TBL1 EXTERNAL.
000131         03 B_TBL11 OCCURS 16.
000132             05 B_TBL PIC X(4).
000133 
000134 PROCEDURE DIVISION.
000135 *> FROM 0 TO 15
000136     PERFORM VARYING i FROM 0 BY 1 UNTIL HXD <= i
000137 
000138         MOVE i TO q
000139         MOVE ALL ZERO TO str
000140 
000141 *> 繰り返し 2 で割る
000142         PERFORM VARYING j FROM 0 BY 1 UNTIL q <= 0
000143 
000144             DIVIDE BNY INTO q GIVING q REMAINDER r
000145 
000146             COMPUTE p = FUNCTION STORED-CHAR-LENGTH(str)
000147             SUBTRACT j FROM p
000148 
000149             MOVE r TO s
000150 
000151             STRING
000152                 s
000153                 INTO str WITH POINTER p
000154             END-STRING
000155 
000156         END-PERFORM
000157 
000158         ADD 1 TO i GIVING idx
000159 *> 2進数 対応表 設定
000160         MOVE str TO B_TBL(idx)
000161 
000162     END-PERFORM.
000163 END PROGRAM B_TABLE.
000164 
000165 PROGRAM-ID. DCM_TO_HEX.
000166 *> 10進数 を 16進数 に変換
000167 *> 4 byte (32 bit) 用
000168 *> Convert decimal number to hexadecimal number
000169 *> For 4 byte (32 bit)
000170 DATA DIVISION.
000171 WORKING-STORAGE SECTION.
000172 *> 2
000173     01 BNY     EXTERNAL PIC 9(1).
000174 *> 4
000175     01 BYT4    EXTERNAL PIC 9(1).
000176 *> 256
000177     01 BYT256  EXTERNAL PIC 9(3).
000178 *> 8
000179     01 OCT     EXTERNAL PIC 9(1).
000180 
000181     01 d       PIC 9(3) BINARY.
000182 
000183     01 filler REDEFINES d.
000184         03 filler PIC X.
000185         03 dbyte  PIC X.
000186 
000187     01 i       PIC 9(1).
000188     01 idx     PIC 9(1).
000189 
000190     01 q       PIC 9(10).
000191     01 r       PIC 9(3).
000192 
000193 LINKAGE SECTION.
000194 *> (IN)  d_num
000195 *> (OUT) h_num
000196     01 d_num   PIC 9(10).
000197     01 h_num   PIC X(4).
000198 
000199 PROCEDURE DIVISION USING d_num h_num.
000200     INITIALIZE h_num
000201     MOVE d_num TO q
000202 
000203 *> 1 byte ずつ処理
000204     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH of h_num < i
000205 *> 4 - i
000206         COMPUTE idx = BYT4 - i
000207 
000208 *> 10進数 を 256 で割る
000209         DIVIDE BYT256 INTO q GIVING q REMAINDER r
000210 
000211 *> 余り(10進数 1 byte) を 代入することで
000212         MOVE r TO d
000213 
000214 *> 16進数 を得ることができる
000215         MOVE dbyte TO h_num(idx + 1:1)
000216     END-PERFORM.
000217 END PROGRAM DCM_TO_HEX.
000218 
000219 PROGRAM-ID. HEX_TO_OTHER.
000220 *> 16進数 を 2進数、10進数 に変換
000221 *> 4 byte (32 bit) 用
000222 *> Convert hexadecimal number to binary number, decimal number
000223 *> For 4 byte (32 bit)
000224 DATA DIVISION.
000225 WORKING-STORAGE SECTION.
000226 *> 4
000227     01 BIT4    EXTERNAL PIC 9(1).
000228 *> 2
000229     01 BNY     EXTERNAL PIC 9(1).
000230 *> 4
000231     01 BYT4    EXTERNAL PIC 9(1).
000232 *> 256
000233     01 BYT256  EXTERNAL PIC 9(3).
000234 *> 16
000235     01 HXD     EXTERNAL PIC 9(2).
000236 *> 8
000237     01 OCT     EXTERNAL PIC 9(1).
000238 
000239     01 d       PIC 9(3) BINARY.
000240 
000241     01 filler REDEFINES d.
000242         03 filler PIC X.
000243         03 dbyte  PIC X.
000244 
000245     01 i       PIC 9(1).
000246 
000247     01 j       PIC 9(1).
000248     01 k       PIC 9(2).
000249     01 m       PIC 9(1).
000250 
000251     01 q       PIC 9(10).
000252     01 r       PIC 9(2).
000253 
000254 *> 2進数 対応表 FROM 0 TO 15
000255     01 B_TBL1 EXTERNAL.
000256         03 B_TBL11 OCCURS 16.
000257             05 B_TBL PIC X(4).
000258 
000259 *> 16進数 対応表 FROM 0 TO 15
000260     01 H_TBL1 EXTERNAL.
000261         03 H_TBL11 OCCURS 16.
000262             05 H_TBL PIC X(1).
000263 
000264 LINKAGE SECTION.
000265 *> (IN)  h_num
000266 *> (OUT) b_txt
000267 *>       d_num
000268 *>       h_txt
000269     01 h_num   PIC X(4).
000270     01 b_txt   PIC X(32).
000271     01 d_num   PIC 9(10).
000272     01 h_txt   PIC X(8).
000273 
000274 PROCEDURE DIVISION USING h_num b_txt d_num h_txt.
000275     INITIALIZE b_txt
000276     INITIALIZE d_num
000277     INITIALIZE h_txt
000278 
000279 *> 1 byte ずつ処理
000280     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH OF h_num < i
000281 *> 2 * i - 1
000282         COMPUTE j = BNY * i - 1
000283 
000284 *> 8 * i - 7
000285         COMPUTE k = OCT * (i - 1) + 1
000286 
000287 *> 7 - (2 * i - 1)
000288         COMPUTE m = OCT - BNY * i
000289 
000290 *> 16進数 1 byte を 代入することで
000291         MOVE h_num(i:1) TO dbyte
000292 
000293 *> 得られた 10進数 を 16 で割る
000294         DIVIDE HXD INTO d GIVING q REMAINDER r
000295 
000296 *> 前から格納していく
000297 *> [F]
000298         MOVE H_TBL(q + 1) TO h_txt(j:1)
000299 *> [FF]
000300         MOVE H_TBL(r + 1) TO h_txt(j + 1:1)
000301 
000302 *> [1111]
000303         MOVE B_TBL(q + 1) TO b_txt(k:BIT4)
000304 *> [11111111]
000305         MOVE B_TBL(r + 1) TO b_txt(k + BIT4:BIT4)
000306 
000307 *> 16^0 の位 から 16^7 の位 までの 8桁
000308 *> 10進数 上位桁 足し込み
000309         COMPUTE d_num = d_num + HXD ** (m + 1) * q
000310 
000311 *> 10進数 下位桁 足し込み
000312         COMPUTE d_num = d_num + HXD ** m * r
000313     END-PERFORM.
000314 END PROGRAM HEX_TO_OTHER.
000315 
000316 PROGRAM-ID. DCM_TO_BNY.
000317 *> 10進数 を 2進数 に変換
000318 *> 4 byte (32 bit) 用
000319 *> Convert decimal number to binary number
000320 *> For 4 byte (32 bit)
000321 DATA DIVISION.
000322 WORKING-STORAGE SECTION.
000323 *> 4
000324     01 BIT4    EXTERNAL PIC 9(1).
000325 *> 2
000326     01 BNY     EXTERNAL PIC 9(1).
000327 *> 4
000328     01 BYT4    EXTERNAL PIC 9(1).
000329 *> 32
000330     01 BYT32   EXTERNAL PIC 9(2).
000331 *> 256
000332     01 BYT256  EXTERNAL PIC 9(3).
000333 *> 16
000334     01 HXD     EXTERNAL PIC 9(2).
000335 *> 8
000336     01 OCT     EXTERNAL PIC 9(1).
000337 
000338     01 i       PIC 9(2).
000339 
000340     01 j       PIC 9(1).
000341     01 k       PIC 9(2).
000342     01 m       PIC 9(1).
000343 
000344     01 q       PIC 9(10).
000345     01 r       PIC 9(2).
000346 
000347 *> 2進数 対応表 FROM 0 TO 15
000348     01 B_TBL1 EXTERNAL.
000349         03 B_TBL11 OCCURS 16.
000350             05 B_TBL PIC X(4).
000351 
000352 *> 16進数 対応表 FROM 0 TO 15
000353     01 H_TBL1 EXTERNAL.
000354         03 H_TBL11 OCCURS 16.
000355             05 H_TBL PIC X(1).
000356 
000357 LINKAGE SECTION.
000358 *> (IN)  d_num
000359 *> (OUT) b_txt
000360     01 d_num   PIC 9(10).
000361     01 b_txt   PIC X(32).
000362 
000363 PROCEDURE DIVISION USING d_num b_txt.
000364     MOVE ALL ZERO TO b_txt
000365 
000366     MOVE d_num TO q
000367 
000368     PERFORM VARYING i FROM 1 BY 1 UNTIL q <= 0
000369 *> 32 - 4 * i + 1
000370         COMPUTE k = BYT32 - BYT4 * i + 1
000371 
000372 *> 10進数 を 16 で割る
000373         DIVIDE HXD INTO q GIVING q REMAINDER r
000374 
000375 *> 後ろから格納していく
000376 *> [1111]
000377         MOVE B_TBL(r + 1) TO b_txt(k:BIT4)
000378 
000379     END-PERFORM.
000380 END PROGRAM DCM_TO_BNY.
000381 
000382 PROGRAM-ID. BNY_TO_DCM.
000383 *> 2進数 を 10進数 に変換
000384 *> 4 byte (32 bit) 用
000385 *> Convert binary number to decimal number
000386 *> For 4 byte (32 bit)
000387 DATA DIVISION.
000388 WORKING-STORAGE SECTION.
000389 *> 4
000390     01 BIT4    EXTERNAL PIC 9(1).
000391 *> 2
000392     01 BNY     EXTERNAL PIC 9(1).
000393 *> 4
000394     01 BYT4    EXTERNAL PIC 9(1).
000395 *> 32
000396     01 BYT32   EXTERNAL PIC 9(2).
000397 *> 256
000398     01 BYT256  EXTERNAL PIC 9(3).
000399 *> 16
000400     01 HXD     EXTERNAL PIC 9(2).
000401 *> 8
000402     01 OCT     EXTERNAL PIC 9(1).
000403 
000404     01 i       PIC 9(2).
000405     01 j       PIC 9(2).
000406 
000407     01 tmp     PIC 9(1).
000408 
000409 LINKAGE SECTION.
000410 *> (IN)  b_num
000411 *> (OUT) d_num
000412     01 b_txt   PIC X(32).
000413     01 d_num   PIC 9(10).
000414 
000415 PROCEDURE DIVISION USING b_txt d_num.
000416     INITIALIZE d_num
000417 
000418     MOVE ZERO TO i
000419 
000420 *> 32 bit 処理
000421     PERFORM BYT32 TIMES
000422 
000423 *> 32 - i
000424         COMPUTE j = BYT32 - i
000425 
000426         MOVE b_txt(j:1) TO tmp
000427 
000428 *> 2^0 の位 から 2^31 の位 までの 32 bit
000429 *> 10進数 足し込み
000430         COMPUTE d_num = d_num + BNY ** i * tmp
000431 
000432         ADD 1 TO i
000433 
000434     END-PERFORM.
000435 END PROGRAM BNY_TO_DCM.
000436 
000437 PROGRAM-ID. BNY_TO_HEX.
000438 *> 2進数 を 16進数 に変換
000439 *> 4 byte (32 bit) 用
000440 *> Convert binary number to hexadecimal number
000441 *> For 4 byte (32 bit)
000442 DATA DIVISION.
000443 WORKING-STORAGE SECTION.
000444 *> 4
000445     01 BIT4    EXTERNAL PIC 9(1).
000446 *> 2
000447     01 BNY     EXTERNAL PIC 9(1).
000448 *> 4
000449     01 BYT4    EXTERNAL PIC 9(1).
000450 *> 256
000451     01 BYT256  EXTERNAL PIC 9(3).
000452 *> 16
000453     01 HXD     EXTERNAL PIC 9(2).
000454 *> 8
000455     01 OCT     EXTERNAL PIC 9(1).
000456 
000457     01 d       PIC 9(4) BINARY.
000458 
000459     01 filler REDEFINES d.
000460         03 filler PIC X.
000461         03 dbyte  PIC X.
000462 
000463     01 i       PIC 9(2).
000464     01 j       PIC 9(2).
000465     01 k       PIC 9(2).
000466 
000467     01 tmp     PIC 9(1).
000468 
000469 LINKAGE SECTION.
000470 *> (IN)  b_txt
000471 *> (OUT) h_num
000472     01 b_txt   PIC X(32).
000473     01 h_num   PIC X(4).
000474 
000475 PROCEDURE DIVISION USING b_txt h_num.
000476     INITIALIZE h_num
000477 
000478 *> 1 byte ずつ処理
000479     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH OF h_num < i
000480 
000481         MOVE ZERO TO d
000482 
000483 *> 8 * (i - 1) + 1
000484         COMPUTE k = OCT * (i - 1) + 1
000485 
000486 *> 2進数 から 1 byte 取得 10進数 を 代入することで
000487         PERFORM VARYING j FROM 1 BY 1 UNTIL OCT < j
000488             MOVE b_txt(k + j - 1:1) TO tmp
000489             COMPUTE d = d + BNY ** (OCT - j) * tmp
000490         END-PERFORM
000491 
000492 *> 16進数 を得ることができる
000493         MOVE dbyte TO h_num(i:1)
000494     END-PERFORM.
000495 END PROGRAM BNY_TO_HEX.
000496 
000497 PROGRAM-ID. GET_NTH_BIT.
000498 *> Nビット目 を 取り出す
000499 *> 4 byte (32 bit) 用
000500 *> Get N-th bit
000501 *> For 4 byte (32 bit)
000502 DATA DIVISION.
000503 WORKING-STORAGE SECTION.
000504 *> 2
000505     01 BNY     EXTERNAL PIC 9(1).
000506 *> 4
000507     01 BYT4    EXTERNAL PIC 9(1).
000508 *> 32
000509     01 BYT32   EXTERNAL PIC 9(2).
000510 *> 256
000511     01 BYT256  EXTERNAL PIC 9(3).
000512 *> 16
000513     01 HXD     EXTERNAL PIC 9(2).
000514 *> 8
000515     01 OCT     EXTERNAL PIC 9(1).
000516 
000517     01 b_tmp   PIC X(32).
000518 
000519 LINKAGE SECTION.
000520 *> (IN)  x_th
000521 *>       d_num
000522 *> (OUT) n_bit
000523     01 x_th    PIC 9(2) VALUE ZERO.
000524     01 d_num   PIC 9(10).
000525     01 n_bit   PIC 9(1).
000526 
000527 PROCEDURE DIVISION USING x_th d_num n_bit.
000528     INITIALIZE n_bit
000529 
000530     CALL "DCM_TO_BNY" USING BY CONTENT d_num
000531                               BY REFERENCE b_tmp
000532 
000533 *> 右から x_th 番目を取り出す
000534     MOVE b_tmp(BYT32 - x_th + 1:1) TO n_bit.
000535 END PROGRAM GET_NTH_BIT.
000536 
000537 PROGRAM-ID. SET_NTH.
000538 *> Nビット目 操作
000539 *> 4 byte (32 bit) 用
000540 *> Set N-th bit operation
000541 *> For 4 byte (32 bit)
000542 DATA DIVISION.
000543 WORKING-STORAGE SECTION.
000544 *> 2
000545     01 BNY     EXTERNAL PIC 9(1).
000546 *> 4
000547     01 BYT4    EXTERNAL PIC 9(1).
000548 *> 32
000549     01 BYT32   EXTERNAL PIC 9(2).
000550 *> 256
000551     01 BYT256  EXTERNAL PIC 9(3).
000552 *> 16
000553     01 HXD     EXTERNAL PIC 9(2).
000554 *> 0
000555     01 NUM_OFF EXTERNAL PIC 9(1).
000556 *> 1
000557     01 NUM_ON  EXTERNAL PIC 9(1).
000558 *> 9
000559     01 NUM_X   EXTERNAL PIC 9(1).
000560 *> 8
000561     01 OCT     EXTERNAL PIC 9(1).
000562 
000563     01 b_tmp   PIC X(32).
000564     01 h_tmp   PIC X(4).
000565 
000566 LINKAGE SECTION.
000567 *> (IN)  x_th
000568 *>       x_div
000569 *>       d_num
000570 *> (OUT) d_num
000571 *>       h_num
000572     01 x_th    PIC 9(2).
000573     01 x_div   PIC 9(1).
000574     01 d_num   PIC 9(10).
000575     01 h_num   PIC X(4).
000576 
000577 PROCEDURE DIVISION USING x_th x_div d_num h_num.
000578     MOVE ALL ZERO TO b_tmp
000579 
000580     IF x_div = NUM_OFF THEN
000581 *> 1111 1111 1111 1111 1111 1111 1111 1111
000582         MOVE ALL '1' TO b_tmp
000583     END-IF
000584 
000585 *> フラグ設定
000586     MOVE x_div TO b_tmp(BYT32 - x_th + 1:1)
000587 
000588     IF x_div = NUM_X THEN
000589 *> 1
000590         MOVE NUM_ON TO b_tmp(BYT32 - x_th + 1:1)
000591     END-IF
000592 
000593     CALL "BNY_TO_HEX" USING BY CONTENT b_tmp
000594                               BY REFERENCE h_tmp
000595 
000596 *> Nビット目 操作
000597 *> 0 をセットする
000598     IF x_div = NUM_OFF THEN
000599         CALL "CBL_AND" USING h_tmp, h_num, BY VALUE BYT4
000600     ELSE
000601 *> 1 をセットする
000602         IF x_div = NUM_ON THEN
000603             CALL "CBL_OR" USING h_tmp, h_num, BY VALUE BYT4
000604 *> 反転する
000605         ELSE
000606             CALL "CBL_XOR" USING h_tmp, h_num, BY VALUE BYT4
000607         END-IF
000608     END-IF.
000609 END PROGRAM SET_NTH.
