000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_028_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(100).
000007 01 A          PIC 9(10) VALUE ZERO.
000008 01 B          PIC 9(10) VALUE ZERO.
000009 01 C          PIC 9(10) VALUE ZERO.
000010 01 D          PIC 9(10) VALUE ZERO.
000011 01 E          PIC 9(10) VALUE ZERO.
000012 01 F          PIC 9(10) VALUE ZERO.
000013 01 ans        PIC X(100).
000014 01 za         PIC Z(9)9.
000015 01 zb         PIC Z(9)9.
000016 01 zc         PIC Z(9)9.
000017 01 zd         PIC Z(9)9.
000018 01 ze         PIC Z(9)9.
000019 01 zf         PIC Z(9)9.
000020 
000021 PROCEDURE DIVISION.
000022   ACCEPT S.
000023   INSPECT S TALLYING A FOR ALL "A".
000024   INSPECT S TALLYING B FOR ALL "B".
000025   INSPECT S TALLYING C FOR ALL "C".
000026   INSPECT S TALLYING D FOR ALL "D".
000027   INSPECT S TALLYING E FOR ALL "E".
000028   INSPECT S TALLYING F FOR ALL "F".
000029   MOVE A TO za.
000030   MOVE B TO zb.
000031   MOVE C TO zc.
000032   MOVE D TO zd.
000033   MOVE E TO ze.
000034   MOVE F TO zf.
000035   STRING
000036     FUNCTION TRIM(za)
000037     " "
000038     FUNCTION TRIM(zb)
000039     " "
000040     FUNCTION TRIM(zc)
000041     " "
000042     FUNCTION TRIM(zd)
000043     " "
000044     FUNCTION TRIM(ze)
000045     " "
000046     FUNCTION TRIM(zf)
000047     INTO ans
000048   END-STRING.
000049   DISPLAY FUNCTION TRIM(ans).
000050   STOP RUN.

