000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_040_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 df         PIC 9(6).
000007 01 i          PIC 9(6).
000008 01 mn         PIC 9(6).
000009 01 n          PIC 9(6).
000010 01 rm         PIC 9(6).
000011 01 tmp        PIC 9(6).
000012 01 zs         PIC Z(6)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT n.
000016   MOVE 100001 TO mn.
000017   PERFORM VARYING i FROM 1 BY 1 UNTIL n < i * i
000018     *> i - (n / i)
000019     *> n - i * (n / i)
000020     COMPUTE tmp = n / i
000021     COMPUTE df = i - tmp
000022     COMPUTE rm = n - i * tmp
000023     COMPUTE mn = FUNCTION min(mn, df + rm)
000024   END-PERFORM.
000025   MOVE mn TO zs.
000026   DISPLAY FUNCTION TRIM(zs).
000027   STOP RUN.

