000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_245_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(2).
000007 01 B          PIC 9(2).
000008 01 C          PIC 9(2).
000009 01 D          PIC 9(2).
000010 01 ln         PIC X(30).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED SPACE INTO A B C D.
000015   IF A * 100 + B <= C * 100 + D THEN DISPLAY "Takahashi"
000016   ELSE DISPLAY "Aoki".
000017   STOP RUN.

