000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_247_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 i          PIC 9(10) COMP.
000008 01 j          PIC 9(10) COMP.
000009 01 k          PIC 9(10) COMP.
000010 01 ln         PIC X(30).
000011 01 scnt       PIC 9(10) COMP.
000012 01 st1.
000013    03 st      OCCURS 100 DEPENDING N.
000014       05 s    PIC X(10).
000015       05 t    PIC X(10).
000016 01 tcnt       PIC 9(10) COMP.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT N.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000021     ACCEPT ln
000022     UNSTRING ln DELIMITED SPACE INTO s(i) t(i)
000023   END-PERFORM.
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000025     MOVE ZERO TO scnt tcnt
000026     PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000027       IF i NOT = j
000028         IF s(i) = s(j) ADD 1 TO scnt END-IF
000029         IF s(i) = t(j) ADD 1 TO tcnt END-IF
000030       END-IF
000031     END-PERFORM
000032     IF scnt NOT = ZERO OR tcnt NOT = ZERO
000033       MOVE ZERO TO scnt tcnt
000034       PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000035         IF i NOT = j
000036           IF t(i) = s(j) ADD 1 TO scnt END-IF
000037           IF t(i) = t(j) ADD 1 TO tcnt END-IF
000038         END-IF
000039       END-PERFORM
000040       IF scnt NOT = ZERO OR tcnt NOT = ZERO EXIT PERFORM
000041     END-IF
000042   END-PERFORM.
000043   IF N + 1 = i DISPLAY "Yes" ELSE DISPLAY "No"
000044   STOP RUN.

