000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_187_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11    PIC X(3).
000008    03 A111   REDEFINES A11.
000009       05 A   PIC 9(1) OCCURS 3.
000010 01 B1.
000011    03 B11    PIC X(3).
000012    03 B111   REDEFINES B11.
000013       05 B   PIC 9(1) OCCURS 3.
000014 01 ans       PIC Z(9)9.
000015 01 ln        PIC X(30).
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   UNSTRING ln DELIMITED BY SPACE INTO A11 B11.
000020   IF B(1) + B(2) + B(3) < A(1) + A(2) + A(3) THEN
000021     COMPUTE ans = A(1) + A(2) + A(3)
000022   ELSE
000023     COMPUTE ans = B(1) + B(2) + B(3)
000024   END-IF.
000025   DISPLAY FUNCTION TRIM(ans).
000026   STOP RUN.

