000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_212_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X11.
000007    03 X1      PIC 9(4).
000008    03 X REDEFINES X1 PIC 9(1) OCCURS 4.
000009 01 d          PIC 9(10).
000010 01 r1         PIC 9(10).
000011 01 r2         PIC 9(10).
000012 01 r3         PIC 9(10).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT X1.
000016   MOVE X(1) TO d.
000017   ADD 1 TO d.
000018   DIVIDE d BY 10 GIVING d REMAINDER r1.
000019   MOVE X(2) TO d.
000020   ADD 1 TO d.
000021   DIVIDE d BY 10 GIVING d REMAINDER r2.
000022   MOVE X(3) TO d.
000023   ADD 1 TO d.
000024   DIVIDE d BY 10 GIVING d REMAINDER r3.
000025   IF X(1) = X(2) AND X(3) AND X(4) DISPLAY "Weak"
000026   ELSE IF r1 = X(2) AND r2 = X(3) AND r3 = X(4) DISPLAY "Weak"
000027   ELSE DISPLAY "Strong".
000028   STOP RUN.

