000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_108_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 dx         PIC S9(10).
000008 01 dy         PIC S9(10).
000009 01 dz         PIC S9(10).
000010 01 x1         PIC S9(10).
000011 01 y1         PIC S9(10).
000012 01 x2         PIC S9(10).
000013 01 y2         PIC S9(10).
000014 01 x3         PIC S9(10).
000015 01 y3         PIC S9(10).
000016 01 x4         PIC S9(10).
000017 01 y4         PIC S9(10).
000018 01 zx3        PIC -(9)9.
000019 01 zy3        PIC -(9)9.
000020 01 zx4        PIC -(9)9.
000021 01 zy4        PIC -(9)9.
000022 
000023 PROCEDURE DIVISION.
000024   ACCEPT ln.
000025   UNSTRING ln DELIMITED BY SPACE INTO x1 y1 x2 y2.
000026   COMPUTE dx = x2 - x1.
000027   COMPUTE dy = y2 - y1.
000028   COMPUTE dz = -dy.
000029   MOVE dx TO dy.
000030   MOVE dz TO dx.
000031   COMPUTE x3 = x2 + dx.
000032   COMPUTE y3 = y2 + dy.
000033   COMPUTE dz = -dy.
000034   MOVE dx TO dy.
000035   MOVE dz TO dx.
000036   COMPUTE x4 = x3 + dx.
000037   COMPUTE y4 = y3 + dy.
000038   MOVE x3 TO zx3.
000039   MOVE y3 TO zy3.
000040   MOVE x4 TO zx4.
000041   MOVE y4 TO zy4.
000042 
000043   INITIALIZE ln.
000044 
000045   STRING
000046   FUNCTION TRIM(zx3)
000047   SPACE
000048   FUNCTION TRIM(zy3)
000049   SPACE
000050   FUNCTION TRIM(zx4)
000051   SPACE
000052   FUNCTION TRIM(zy4)
000053   INTO ln.
000054 
000055   DISPLAY FUNCTION TRIM(ln).
000056   STOP RUN.
