000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_231_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC 9(10).
000007 01 S1.
000008    03 S      PIC X(10) OCCURS 100 DEPENDING N.
000009 01 ans       PIC X(10).
000010 01 i         PIC 9(10) COMP.
000011 01 idx       PIC 9(10).
000012 01 j         PIC 9(10) VALUE 1 COMP.
000013 01 maxvotes  PIC 9(10) VALUE ZERO.
000014 01 votes1.
000015    03 votes OCCURS 100 INDEXED IXvotes.
000016      05 name   PIC X(10).
000017      05 num    PIC 9(10) VALUE ZERO.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT N.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000022     ACCEPT S(i)
000023   END-PERFORM.
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000025     SET IXvotes TO 1
000026     SEARCH votes
000027       WHEN S(i) = name(IXvotes)
000028         MOVE IXvotes TO idx
000029         ADD 1 TO num(idx)
000030       WHEN space = name(IXvotes)
000031         MOVE j TO idx
000032         MOVE S(i) TO name(idx)
000033         MOVE 1 TO num(idx)
000034         ADD 1 TO j
000035     END-SEARCH
000036     IF maxvotes < num(idx)
000037       MOVE num(idx) TO maxvotes
000038       MOVE name(idx) TO ans
000039   END-PERFORM.
000040   DISPLAY FUNCTION TRIM(ans).
000041   STOP RUN.

