000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_135_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 cnt        PIC 9(10) VALUE ZERO.
000008 01 cur        PIC 9(10) VALUE 1 COMP.
000009 01 i          PIC 9(10) VALUE 1 COMP.
000010 01 j          PIC 9(10) COMP.
000011 01 len        PIC 9(10) COMP.
000012 01 ln         PIC X(400).
000013 01 maxlen     PIC 9(10) VALUE 100 COMP.
000014 01 p          PIC 9(10).
000015 01 zs         PIC Z(9)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT N.
000019   ACCEPT ln.
000020   MOVE N TO maxlen.
000021   PERFORM maxlen TIMES
000022     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000023     END-PERFORM
000024     COMPUTE len = j - cur
000025     MOVE ln(cur:len) TO p
000026     IF p <> i
000027       ADD 1 TO cnt
000028     END-IF
000029     COMPUTE cur = j + 1
000030     ADD 1 TO i
000031   END-PERFORM.
000032   IF cnt <= 2
000033     DISPLAY "YES"
000034   ELSE
000035     DISPLAY "NO"
000036   END-IF.
000037   STOP RUN.

