000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_060_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(3).
000007 01 B          PIC 9(3).
000008 01 C          PIC 9(2).
000009 01 flg        PIC 9(1) VALUE 0.
000010 01 i          PIC 9(5).
000011 01 ln         PIC X(10).
000012 01 num        PIC 9(5).
000013 01 pi         PIC 9(5).
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED BY SPACE INTO A B C.
000018   MOVE A TO num.
000019   PERFORM VARYING i FROM 1 BY 1 UNTIL A * B < num
000020     IF FUNCTION MOD(num, B) = C THEN
000021       MOVE 1 TO flg
000022       EXIT PERFORM
000023     ELSE
000024       ADD 1 TO i GIVING pi
000025       MULTIPLY pi BY A GIVING num
000026     END-IF
000027   END-PERFORM.
000028   IF flg = 1 THEN
000029     DISPLAY "YES"
000030   ELSE
000031     DISPLAY "NO"
000032   END-IF.
000033   STOP RUN.

