000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_086_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ab1.
000007    03 ab11 OCCURS 2.
000008       05 ab   PIC 9(5).
000009 01 cur        PIC 9(12) VALUE 1.
000010 01 d          PIC 9(9).
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(12).
000014 01 ln         PIC X(12).
000015 01 maxlen     PIC 9(1) VALUE 2.
000016 01 x          PIC 9(9).
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   PERFORM maxlen TIMES
000021     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000022     END-PERFORM
000023     COMPUTE len = j - cur
000024     MOVE ln(cur:len) TO AB(i)
000025     COMPUTE cur = j + 1
000026     ADD 1 TO i
000027   END-PERFORM.
000028   MULTIPLY AB(1) BY AB(2) GIVING x.
000029   DIVIDE 2 INTO x GIVING x REMAINDER d.
000030   IF d = 0 THEN
000031     DISPLAY "Even"
000032   ELSE
000033     DISPLAY "Odd"
000034   END-IF.
000035   STOP RUN.

