000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_240_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 a          PIC 9(10).
000008 01 ap         PIC 9(10).
000009 01 b          PIC 9(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO a b.
000014   COMPUTE ap = a + 1.
000015   IF ap = b
000016     DISPLAY "Yes"
000017   ELSE
000018     IF a = 1 AND b = 10
000019       DISPLAY "Yes"
000020     ELSE
000021       DISPLAY "No"
000022     END-IF
000023   END-IF.
000024   STOP RUN.
