000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_062_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 H          PIC 9(3).
000007 01 SHP        PIC X(1) VALUE '#'.
000008 01 W          PIC 9(3).
000009 01 a          PIC X(100).
000010 01 i          PIC 9(3).
000011 01 ln         PIC X(7).
000012 01 ln2        PIC X(102).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO H W.
000017   *> 初期化不要
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL W + 2 < i
000019     STRING
000020       ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
000021       SHP
000022       INTO ln2
000023     END-STRING
000024   END-PERFORM.
000025   DISPLAY ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2)).
000026   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000027     ACCEPT a
000028     *> 初期化
000029     MOVE SHP TO ln2
000030     STRING
000031       ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
000032       a
000033       INTO ln2
000034     END-STRING
000035     STRING
000036       ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
000037       SHP
000038       INTO ln2
000039     END-STRING
000040     DISPLAY ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
000041   END-PERFORM.
000042   *> 初期化
000043   MOVE SPACE TO ln2.
000044   PERFORM VARYING i FROM 1 BY 1 UNTIL W + 2 < i
000045     STRING
000046       ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2))
000047       SHP
000048       INTO ln2
000049     END-STRING
000050   END-PERFORM.
000051   DISPLAY ln2(1:FUNCTION STORED-CHAR-LENGTH(ln2)).
000052   STOP RUN.

