000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_102_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 X          PIC 9(10).
000009 01 ans        PIC X(10).
000010 01 zs         PIC Z(11).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   DIVIDE 2 INTO N GIVING X REMAINDER D.
000015   IF D NOT = 0 THEN
000016     MULTIPLY 2 BY N
000017   END-IF
000018   MOVE N TO zs.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

