000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_159_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(100).
000007 01 X          PIC X(100).
000008 01 cur        PIC X(100).
000009 01 i          PIC 9(10).
000010 01 m          PIC 9(10).
000011 01 n          PIC 9(10).
000012 01 pre        PIC X(100).
000013 
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT S.
000017   COMPUTE n = FUNCTION STORED-CHAR-LENGTH(S).
000018   MOVE n TO m.
000019   PERFORM REVERSESTR.
000020   IF S = cur
000021     MOVE ALL SPACE TO cur
000022     DIVIDE n BY 2 GIVING m
000023     MOVE S(1 : m) TO X
000024     PERFORM REVERSESTR
000025     IF X = cur
000026       DISPLAY "Yes"
000027     ELSE
000028       DISPLAY "No"
000029     END-IF
000030   ELSE
000031     DISPLAY "No"
000032   END-IF.
000033   STOP RUN.
000034 
000035 REVERSESTR SECTION.
000036   PERFORM VARYING i FROM 1 BY 1 UNTIL m < i
000037     MOVE S(m - i + 1 : 1) TO cur(i : 1)
000038   END-PERFORM.

