000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_112_A.
000030
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ans        PIC 9(9).
000070 01 zs         PIC Z(9)9.
000080 01 N          PIC 9(9).
000090 01 A          PIC 9(9).
000100 01 B          PIC 9(9).
000110
000120 PROCEDURE DIVISION.
000130   ACCEPT N.
000140   IF 1 = N
000150     DISPLAY "Hello World"
000160   ELSE
000170     ACCEPT A
000180     ACCEPT B
000190     COMPUTE ans = A + B
000200     MOVE ans TO zs
000210     DISPLAY FUNCTION TRIM(zs)
000220   END-IF.
000230   STOP RUN.
