000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_104_D.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 ABC        PIC X(3) VALUE "ABC".
000016 01 INF        PIC 9(10) VALUE 1000000007.
000017 01 S          PIC X(100000).
000018 01 ans        PIC X(10).
000019 01 dp1.
000020    03 dp11 OCCURS 100001.
000021       05 dp PIC 9(20) OCCURS 4.
000022 01 i          PIC 9(6) BINARY.
000023 01 j          PIC 9(1) BINARY.
000024 01 len        PIC 9(6).
000025 01 m1         PIC 9(1).
000026 01 m2         PIC 9(1).
000027 01 zs         PIC Z(10)9.
000028 
000029 PROCEDURE DIVISION.
000030   OPEN INPUT SYSIN.
000031   READ SYSIN INTO S.
000032   CLOSE SYSIN.
000033   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
000034 *> ○ 0
000035   MOVE ZERO TO dp(len + 1 1).
000036 *> ○ 1
000037   MOVE ZERO TO dp(len + 1 2).
000038 *> ○ 2
000039   MOVE ZERO TO dp(len + 1 3).
000040 *> ○ 3
000041   MOVE 1 TO dp(len + 1 4).
000042 
000043   PERFORM VARYING i FROM len BY -1 UNTIL i <= ZERO
000044     PERFORM VARYING j FROM 4 BY -1 UNTIL j <= ZERO
000045 *> ○ 3
000046       IF j = 4
000047         MOVE 1 TO m1
000048         IF '?' = S(i:1)
000049           MOVE 3 TO m1
000050         END-IF
000051           COMPUTE dp(i j) = m1 * dp(i + 1 j)
000052 *> ○ 3 以外
000053       ELSE
000054         MOVE 1 TO m2
000055 *> ?
000056         IF S(i:1) = '?'
000057           MOVE 3 TO m1
000058 *> ? 以外
000059         ELSE
000060           MOVE 1 TO m1
000061           IF ABC(j:1) NOT = S(i:1)
000062             MOVE ZERO TO m2
000063           END-IF
000064         END-IF
000065         COMPUTE dp(i j) = m1 * dp(i + 1 j) + m2 * dp(i + 1 j + 1)
000066       END-IF
000067       COMPUTE dp(i j) = FUNCTION MOD(dp(i j), INF)
000068     END-PERFORM
000069   END-PERFORM.
000070 
000071   MOVE dp(1 1) TO zs.
000072   DISPLAY FUNCTION TRIM(zs).
000073   STOP RUN.

