000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_103_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11 OCCURS 3.
000008       05 A    PIC 9(3).
000009 01 ans        PIC X(3).
000010 01 cur        PIC 9(12) VALUE 1.
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(12).
000014 01 ln         PIC X(30).
000015 01 maxlen     PIC 9(1) VALUE 3.
000016 01 sm         PIC 9(4).
000017 01 tmp        PIC 9(3).
000018 01 zs         PIC Z(4)9.
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT ln.
000022   PERFORM maxlen TIMES
000023     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000024     END-PERFORM
000025     COMPUTE len = j - cur
000026     MOVE ln(cur:len) TO A(i)
000027     COMPUTE cur = j + 1
000028     ADD 1 TO i
000029   END-PERFORM.
000030   PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
000031     ADD 1 TO i GIVING j
000032     PERFORM UNTIL 3 < j
000033       IF A(j) < A(i) THEN
000034         MOVE A(i) TO tmp
000035         MOVE A(j) TO A(i)
000036         MOVE tmp TO A(j)
000037       END-IF
000038       ADD 1 TO j
000039     END-PERFORM
000040   END-PERFORM.
000041   MOVE ZERO TO sm.
000042   SUBTRACT A(1) FROM A(2) GIVING tmp.
000043   ADD tmp TO sm.
000044   SUBTRACT A(3) FROM A(2) GIVING tmp.
000045   ADD tmp TO sm.
000046   MOVE sm TO zs.
000047   DISPLAY FUNCTION TRIM(zs).
000048   STOP RUN.

