000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_115_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 maxlen     PIC 9(10) VALUE 100 COMP.
000007 01 ans        PIC 9(10).
000008 01 zs         PIC Z(9)9.
000009 01 N          PIC 9(10).
000010 01 p          PIC 9(10).
000011 01 pmax       PIC 9(10) VALUE ZERO.
000012 01 psum       PIC 9(10) VALUE ZERO.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   MOVE N TO maxlen.
000017   PERFORM maxlen TIMES
000018     ACCEPT p
000019     ADD p TO psum
000020     IF pmax < p
000021       MOVE p TO pmax
000022     END-IF
000023   END-PERFORM.
000024   COMPUTE ans = psum - pmax / 2.
000025   MOVE ans TO zs.
000026   DISPLAY FUNCTION TRIM(zs).
000027   STOP RUN.
