000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_046_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(4).
000007 01 K          PIC 9(4).
000008 01 ln         PIC X(9).
000009 01 total      PIC 9(10).
000010 01 zs         PIC Z(11).
000011 
000012 PROCEDURE DIVISION.
000013     ACCEPT ln.
000014     UNSTRING ln DELIMITED BY SPACE INTO N K.
000015     MOVE 1 TO total.
000016     COMPUTE total = K * (K - 1) ** (N - 1).
000017     MOVE total TO zs.
000018     DISPLAY FUNCTION TRIM(zs).
000019     STOP RUN.

