000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_155_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A            PIC 9(1).
000007 01 B            PIC 9(1).
000008 01 C            PIC 9(1).
000009 01 flg          PIC 9(1) VALUE ZERO.
000010 01 ln           PIC X(5).
000011 
000012 PROCEDURE DIVISION.
000013     ACCEPT ln.
000014     UNSTRING ln DELIMITED SPACE INTO A B C.
000015     IF A = B AND B NOT = C
000016         MOVE 1 TO flg
000017     END-IF.
000018     IF B = C AND C NOT = A
000019         MOVE 1 TO flg
000020     END-IF.
000021     IF C = A AND A NOT = B
000022         MOVE 1 TO flg
000023     END-IF.
000024     IF flg = 1
000025         DISPLAY "Yes"
000026     ELSE
000027         DISPLAY "No"
000028     END-IF.
000029   STOP RUN.

