000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_227_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 S1.
000008    03 S       PIC 9(10) OCCURS 20 DEPENDING N.
000009 01 a          PIC 9(10) COMP.
000010 01 ans        PIC 9(10) VALUE ZERO.
000011 01 ar         PIC 9(10).
000012 01 b          PIC 9(10) COMP.
000013 01 flg        PIC 9(1).
000014 01 i          PIC 9(10) COMP.
000015 01 ln         PIC X(100).
000016 01 pt         PIC S9(10) VALUE 1.
000017 01 zs         PIC Z(9)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT N.
000021   ACCEPT ln.
000022   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000023     UNSTRING ln DELIMITED SPACE INTO S(i) POINTER pt
000024   END-PERFORM.
000025   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000026     MOVE ZERO TO flg
000027     PERFORM VARYING a FROM 1 BY 1 UNTIL 1000 < a
000028       PERFORM VARYING b FROM 1 BY 1 UNTIL 1000 < b
000029         COMPUTE ar = 4 * a * b + 3 * a + 3 * b
000030         IF ar = S(i) MOVE 1 TO flg EXIT PERFORM
000031         ELSE IF 1000 < ar EXIT PERFORM
000032       END-PERFORM
000033       IF 1 = flg EXIT PERFORM
000034     END-PERFORM
000035     IF ZERO = flg ADD 1 TO ans
000036   END-PERFORM.
000037   MOVE ans TO zs.
000038   DISPLAY FUNCTION TRIM(zs).
000039   STOP RUN.

