000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_101_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC X(11).
000007 01 NUM        PIC 9(10).
000008 01 R          PIC 9(10).
000009 01 SN         PIC 9(3).
000010 01 X          PIC 9(10).
000011 01 i          PIC 9(2).
000012 01 now        PIC 9(1).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   MOVE N TO NUM.
000017   MOVE ZERO TO SN.
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL N(i:1) = SPACE
000019     MOVE N(i:1) TO now
000020     COMPUTE SN = SN + now
000021   END-PERFORM.
000022   DIVIDE SN INTO NUM GIVING X REMAINDER R.
000023   IF ZERO = R THEN
000024     DISPLAY "Yes"
000025   ELSE
000026     DISPLAY "No"
000027   END-IF.
000028   STOP RUN.

