000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_124_B.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 maxlen     PIC 9(10) VALUE 100 COMP.
000080 01 cur        PIC 9(10) VALUE 1 COMP.
000090 01 len        PIC 9(10) COMP.
000100 01 ans        PIC 9(10) VALUE ZERO.
000110 01 height     PIC 9(10) VALUE ZERO.
000120 01 i          PIC 9(10) VALUE 1 COMP.
000130 01 j          PIC 9(10) COMP.
000140 01 zs         PIC Z(9)9.
000150 01 N          PIC 9(10).
000160 01 H1.
000170    03 H11 OCCURS 20 DEPENDING ON N.
000180       05 H    PIC 9(10).
000190 
000200 PROCEDURE DIVISION.
000210   ACCEPT N.
000220   MOVE N TO maxlen.
000230   ACCEPT ln.
000240   PERFORM maxlen TIMES
000250     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000260     END-PERFORM
000270     COMPUTE len = j - cur
000280     MOVE ln(cur:len) TO H(i)
000290     IF height <= H(i)
000300       MOVE H(i) TO height
000310       ADD 1 TO ans
000320     END-IF
000330     COMPUTE cur = j + 1
000340     ADD 1 TO i
000350   END-PERFORM.
000360   MOVE ans TO zs.
000370   DISPLAY FUNCTION TRIM(zs)
000380   STOP RUN.
