000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_073_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(2).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT ln.
000010   IF ln(1:1) = 9 OR ln(2:1) = 9 THEN
000011     DISPLAY "Yes"
000012   ELSE
000013     DISPLAY "No"
000014   END-IF
000015   STOP RUN.

