000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_067_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(3).
000007 01 B          PIC 9(3).
000008 01 MODA       PIC 9(1).
000009 01 MODAB      PIC 9(1).
000010 01 MODB       PIC 9(1).
000011 01 ln         PIC X(7).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO A B.
000016   COMPUTE MODA = FUNCTION MOD(A, 3).
000017   COMPUTE MODB = FUNCTION MOD(B, 3).
000018   ADD A TO B.
000019   COMPUTE MODAB = FUNCTION MOD(B, 3).
000020   IF MODA = 0 OR MODB = 0 OR MODAB = 0 THEN
000021     DISPLAY "Possible"
000022   ELSE
000023     DISPLAY "Impossible"
000024   END-IF.
000025   STOP RUN.

