000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_246_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 i          PIC 9(10) COMP.
000007 01 ln         PIC X(30).
000008 01 point1.
000009    03 point   OCCURS 3.
000010       05 x    PIC S9(10).
000011       05 y    PIC S9(10).
000012 01 zsx        PIC -(9)9.
000013 01 zsy        PIC -(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
000017     ACCEPT ln
000018     UNSTRING ln DELIMITED SPACE INTO x(i) y(i)
000019   END-PERFORM.
000020   MOVE x(1) TO zsx.
000021   MOVE y(1) TO zsy.
000022   IF x(1) = x(3) MOVE x(2) TO zsx
000023   ELSE IF x(1) = x(2) MOVE x(3) TO zsx.
000024   IF y(1) = y(3) MOVE y(2) TO zsy
000025   ELSE IF y(1) = y(2) MOVE y(3) TO zsy.
000026   DISPLAY FUNCTION TRIM(zsx) SPACE FUNCTION TRIM(zsy).
000027   STOP RUN.

