000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_123_B.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ans        PIC 9(10) VALUE ZERO.
000070 01 zs         PIC Z(9)9.
000080 01 i          PIC 9(10) VALUE 1 COMP.
000090 01 D          PIC 9(10).
000100 01 R          PIC 9(10).
000110 01 AE1.
000120    03 AE11 OCCURS 5.
000130       05 AE   PIC 9(10).
000140 01 L1.
000150    03 L11 OCCURS 5.
000160       05 L    PIC 9(10).
000170 
000180 PROCEDURE DIVISION.
000190   ACCEPT AE(1).
000200   ACCEPT AE(2).
000210   ACCEPT AE(3).
000220   ACCEPT AE(4).
000230   ACCEPT AE(5).
000240   PERFORM VARYING i FROM 1 BY 1 UNTIL 5 < i
000250     DIVIDE AE(i) BY 10 GIVING D REMAINDER R
000260     IF ZERO < R
000270       COMPUTE L(i) = 10 - R
000280     END-IF
000290     ADD AE(i) TO ans
000300   END-PERFORM.
000310   SORT L11 DESCENDING L.
000320   PERFORM VARYING i FROM 2 BY 1 UNTIL 5 < i
000330     ADD L(i) TO ans
000340   END-PERFORM.
000350   MOVE ans TO zs.
000360   DISPLAY FUNCTION TRIM(zs)
000370   STOP RUN.
