000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_154_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(2).
000007 01 B          PIC 9(2).
000008 01 LN         PIC X(21).
000009 01 S          PIC X(10).
000010 01 T          PIC X(10).
000011 01 U          PIC X(10).
000012 01 ZA         PIC Z9.
000013 01 ZB         PIC Z9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT LN.
000017   UNSTRING LN DELIMITED BY SPACE INTO S T.
000018   ACCEPT LN.
000019   UNSTRING LN DELIMITED BY SPACE INTO A B.
000020   ACCEPT U.
000021   IF S = U
000022       ADD -1 TO A
000023   ELSE
000024       ADD -1 TO B
000025   END-IF.
000026   MOVE A TO ZA.
000027   MOVE B TO ZB.
000028   DISPLAY FUNCTION TRIM(ZA) SPACE FUNCTION TRIM(ZB).

