000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_118_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 maxlen     PIC 9(10) VALUE 100 COMP.
000008 01 cur        PIC 9(10).
000009 01 i          PIC 9(10) VALUE 1 COMP.
000010 01 j          PIC 9(10) COMP.
000011 01 p          PIC 9(10) COMP.
000012 01 q          PIC 9(10) COMP.
000013 01 y          PIC 9(10) COMP.
000014 01 len        PIC 9(10) COMP.
000015 01 num        PIC 9(10).
000016 01 numa       PIC 9(10) VALUE ZERO.
000017 01 ans        PIC 9(10).
000018 01 zs         PIC Z(9)9.
000019 01 N          PIC 9(10).
000020 01 M          PIC 9(10).
000021 01 K1.
000022    03 K11 OCCURS 100 DEPENDING ON N INDEXED BY XK.
000023       05 K    PIC 9(10).
000024 01 A1.
000025    03 A11 OCCURS 900 INDEXED BY XA.
000026       05 A    PIC 9(10) VALUE ZERO.
000027 
000028 PROCEDURE DIVISION.
000029   ACCEPT ln.
000030   UNSTRING ln DELIMITED BY SPACE INTO N M.
000031   SET XA TO 1.
000032   SET XK TO 1.
000033   PERFORM VARYING y from 1 BY 1 UNTIL N < y
000034     ACCEPT ln
000035     MOVE 1 TO cur
000036     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000037     END-PERFORM
000038     COMPUTE len = j - cur
000039     MOVE ln(cur:len) TO K(XK)
000040     COMPUTE cur = j + 1
000041     MOVE K(XK) TO maxlen
000042     ADD 1 TO XK
000043     PERFORM maxlen TIMES
000044       PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000045       END-PERFORM
000046       COMPUTE len = j - cur
000047       MOVE ln(cur:len) TO A(XA)
000048       COMPUTE cur = j + 1
000049       ADD 1 TO XA
000050       ADD 1 TO i
000051       ADD 1 TO numa
000052     END-PERFORM
000053   END-PERFORM.
000054   MOVE ZERO TO ans.
000055   PERFORM VARYING p from 1 BY 1 UNTIL M < p
000056     MOVE ZERO TO num
000057     PERFORM VARYING q from 1 BY 1 UNTIL numa < q
000058         IF p = A(q)
000059           ADD 1 TO num
000060         END-IF
000061     END-PERFORM
000062     IF N = num
000063       ADD 1 TO ans
000064     END-IF
000065   END-PERFORM.
000066   MOVE ans TO zs.
000067   DISPLAY FUNCTION TRIM(zs).
000068   STOP RUN.
