000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_009_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 d          PIC 9(10).
000008 01 r          PIC 9(10).
000009 01 zs         PIC Z(9)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT N.
000013   DIVIDE N BY 2 GIVING d REMAINDER r.
000014   IF ZERO < r THEN
000015     ADD 1 TO d
000016   END-IF.
000017   MOVE d TO zs.
000018   DISPLAY FUNCTION TRIM(zs).
000019   STOP RUN.

