000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_118_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 A          PIC 9(10).
000008 01 B          PIC 9(10).
000009 01 D          PIC 9(10).
000010 01 R          PIC 9(10).
000011 01 ans        PIC 9(10).
000012 01 zs         PIC Z(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO A B.
000017   DIVIDE B BY A GIVING D REMAINDER R.
000018   IF ZERO = R
000019     COMPUTE ans = A + B
000020   ELSE
000021     COMPUTE ans = B - A
000022   END-IF.
000023   MOVE ans TO zs.
000024   DISPLAY FUNCTION TRIM(zs).
000025   STOP RUN.
