000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_269_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 Takahashi  PIC X(9) VALUE "Takahashi".
000007 01 a          PIC S9(10).
000008 01 b          PIC S9(10).
000009 01 c          PIC S9(10).
000010 01 d          PIC S9(10).
000011 01 ln         PIC X(30).
000012 01 zs         PIC -(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO a b c d.
000017   COMPUTE zs = (a + b) * (c - d).
000018   DISPLAY FUNCTION TRIM(zs).
000019   DISPLAY Takahashi.
000020   STOP RUN.

