000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_081_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 cnt        PIC 9(1).
000007 01 i          PIC 9(1).
000008 01 ln         PIC X(3).
000009 01 zs         PIC Z(1)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   MOVE 0 TO cnt.
000014   PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
000015     IF ln(i:1) = '1' THEN
000016       ADD 1 TO cnt
000017     END-IF
000018   END-PERFORM.
000019   MOVE cnt TO zs.
000020   DISPLAY FUNCTION TRIM(zs).
000021   STOP RUN.

