000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_093_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ABC1.
000007    03 ABC11 OCCURS 3.
000008       05 ABC  PIC 9(1) VALUE 0.
000009 01 cur        PIC 9(1) VALUE 1.
000010 01 len        PIC 9(1) VALUE 1.
000011 01 ln         PIC X(4).
000012 01 maxlen     PIC 9(1) VALUE 3.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   PERFORM maxlen TIMES
000017     IF ln(cur:len) = 'a' THEN
000018       MOVE 1 TO ABC(1)
000019     ELSE
000020       IF ln(cur:len) = 'b' THEN
000021         MOVE 1 TO ABC(2)
000022       ELSE
000023         MOVE 1 TO ABC(3)
000024       END-IF
000025     END-IF
000026     COMPUTE cur = cur + 1
000027   END-PERFORM.
000028   IF ABC(1) = 1 AND ABC(2) = 1 AND ABC(3) = 1 THEN
000029     DISPLAY "Yes"
000030   ELSE
000031     DISPLAY "No"
000032   END-IF.
000033   STOP RUN.

