000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_078_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X          PIC X(1).
000007 01 Y          PIC X(1).
000008 01 ln         PIC X(3).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT ln.
000012   UNSTRING ln DELIMITED BY SPACE INTO X Y.
000013   IF X < Y THEN
000014     DISPLAY '<'
000015   ELSE
000016     IF X = Y THEN
000017       DISPLAY '='
000018     ELSE
000019       DISPLAY '>'
000020     END-IF
000021   END-IF.
000022   STOP RUN.

