000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_080_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(2).
000007 01 T          PIC 9(4).
000008 01 a          PIC 9(3).
000009 01 b          PIC 9(4).
000010 01 ln         PIC X(12).
000011 01 zs         PIC Z(4)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE
000016   INTO N A B.
000017   IF A * N <= B THEN
000018     MULTIPLY A BY N GIVING T
000019   ELSE
000020     MOVE B TO T
000021   END-IF
000022   MOVE T TO zs.
000023   DISPLAY FUNCTION TRIM(zs).
000024   STOP RUN.

