000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_206_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 d          PIC 9(10).
000008 01 r          FLOAT-LONG.
000009 01 saving     FLOAT-LONG.
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   COMPUTE saving = FUNCTION SQRT(1 + 8 * N) - 1.
000015   DIVIDE saving BY 2 GIVING d REMAINDER r.
000016   IF 0 < r ADD 1 TO d.
000017   MOVE d TO zs.
000018   DISPLAY FUNCTION TRIM(zs).
000019   STOP RUN.

