000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_175_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(3).
000007 01 i          PIC 9(10).
000008 01 ans        PIC 9(10) VALUE ZERO.
000009 01 num        PIC 9(10) VALUE ZERO.
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT S.
000014   PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
000015     IF "R" = S(i:1) THEN
000016       ADD 1 TO num
000017     ELSE
000018       MOVE ZERO TO num
000019     END-IF
000020     COMPUTE ans = FUNCTION MAX(ans, num)
000021   END-PERFORM.
000022   MOVE ans TO zs.
000023   DISPLAY FUNCTION TRIM(zs).
000024   STOP RUN.

