000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_149_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(19).
000007 01 B          PIC 9(19).
000008 01 K          PIC 9(19).
000009 01 ans        PIC X(40).
000010 01 ln         PIC X(42).
000011 01 mna        PIC 9(19).
000012 01 mnb        PIC 9(19).
000013 01 zsa        PIC Z(18)9.
000014 01 zsb        PIC Z(18)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT ln.
000018   UNSTRING ln DELIMITED BY SPACE INTO A B K.
000019   COMPUTE mna = FUNCTION MIN(A, K).
000020   COMPUTE A = A - mna.
000021   COMPUTE mna = K - mna.
000022   COMPUTE mnb = FUNCTION MIN(B, mna).
000023   COMPUTE B = B - mnb.
000024   MOVE A TO zsa.
000025   MOVE B TO zsb.
000026   STRING FUNCTION TRIM(zsa) SPACE FUNCTION TRIM(zsb) INTO ans.
000027   DISPLAY FUNCTION TRIM(ans).
000028   STOP RUN.

