000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_145_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 S          PIC X(100).
000008 01 qt         PIC 9(10).
000009 01 rm         PIC 9(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT N.
000013   ACCEPT S.
000014   DIVIDE N BY 2 GIVING qt REMAINDER rm.
000015   IF ZERO = rm
000016     IF S(1 : N / 2) = S(N / 2 + 1 : N / 2)
000017       DISPLAY "Yes"
000018     ELSE
000019       DISPLAY "No"
000020     END-IF
000021   ELSE
000022     DISPLAY "No"
000023   END-IF.
000024   STOP RUN.

