000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_202_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA PIC X(100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 S         PIC X(100000).
000016 01 ans       PIC X(100000) VALUE SPACE.
000017 01 i         PIC 9(10) COMP.
000018 01 len       PIC 9(10).
000019 
000020 PROCEDURE DIVISION.
000021   OPEN INPUT SYSIN.
000022   READ SYSIN INTO S.
000023   CLOSE SYSIN.
000024   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
000025   INSPECT S REPLACING ALL "6" BY "_".
000026   INSPECT S REPLACING ALL "9" BY "6".
000027   INSPECT S REPLACING ALL "_" BY "9".
000028   PERFORM VARYING i FROM len BY -1 UNTIL i <= ZERO
000029     MOVE S(i:1) TO ans(len - i + 1:1)
000030   END-PERFORM.
000031   DISPLAY FUNCTION TRIM(ans).
000032   STOP RUN.

