000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_252_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A11.
000007    03 A1      OCCURS 100 DEPENDING N.
000008       05 idx  PIC 9(10).
000009       05 A    PIC 9(10).
000010 01 B1.
000011    03 B       PIC 9(10) OCCURS 100 DEPENDING K INDEXED IXB.
000012 01 K          PIC 9(10).
000013 01 N          PIC 9(10).
000014 01 flg        PIC 9(1) VALUE 1.
000015 01 i          PIC 9(10) COMP.
000016 01 ln         PIC X(400).
000017 01 pt         PIC S9(10) VALUE 1.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT ln.
000021   UNSTRING ln DELIMITED SPACE INTO N K.
000022   ACCEPT ln.
000023   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000024     MOVE i TO idx(i)
000025     UNSTRING ln DELIMITED SPACE INTO A(i) POINTER pt
000026   END-PERFORM.
000027   ACCEPT ln.
000028   MOVE 1 TO pt.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL K < i
000030     UNSTRING ln DELIMITED SPACE INTO B(i) POINTER pt
000031   END-PERFORM.
000032   SORT A1 DESCENDING A.
000033   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000034     IF A(1) = A(i)
000035       SET IXB TO 1
000036       SEARCH B
000037         WHEN B(IXB) = idx(i)
000038           MOVE ZERO TO flg
000039       END-SEARCH
000040     ELSE EXIT PERFORM END-IF
000041     IF ZERO = flg EXIT PERFORM
000042   END-PERFORM.
000043   IF ZERO = flg DISPLAY "Yes" ELSE DISPLAY "No".
000044   STOP RUN.

