000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_232_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S         PIC X(3).
000007 01 a         PIC 9(10).
000008 01 b         PIC 9(10).
000009 01 zs        PIC Z(9)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT S.
000013   MOVE S(1:1) TO a.
000014   MOVE S(3:1) TO b.
000015   COMPUTE zs = a * b.
000016   DISPLAY FUNCTION TRIM(zs).
000017   STOP RUN.

