000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_026_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 R1.
000008    03 R       PIC 9(10) OCCURS 1000 DEPENDING ON N.
000009 01 a          PIC S9(10)V9(10).
000010 01 cur        PIC 9(10) VALUE 1 COMP.
000011 01 d          PIC 9(10).
000012 01 i          PIC 9(10) VALUE 1 COMP.
000013 01 num        PIC S9(10)V9(10).
000014 01 rm         PIC 9(10).
000015 01 zs         PIC Z(9)9.9(10).
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT N.
000019   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000020     ACCEPT R(i)
000021   END-PERFORM.
000022   SORT R DESCENDING R.
000023   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000024     COMPUTE num = R(i) * R(i) * FUNCTION PI
000025     DIVIDE i BY 2 GIVING d REMAINDER rm
000026     IF ZERO = rm THEN
000027       ADD num TO a
000028     ELSE
000029       SUBTRACT num FROM a
000030     END-IF
000031   END-PERFORM.
000032   MOVE a TO zs.
000033   DISPLAY FUNCTION TRIM(zs).
000034   STOP RUN.

