000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_250_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 N          PIC 9(10).
000009 01 cur        PIC X(1) VALUE "#".
000010 01 i          PIC 9(10) COMP.
000011 01 j          PIC 9(10) COMP.
000012 01 k          PIC 9(10) COMP.
000013 01 ln         PIC X(100).
000014 01 q          PIC 9(10).
000015 01 r          PIC 9(10).
000016 01 str        PIC X(100).
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   UNSTRING ln DELIMITED SPACE INTO N A B.
000021   MOVE SPACE TO ln
000022   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000023     IF 1 NOT = i
000024       INSPECT str REPLACING ALL "#" BY "X"
000025       INSPECT str REPLACING ALL "." BY "#"
000026       INSPECT str REPLACING ALL "X" BY "."
000027     ELSE
000028       PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000029         DIVIDE j BY B GIVING q REMAINDER r
000030         IF "#" = cur
000031           MOVE "." TO cur
000032         ELSE
000033           MOVE "#" TO cur
000034         END-IF
000035         PERFORM VARYING k FROM 1 BY 1 UNTIL B < k
000036           MOVE cur TO str(B * (j - 1) + k:1)
000037         END-PERFORM
000038       END-PERFORM
000039     END-IF
000040     PERFORM A TIMES
000041       DISPLAY FUNCTION TRIM(str)
000042     END-PERFORM
000043   END-PERFORM.
000044   STOP RUN.

