000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_055_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 INF        PIC 9(10) VALUE 1000000007.
000007 01 N          PIC 9(6).
000008 01 i          PIC 9(6).
000009 01 tmp        PIC 9(16).
000010 01 zs         PIC Z(17).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   MOVE 1 TO tmp.
000015   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000016     MULTIPLY i BY tmp
000017     COMPUTE tmp = FUNCTION MOD(tmp, INF)
000018   END-PERFORM.
000019   MOVE tmp TO zs.
000020   DISPLAY FUNCTION TRIM(zs).
000021   STOP RUN.

