000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_214_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S         PIC 9(10).
000007 01 T         PIC 9(10).
000008 01 a         PIC 9(10) COMP.
000009 01 b         PIC 9(10) COMP.
000010 01 c         PIC 9(10) COMP.
000011 01 cnt       PIC 9(10) COMP.
000012 01 ln        PIC X(40).
000013 01 zs        PIC Z(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED SPACE INTO S T.
000018   PERFORM VARYING a FROM ZERO BY 1 UNTIL S < a
000019     PERFORM VARYING b FROM ZERO BY 1 UNTIL S < b
000020       PERFORM VARYING c FROM ZERO BY 1 UNTIL S < c
000021         IF a + b + c <= S AND a * b * c <= T
000022           ADD 1 TO cnt
000023         END-IF
000024       END-PERFORM
000025     END-PERFORM
000026   END-PERFORM.
000027   MOVE cnt TO zs.
000028   DISPLAY FUNCTION TRIM(zs).
000029   STOP RUN.

