000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_268_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 D          PIC 9(10).
000010 01 E          PIC 9(10).
000011 01 abcde1.
000012    03 abcde   PIC 9(1) OCCURS 101.
000013 01 i          PIC 9(10) COMP.
000014 01 ln         PIC X(30).
000015 01 num        PIC 9(10).
000016 01 zs         PIC Z(9)9.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   UNSTRING ln DELIMITED SPACE INTO A B C D E.
000021   ADD 1 TO abcde(A + 1).
000022   ADD 1 TO abcde(B + 1).
000023   ADD 1 TO abcde(C + 1).
000024   ADD 1 TO abcde(D + 1).
000025   ADD 1 TO abcde(E + 1).
000026   PERFORM VARYING i FROM 1 BY 1 UNTIL 101 < i
000027     IF ZERO < abcde(i) ADD 1 TO num
000028   END-PERFORM.
000029   MOVE num TO zs.
000030   DISPLAY FUNCTION TRIM(zs).
000031   STOP RUN.

