000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_212_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 ln         PIC X(30).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT ln.
000012   UNSTRING ln DELIMITED SPACE INTO A B.
000013   IF ZERO < A AND ZERO = B DISPLAY "Gold"
000014   ELSE IF ZERO = A AND ZERO < B DISPLAY "Silver"
000015   ELSE DISPLAY "Alloy".
000016   STOP RUN.

