000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_092_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(4).
000007 01 B          PIC 9(4).
000008 01 C          PIC 9(4).
000009 01 D          PIC 9(4).
000010 01 X          PIC 9(4).
000011 01 Y          PIC 9(4).
000012 01 zs         PIC Z(5).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT A.
000016   ACCEPT B.
000017   ACCEPT C.
000018   ACCEPT D.
000019   MOVE FUNCTION MIN(A, B) TO X.
000020   MOVE FUNCTION MIN(C, D) TO Y.
000021   ADD X TO Y.
000022   MOVE Y TO zs.
000023   DISPLAY FUNCTION TRIM(zs).
000024   STOP RUN.

