000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_272_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 M          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 chk11.
000009    03 chk1    OCCURS 100.
000010       05 chk  PIC 9(1) OCCURS 100.
000011 01 flg        PIC 9(1) VALUE 1.
000012 01 i          PIC 9(10) COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 k1.
000015    03 k       PIC 9(10) OCCURS 100 DEPENDING M.
000016 01 l          PIC 9(10) COMP.
000017 01 ln         PIC X(404).
000018 01 pt         PIC S9(10).
000019 01 x11.
000020    03 x1      OCCURS 100.
000021       05 x    PIC 9(10) OCCURS 100.
000022 
000023 PROCEDURE DIVISION.
000024   ACCEPT ln.
000025   UNSTRING ln DELIMITED SPACE INTO N M.
000026   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000027     ACCEPT ln
000028     MOVE 1 TO pt
000029     UNSTRING ln DELIMITED SPACE INTO k(i) POINTER pt
000030     PERFORM VARYING j FROM 1 BY 1 UNTIL k(i) < j
000031       UNSTRING ln DELIMITED SPACE INTO x(i j) POINTER pt
000032     END-PERFORM
000033     PERFORM VARYING j FROM 1 BY 1 UNTIL k(i) < j
000034       ADD 1 TO j GIVING l
000035       PERFORM VARYING l FROM l BY 1 UNTIL k(i) < l
000036         MOVE 1 TO chk(x(i j) x(i l))
000037       END-PERFORM
000038     END-PERFORM
000039   END-PERFORM.
000040   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000041     ADD 1 TO i GIVING j
000042     PERFORM VARYING j FROM j BY 1 UNTIL N < j
000043       IF ZERO = chk(i j) MOVE ZERO TO flg EXIT PERFORM
000044     END-PERFORM
000045     IF ZERO = flg EXIT PERFORM
000046   END-PERFORM.
000047   IF 1 = flg DISPLAY "Yes" ELSE DISPLAY "No".
000048   STOP RUN.

