000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_187_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC 9(9).
000007 01 ans       PIC 9(9) COMP.
000008 01 i         PIC 9(9) COMP.
000009 01 j         PIC 9(9) COMP.
000010 01 ln        PIC X(30).
000011 01 scale     PIC 9(9) VALUE 1.
000012 01 slope     FLOAT-LONG.
000013 01 x1.
000014    03 x      PIC S9(4) OCCURS 1000 DEPENDING N.
000015 01 y1.
000016    03 y      PIC S9(4) OCCURS 1000 DEPENDING N.
000017 01 zs        PIC Z(9)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT N.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000022     ACCEPT ln
000023     UNSTRING ln DELIMITED BY SPACE INTO x(i) y(i)
000024   END-PERFORM.
000025   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000026     ADD 1 TO i GIVING j
000027     PERFORM VARYING j FROM j BY 1 UNTIL N < j
000028       COMPUTE slope = (y(j) - y(i)) / (x(j) - x(i))
000029       IF -scale <= slope AND slope <= scale THEN
000030         ADD 1 TO ans
000031       END-IF
000032     END-PERFORM
000033   END-PERFORM.
000034   MOVE ans TO zs.
000035   DISPLAY FUNCTION TRIM(zs).
000036   STOP RUN.

