000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_099_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ab.
000007    03 ab1 OCCURS 2.
000008       05 ab11 PIC 9(18).
000009 01 ablen      PIC 9(2) VALUE 2.
000010 01 cur        PIC 9(2) VALUE 1.
000011 01 div        PIC 9(18).
000012 01 i          PIC 9(18) VALUE 1.
000013 01 j          PIC 9(18).
000014 01 ln         PIC X(19).
000015 01 len        PIC 9(2).
000016 01 s          PIC 9(18).
000017 01 t          PIC 9(18).
000018 01 zs         PIC Z(18).
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT ln.
000022   PERFORM ablen TIMES
000023     PERFORM VARYING j FROM cur BY 1
000024       UNTIL ln(j:1) = SPACE
000025     END-PERFORM
000026     COMPUTE len = j - cur
000027     MOVE ln(cur:len) TO ab11(i)
000028     COMPUTE cur = j + 1
000029     ADD 1 TO i
000030   END-PERFORM.
000031   COMPUTE div = ab11(2) - ab11(1).
000032   MOVE 0 TO s.
000033   MOVE 1 TO i.
000034   PERFORM div TIMES
000035     ADD i TO s
000036     ADD 1 TO i
000037   END-PERFORM.
000038   COMPUTE t = s - ab11(2).
000039   MOVE t TO zs.
000040   DISPLAY FUNCTION TRIM(zs).
000041   STOP RUN.

