000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_166_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11 OCCURS 100 DEPENDING ON N.
000008       05 A    PIC S9(10) VALUE 1.
000009 01 K          PIC 9(10).
000010 01 N          PIC 9(10).
000011 01 ans        PIC 9(10).
000012 01 cur        PIC 9(10) VALUE 1 COMP.
000013 01 i          PIC 9(10) VALUE 1 COMP.
000014 01 idx        PIC 9(10).
000015 01 j          PIC 9(10) COMP.
000016 01 len        PIC 9(10) COMP.
000017 01 ln         PIC X(599).
000018 01 maxlen     PIC 9(10) VALUE 100 COMP.
000019 01 zs         PIC Z(9)9.
000020 
000021 PROCEDURE DIVISION.
000022   ACCEPT ln.
000023   UNSTRING ln DELIMITED BY SPACE INTO N K.
000024   PERFORM K TIMES
000025    ACCEPT maxlen
000026    ACCEPT ln
000027    MOVE 1 TO cur
000028    PERFORM maxlen TIMES
000029      PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000030      END-PERFORM
000031      COMPUTE len = j - cur
000032      MOVE ln(cur:len) TO idx
000033      MOVE ZERO TO A(idx)
000034      COMPUTE cur = j + 1
000035      ADD 1 TO i
000036    END-PERFORM
000037   END-PERFORM.
000038   PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000039     IF ZERO < A(j)
000040       ADD A(j) TO ans
000041     END-IF
000042   END-PERFORM.
000043   MOVE ans TO zs.
000044   DISPLAY FUNCTION TRIM(zs).
000045   STOP RUN.

