000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_230_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC 9(3).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT N.
000010   IF 42 <= N ADD 1 TO N.
000011   DISPLAY "AGC" N.
000012   STOP RUN.

