000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_032_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 flg        PIC 9(1).
000007 01 i          PIC 9(10) COMP.
000008 01 ix         PIC 9(10) VALUE 1 COMP.
000009 01 j          PIC 9(10) COMP.
000010 01 k          PIC 9(10).
000011 01 len        PIC 9(10).
000012 01 pw1.
000013    03 pw      PIC X(300) OCCURS 90000 INDEXED BY xp.
000014 01 s          PIC X(300).
000015 01 zs         PIC Z(9)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT s.
000019   ACCEPT k.
000020   MOVE FUNCTION STORED-CHAR-LENGTH(s) TO len.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL len - k + 1 < i
000022     SET xp TO 1
000023     MOVE ZERO TO flg
000024     SEARCH pw VARYING xp
000025       AT END
000026         CONTINUE
000027       WHEN ZERO = FUNCTION STORED-CHAR-LENGTH(pw(xp))
000028         MOVE 0 TO flg
000029       WHEN FUNCTION TRIM(pw(xp)) = s(i:k)
000030         MOVE 1 TO flg
000031     END-SEARCH
000032     IF ZERO = flg THEN
000033       MOVE s(i:k) TO pw(ix)
000034       ADD 1 TO ix
000035     END-IF
000036   END-PERFORM.
000037   SUBTRACT 1 FROM ix.
000038   MOVE ix TO zs.
000039   DISPLAY FUNCTION TRIM(zs).
000040   STOP RUN.

