000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_238_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC 9(10) OCCURS 359 DEPENDING N.
000008 01 N          PIC 9(10).
000009 01 cur        PIC 9(10).
000010 01 fe         PIC 9(10) VALUE 1.
000011 01 front1.
000012    03 front   PIC 9(10) VALUE ZERO OCCURS 35000.
000013 01 fs         PIC 9(10) VALUE 1.
000014 01 fsz        PIC 9(10) VALUE 0.
000015 01 i          PIC 9(10) COMP.
000016 01 ln         PIC X(1600).
000017 01 mx         PIC 9(10) VALUE ZERO.
000018 01 pt         PIC S9(10) VALUE 1.
000019 01 qe         PIC 9(10) VALUE 1.
000020 01 qs         PIC 9(10) VALUE 1.
000021 01 qsz        PIC 9(10) VALUE 0.
000022 01 que1.
000023    03 que     PIC 9(10) VALUE ZERO OCCURS 35000.
000024 01 zs         PIC Z(9)9.
000025 
000026 PROCEDURE DIVISION.
000027   ACCEPT N.
000028   ACCEPT ln.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000030     UNSTRING ln DELIMITED SPACE INTO A(i) POINTER pt
000031   END-PERFORM.
000032   MOVE 360 TO que(qe).
000033   ADD 1 TO qe.
000034   ADD 1 TO qsz.
000035   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000036     PERFORM UNTIL fsz = ZERO AND qsz = ZERO
000037       IF fsz = ZERO
000038         MOVE que(qs) TO cur
000039         MOVE ZERO TO que(qs)
000040         ADD 1 TO qs
000041         SUBTRACT 1 FROM qsz
000042       ELSE
000043         MOVE front(fe - 1) TO cur
000044         MOVE ZERO TO front(fe - 1)
000045         SUBTRACT 1 FROM fe
000046         SUBTRACT 1 FROM fsz
000047       END-IF
000048       IF A(i) < cur
000049         MOVE A(i) TO que(qe)
000050         ADD 1 TO qe
000051         ADD 1 TO qsz
000052         COMPUTE front(fe) = cur - A(i)
000053         ADD 1 TO fe
000054         ADD 1 TO fsz
000055         EXIT PERFORM
000056       ELSE
000057         MOVE cur TO que(qe)
000058         ADD 1 TO qe
000059         ADD 1 TO qsz
000060         SUBTRACT cur FROM A(i)
000061     END-PERFORM
000062   END-PERFORM.
000063   PERFORM VARYING i FROM fs BY 1 UNTIL fe <= i
000064     IF mx < front(i) MOVE front(i) TO mx END-IF
000065   END-PERFORM.
000066   PERFORM VARYING i FROM qs BY 1 UNTIL qe <= i
000067     IF mx < que(i) MOVE que(i) TO mx END-IF
000068   END-PERFORM.
000069   MOVE mx TO zs.
000070   DISPLAY FUNCTION TRIM(zs).
000071   STOP RUN.

