000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_054_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 ln         PIC X(30).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT ln.
000012   UNSTRING ln DELIMITED BY SPACE INTO A B.
000013   IF A = 1 THEN
000014     ADD 13 TO A
000015   END-IF.
000016   IF B = 1 THEN
000017     ADD 13 TO B
000018   END-IF.
000019   IF B < A THEN
000020     DISPLAY "Alice"
000021   ELSE
000022     IF A < B THEN
000023       DISPLAY "Bob"
000024     ELSE
000025       DISPLAY "Draw"
000026     END-IF
000027   END-IF.
000028   STOP RUN.

