000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_199_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC 9(10) OCCURS 100 DEPENDING N.
000008 01 B1.
000009    03 B       PIC 9(10) OCCURS 100 DEPENDING N.
000010 01 N          PIC 9(10).
000011 01 ary1.
000012    03 ary     PIC S9(10) VALUE ZERO OCCURS 1001.
000013 01 ans        PIC 9(10) VALUE ZERO COMP.
000014 01 i          PIC 9(10) COMP.
000015 01 ln         PIC X(500).
000016 01 pt         PIC S9(10).
000017 01 upper      PIC 9(10) VALUE 1001.
000018 01 zs         PIC Z(9)9.
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT N.
000022   ACCEPT ln.
000023   MOVE 1 TO pt.
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000025     UNSTRING ln DELIMITED SPACE INTO A(i) WITH POINTER pt
000026   END-PERFORM.
000027   ACCEPT ln.
000028   MOVE 1 TO pt.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000030     UNSTRING ln DELIMITED SPACE INTO B(i) WITH POINTER pt
000031   END-PERFORM.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000033     ADD 1 TO ary(A(i))
000034     SUBTRACT 1 FROM ary(B(i) + 1)
000035   END-PERFORM.
000036   PERFORM VARYING i FROM 2 BY 1 UNTIL upper < i
000037     ADD ary(i - 1) TO ary(i)
000038   END-PERFORM.
000039   PERFORM VARYING i FROM 1 BY 1 UNTIL upper < i
000040     IF N = ary(i) ADD 1 TO ans
000041   END-PERFORM.
000042   MOVE ans TO zs.
000043   DISPLAY FUNCTION TRIM(zs).
000044   STOP RUN.

