000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_041_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 INF        PIC 9(10) VALUE 1000000007.
000007 01 a          PIC 9(10).
000008 01 b          PIC 9(10).
000009 01 c          PIC 9(10).
000010 01 ln         PIC X(32).
000011 01 x          PIC 9(20).
000012 01 zs         PIC Z(21).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO a b c.
000017   MULTIPLY a BY b GIVING x.
000018   COMPUTE x = FUNCTION MOD(x, INF).
000019   MULTIPLY x BY c GIVING x.
000020   COMPUTE x = FUNCTION MOD(x, INF).
000021   MOVE x TO zs.
000022   DISPLAY FUNCTION TRIM(zs).
000023   STOP RUN.

