000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_233_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA PIC X(100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 L         PIC 9(10).
000016 01 R         PIC 9(10).
000017 01 S         PIC X(100000).
000018 01 chr       PIC X(1).
000019 01 i         PIC 9(10) COMP.
000020 01 j         PIC 9(10) COMP.
000021 
000022 PROCEDURE DIVISION.
000023   OPEN INPUT SYSIN.
000024   READ SYSIN.
000025   UNSTRING INDATA DELIMITED SPACE INTO L R.
000026   READ SYSIN INTO S.
000027   CLOSE SYSIN.
000028   MOVE R TO j.
000029   PERFORM VARYING i FROM L BY 1 UNTIL j <= i
000030     MOVE S(j:1) TO chr
000031     MOVE S(i:1) TO S(j:1)
000032     MOVE chr TO S(i:1)
000033     SUBTRACT 1 FROM j
000034   END-PERFORM.
000035   DISPLAY FUNCTION TRIM(S).
000036   STOP RUN.

