000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_087_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(2).
000007 01 B          PIC 9(2).
000008 01 C          PIC 9(2).
000009 01 X          PIC 9(5).
000010 01 cnt        PIC 9(5) VALUE 0.
000011 01 i          PIC 9(2).
000012 01 j          PIC 9(2).
000013 01 k          PIC 9(2).
000014 01 val        PIC 9(5).
000015 01 zs         PIC Z(4)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT A.
000019   ACCEPT B.
000020   ACCEPT C.
000021   ACCEPT X.
000022   PERFORM VARYING i FROM 0 BY 1 UNTIL A < i
000023     PERFORM VARYING j FROM 0 BY 1 UNTIL B < j
000024       PERFORM VARYING k FROM 0 BY 1 UNTIL C < k
000025         COMPUTE val = 500 * i + 100 * j + 50 * k
000026         IF val = X THEN
000027           ADD 1 TO cnt
000028         END-IF
000029       END-PERFORM
000030     END-PERFORM
000031   END-PERFORM.
000032   MOVE cnt TO zs.
000033   DISPLAY FUNCTION TRIM(zs).

