000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_268_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(100).
000007 01 T          PIC X(100).
000008 01 len        PIC 9(10).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT S.
000012   ACCEPT T.
000013   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
000014   IF S(1:len) = T(1:len) DISPLAY "Yes" ELSE DISPLAY "No".
000015   STOP RUN.

