000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_117_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 maxlen     PIC 9(10) VALUE 100 COMP.
000008 01 cur        PIC 9(10) VALUE 1 COMP.
000009 01 i          PIC 9(10) VALUE 1 COMP.
000010 01 j          PIC 9(10) COMP.
000011 01 len        PIC 9(10) COMP.
000012 01 zs         PIC Z(9)9.
000013 01 N          PIC 9(10).
000014 01 L          PIC 9(10).
000015 01 LSUM       PIC 9(10) VALUE ZERO.
000016 01 LMAX       PIC 9(10) VALUE ZERO.
000017 01 A1.
000018    03 A11 OCCURS 100 DEPENDING ON N.
000019       05 A    PIC S9(10).
000020 
000021 PROCEDURE DIVISION.
000022   ACCEPT N.
000023   ACCEPT ln.
000024   MOVE N TO maxlen.
000025   PERFORM maxlen TIMES
000026     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000027     END-PERFORM
000028     COMPUTE len = j - cur
000029     MOVE ln(cur:len) TO L
000030     COMPUTE cur = j + 1
000031     ADD 1 TO i
000032     ADD L TO LSUM
000033     IF LMAX < L
000034       MOVE L TO LMAX
000035     END-IF
000036   END-PERFORM.
000037   SUBTRACT LMAX FROM LSUM.
000038   IF LMAX < LSUM
000039     DISPLAY "Yes"
000040   ELSE
000041     DISPLAY "No"
000042   END-IF.
000043   STOP RUN.
