000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_012_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC X(3).
000007 01 B          PIC X(3).
000008 01 BA        PIC X(10).
000009 01 ln         PIC X(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO A B.
000014   STRING
000015     FUNCTION TRIM(B)
000016     SPACE
000017     FUNCTION TRIM(A)
000018     INTO BA
000019   END-STRING.
000020   DISPLAY FUNCTION TRIM(BA)
000021   STOP RUN.

