000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_248_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(9).
000007 01 REDEFINES S.
000008    03 SC      PIC X OCCURS 9.
000009 01 i          PIC 9(10) COMP.
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT S.
000014   SORT SC ASCENDING SC.
000015   PERFORM VARYING i FROM ZERO BY 1 UNTIL 9 < i
000016     IF i NOT = FUNCTION NUMVAL(SC(i + 1)) EXIT PERFORM
000017   END-PERFORM.
000018   MOVE i TO zs.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

