000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_057_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(2).
000007 01 M          PIC 9(2).
000008 01 ans        PIC X(2).
000009 01 dt         PIC 9(9).
000010 01 dtx        PIC 9(9).
000011 01 dty        PIC 9(9).
000012 01 i          PIC 9(2).
000013 01 j          PIC 9(2).
000014 01 ln         PIC X(5).
000015 01 ln2        PIC X(21).
000016 01 mn         PIC 9(9).
000017 01 p          PIC 9(2).
000018 01 pt1.
000019    03 pt11 OCCURS 50.
000020       05 ptx  PIC S9(9).
000021       05 pty  PIC S9(9).
000022 01 st1.
000023    03 st11 OCCURS 50.
000024       05 stx  PIC S9(9).
000025       05 sty  PIC S9(9).
000026 01 zs         PIC Z(2)9.
000027 
000028 PROCEDURE DIVISION.
000029   ACCEPT ln.
000030   UNSTRING ln DELIMITED BY SPACE INTO N M.
000031   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000032     ACCEPT ln2
000033     UNSTRING ln2 DELIMITED BY SPACE INTO stx(i) sty(i)
000034   END-PERFORM.
000035   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000036     ACCEPT ln2
000037     UNSTRING ln2 DELIMITED BY SPACE INTO ptx(i) pty(i)
000038   END-PERFORM.
000039   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000040     MOVE 400000001 TO mn
000041     PERFORM VARYING j FROM 1 BY 1 UNTIL M < j
000042       SUBTRACT ptx(j) FROM stx(i) GIVING dtx
000043       SUBTRACT pty(j) FROM sty(i) GIVING dty
000044       ADD dtx TO dty GIVING dt
000045       IF dt < mn THEN
000046         MOVE dt TO mn
000047         MOVE j TO p
000048       END-IF
000049     END-PERFORM
000050     MOVE p TO zs
000051     DISPLAY FUNCTION TRIM(zs)
000052   END-PERFORM.
000053   STOP RUN.

