000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_150_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N              PIC 9(10).
000007 01 S              PIC X(50).
000008 01 ans            PIC Z(9)9.
000009 01 cnt            PIC 9(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT N.
000013   ACCEPT S.
000014   INSPECT S TALLYING cnt FOR ALL "ABC".
000015   MOVE cnt TO ans.
000016   DISPLAY FUNCTION TRIM(ans).
000017   STOP RUN.

