000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_001_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 VV         PIC 9(2).
000007 01 m          PIC 9(10).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT m.
000011   IF m < 100 THEN
000012     MOVE ZERO TO VV
000013   ELSE
000014     IF 100 <= m AND m <= 5000 THEN
000015       DIVIDE m BY 100 GIVING VV
000016     ELSE
000017       IF 6000 <= m AND m <= 30000 THEN
000018         DIVIDE m BY 1000 GIVING VV
000019         ADD 50 TO VV
000020       ELSE
000021         IF 35000 <= m AND m <= 70000 THEN
000022           DIVIDE m BY 1000 GIVING VV
000023           SUBTRACT 30 FROM VV
000024           DIVIDE VV BY 5 GIVING VV
000025           ADD 80 TO VV
000026         ELSE
000027           MOVE 89 TO VV
000028         END-IF
000029       END-IF
000030     END-IF
000031   END-IF.
000032   DISPLAY VV.
000033   STOP RUN.

