000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_123_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans        PIC 9(10) VALUE ZERO.
000007 01 zs         PIC Z(9)9.
000008 01 i          PIC 9(10) VALUE 1 COMP.
000009 01 D          PIC 9(10).
000010 01 R          PIC 9(10).
000011 01 AE1.
000012    03 AE11 OCCURS 5.
000013       05 AE   PIC 9(10).
000014 01 L1.
000015    03 L11 OCCURS 5.
000016       05 L    PIC 9(10).
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT AE(1).
000020   ACCEPT AE(2).
000021   ACCEPT AE(3).
000022   ACCEPT AE(4).
000023   ACCEPT AE(5).
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL 5 < i
000025     DIVIDE AE(i) BY 10 GIVING D REMAINDER R
000026     IF ZERO < R
000027       COMPUTE L(i) = 10 - R
000028     END-IF
000029     ADD AE(i) TO ans
000030   END-PERFORM.
000031   SORT L11 DESCENDING L.
000032   PERFORM VARYING i FROM 2 BY 1 UNTIL 5 < i
000033     ADD L(i) TO ans
000034   END-PERFORM.
000035   MOVE ans TO zs.
000036   DISPLAY FUNCTION TRIM(zs)
000037   STOP RUN.
