000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_127_A.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 ans        PIC 9(10).
000080 01 zs         PIC Z(9)9.
000090 01 A          PIC 9(10).
000100 01 B          PIC 9(10).
000110 
000120 PROCEDURE DIVISION.
000130   ACCEPT ln.
000140   UNSTRING ln DELIMITED BY SPACE INTO A B.
000150   IF 13 <= A
000160     MOVE B TO ans
000170   ELSE
000180     IF 6 <= A
000190       COMPUTE ans = B / 2
000200     ELSE
000210       MOVE ZERO TO ans
000220     END-IF
000230   END-IF.
000240   MOVE ans TO zs.
000250   DISPLAY FUNCTION TRIM(zs).
000260   STOP RUN.
