000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_033_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 SP1.
000008    03 SP11 OCCURS 1000 DEPENDING ON N.
000009       05 S    PIC X(20).
000010       05 P    PIC 9(10).
000011 01 ans        PIC X(20).
000012 01 half       PIC 9(10).
000013 01 i          PIC 9(10) COMP.
000014 01 ln         PIC X(400).
000015 01 num        PIC 9(10) VALUE ZERO.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT N.
000019   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000020     ACCEPT ln
000021     UNSTRING ln DELIMITED BY SPACE INTO S(i) P(i)
000022     ADD P(i) TO num
000023   END-PERFORM.
000024   DIVIDE num BY 2 GIVING half.
000025   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000026     IF half < P(i) THEN
000027       MOVE S(i) TO ans
000028       EXIT PERFORM
000029     END-IF
000030   END-PERFORM.
000031   IF ZERO NOT = FUNCTION STORED-CHAR-LENGTH(ans) THEN
000032     DISPLAY FUNCTION TRIM(ans)
000033   ELSE
000034     DISPLAY "atcoder"
000035   END-IF.
000036   STOP RUN.

