000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_041_D.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 *> 2
000008 01 BNY        EXTERNAL PIC 9(1).
000009 *> 4
000010 01 BYT4       EXTERNAL PIC 9(1).
000011 *> 8
000012 01 OCT        EXTERNAL PIC 9(1).
000013 01 HX_ZERO    PIC X(2) VALUE X"0000".
000014 01 INP        PIC X(6).
000015 01 INP2       PIC X(5).
000016 01 N          PIC 9(2).
000017 01 M          PIC 9(3).
000018 01 ZS         PIC Z(19).
000019 01 ans        PIC X(18).
000020 01 DUMMY      PIC X(1).
000021 01 idx        PIC 9(2).
000022 01 shift      PIC 9(5).
000023 01 dpsize     PIC 9(5).
000024 01 i          PIC 9(5).
000025 01 j          PIC 9(2).
000026 01 h_i        PIC X(2) VALUE X"0000".
000027 01 h_j        PIC X(2) VALUE X"0000".
000028 01 h_val      PIC X(2) VALUE X"0000".
000029 01 h_idx      PIC X(2) VALUE X"0000".
000030 01 bk_x       PIC X(4).
000031 01 x          PIC 9(2).
000032 01 y          PIC 9(2).
000033 01 rabbit1.
000034    03 rabbit11 OCCURS 16.
000035       05 rabbit PIC X(2) VALUE X"0000".
000036 01 dp0        PIC 9(18).
000037 01 dp1.
000038     03 dp11 OCCURS 70000.
000039        05 dp  PIC 9(18).
000040 01 dpval      PIC 9(18).
000041 01 h_txt      PIC X(4) VALUE SPACE.
000042 01 b_txt      PIC X(16) VALUE SPACE.
000043 01 d_num      PIC 9(5) VALUE ZERO.
000044 01 xx         PIC 9(2).
000045 
000046 PROCEDURE DIVISION.
000047   CALL "SET_EXTERNAL".
000048   CALL "B_TABLE".
000049   ACCEPT INP.
000050   UNSTRING INP DELIMITED BY SPACE INTO N M.
000051   MOVE 1 TO shift.
000052   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000053     COMPUTE shift = BNY ** (i - 1)
000054     CALL "DCM_TO_HEX" USING BY CONTENT shift
000055                             BY REFERENCE rabbit(i)
000056   END-PERFORM.
000057   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000058     ACCEPT INP2
000059     UNSTRING INP2 DELIMITED BY SPACE INTO x y
000060     MOVE rabbit(x) TO bk_x
000061     CALL "CBL_OR" USING bk_x, rabbit(y) BY VALUE BNY
000062   END-PERFORM.
000063   COMPUTE dpsize = BNY ** N - 1.
000064   MOVE 1 TO dp0.
000065   PERFORM VARYING i FROM 0 BY 1 UNTIL dpsize < i
000066     CALL "DCM_TO_HEX" USING BY CONTENT i
000067                             BY REFERENCE h_i
000068     MOVE 1 TO dpval
000069     IF i NOT = 0 THEN
000070       MOVE dp(i) TO dpval
000071     END-IF
000072     PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000073       COMPUTE shift = BNY ** (j - 1)
000074       CALL "DCM_TO_HEX" USING BY CONTENT shift
000075                                 BY REFERENCE h_j
000076       MOVE h_i TO h_val
000077       CALL "CBL_AND" USING rabbit(j), h_val BY VALUE BNY
000078       IF h_val = HX_ZERO THEN
000079         MOVE h_i TO h_idx
000080         CALL "CBL_OR" USING h_j, h_idx BY VALUE BNY
000081         *> 16進数 を 2進数、10進数 に変換
000082         CALL "HEX_TO_OTHER" USING BY CONTENT h_idx
000083                                   BY REFERENCE b_txt
000084                                   BY REFERENCE d_num
000085                                   BY REFERENCE h_txt
000086         COMPUTE dp(d_num) = dp(d_num) + dp(i)
000087       END-IF
000088     END-PERFORM
000089   END-PERFORM.
000090   MOVE dp(dpsize) TO zs.
000091   DISPLAY FUNCTION TRIM(zs).
000092   STOP RUN.
000093 END PROGRAM ABC_041_D.
000094 
000095 IDENTIFICATION DIVISION.
000096 PROGRAM-ID. SET_EXTERNAL.
000097 *> 外部データ
000098 *> 実行単位中の複数のプログラムで使用する定数を設定
000099 *> external data
000100 *> Set constants used for multiple programs in running unit
000101 DATA DIVISION.
000102 WORKING-STORAGE SECTION.
000103 01 BNY        EXTERNAL PIC 9(1).
000104 01 BIT4       EXTERNAL PIC 9(1).
000105 01 BYT4       EXTERNAL PIC 9(1).
000106 01 BYT32      EXTERNAL PIC 9(2).
000107 01 BYT256     EXTERNAL PIC 9(3).
000108 01 HXD        EXTERNAL PIC 9(2).
000109 01 NUM_ON     EXTERNAL PIC 9(1).
000110 01 NUM_OFF    EXTERNAL PIC 9(1).
000111 01 OCT        EXTERNAL PIC 9(1).
000112 
000113 *> 16進数 対応表 0 〜 15
000114 01 H_TBL1 EXTERNAL.
000115    03 H_TBL11 OCCURS 16.
000116       05 H_TBL PIC X(1).
000117 
000118 PROCEDURE DIVISION.
000119   MOVE 2 TO BNY.
000120   MOVE 4 TO BIT4.
000121   MOVE 4 TO BYT4.
000122   MOVE 32 TO BYT32.
000123   MOVE 256 TO BYT256.
000124   MOVE 16 TO HXD.
000125   MOVE 1 TO NUM_ON.
000126   MOVE 0 TO NUM_OFF.
000127   MOVE 8 TO OCT.
000128   MOVE "0123456789ABCDEF" TO H_TBL1.
000129 END PROGRAM SET_EXTERNAL.
000130 
000131 IDENTIFICATION DIVISION.
000132 PROGRAM-ID. B_TABLE.
000133 *> 2進数 対応表 0 〜 15
000134 *> 0001
000135 *> 0010
000136 *> 中略
000137 *> 1111
000138 DATA DIVISION.
000139 WORKING-STORAGE SECTION.
000140 *> 16
000141 01 HXD        EXTERNAL PIC 9(2).
000142 *> 2
000143 01 BNY        EXTERNAL PIC 9(1).
000144 *> 4
000145 01 BYT4       EXTERNAL PIC 9(1).
000146 *> 8
000147 01 OCT        EXTERNAL PIC 9(1).
000148 01 p          PIC 9(1).
000149 01 i          PIC 9(8).
000150 01 j          PIC 9(8).
000151 01 q          PIC 9(2).
000152 01 r          PIC 9(1).
000153 01 s          PIC X(1).
000154 01 str        PIC X(4).
000155 01 len        PIC 9(1).
000156 01 idx        PIC 9(2).
000157 *> 2進数 対応表 0 〜 15
000158 01 B_TBL1 EXTERNAL.
000159    03 B_TBL11 OCCURS 16.
000160       05 B_TBL PIC X(4).
000161 
000162 PROCEDURE DIVISION.
000163   *> 0 〜 15
000164   PERFORM VARYING i FROM 0 BY 1 UNTIL HXD <= i
000165     MOVE i TO q
000166     MOVE ALL ZERO TO str
000167     *> 繰り返し 2 で割る
000168     PERFORM VARYING j FROM 0 BY 1 UNTIL q <= 0
000169       DIVIDE BNY INTO q GIVING q REMAINDER r
000170       COMPUTE p = FUNCTION STORED-CHAR-LENGTH(str)
000171       SUBTRACT j FROM p
000172       MOVE r TO s
000173       STRING
000174         s
000175         INTO str WITH POINTER p
000176       END-STRING
000177     END-PERFORM
000178     ADD 1 TO i GIVING idx
000179     *> 2進数 対応表 設定
000180     MOVE str TO B_TBL(idx)
000181   END-PERFORM.
000182 END PROGRAM B_TABLE.
000183 
000184 IDENTIFICATION DIVISION.
000185 PROGRAM-ID. DCM_TO_HEX.
000186 *> 10進数 を 16進数 に変換
000187 *> 2 byte (16 bit) 用
000188 *> Convert decimal number to hexadecimal number
000189 *> For 2 byte (16 bit)
000190 DATA DIVISION.
000191 WORKING-STORAGE SECTION.
000192 *> 2
000193 01 BNY        EXTERNAL PIC 9(1).
000194 *> 4
000195 01 BYT4       EXTERNAL PIC 9(1).
000196 *> 256
000197 01 BYT256     EXTERNAL PIC 9(3).
000198 *> 8
000199 01 OCT        EXTERNAL PIC 9(1).
000200 01 d          PIC 9(3) BINARY.
000201 01 filler REDEFINES d.
000202    03 filler  PIC X.
000203    03 dbyte   PIC X.
000204 01 i          PIC 9(1).
000205 01 idx        PIC 9(1).
000206 01 q          PIC 9(5).
000207 01 r          PIC 9(3).
000208 
000209 LINKAGE SECTION.
000210 *> (IN)  d_num
000211 *> (OUT) h_num
000212 01 d_num      PIC 9(5).
000213 01 h_num      PIC X(2).
000214 
000215 PROCEDURE DIVISION USING d_num h_num.
000216   INITIALIZE h_num.
000217   MOVE d_num TO q.
000218   *> 1 byte ずつ処理
000219   PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH of h_num < i
000220     COMPUTE idx = BNY - i
000221     *> 10進数 を 256 で割る
000222     DIVIDE BYT256 INTO q GIVING q REMAINDER r
000223     *> 余り(10進数 1 byte) を 代入することで
000224     MOVE r TO d
000225     *> 16進数 を得ることができる
000226     MOVE dbyte TO h_num(idx + 1:1)
000227   END-PERFORM.
000228 END PROGRAM DCM_TO_HEX.
000229 
000230 IDENTIFICATION DIVISION.
000231 PROGRAM-ID. HEX_TO_OTHER.
000232 *> 16進数 を 2進数、10進数 に変換
000233 *> 2 byte (16 bit) 用
000234 *> Convert hexadecimal number to binary number, decimal number
000235 *> For 2 byte (16 bit)
000236 DATA DIVISION.
000237 WORKING-STORAGE SECTION.
000238 *> 4
000239 01 BIT4       EXTERNAL PIC 9(1).
000240 *> 2
000241 01 BNY        EXTERNAL PIC 9(1).
000242 *> 256
000243 01 BYT256     EXTERNAL PIC 9(3).
000244 *> 16
000245 01 HXD        EXTERNAL PIC 9(2).
000246 *> 8
000247 01 OCT        EXTERNAL PIC 9(1).
000248 01 d          PIC 9(3) BINARY.
000249 01 filler REDEFINES d.
000250    03 filler  PIC X.
000251    03 dbyte   PIC X.
000252 01 i          PIC 9(1).
000253 01 j          PIC 9(1).
000254 01 k          PIC 9(2).
000255 01 m          PIC 9(1).
000256 01 q          PIC 9(5).
000257 01 r          PIC 9(3).
000258 *> 2進数 対応表 0 〜 15
000259 01 B_TBL1 EXTERNAL.
000260    03 B_TBL11 OCCURS 16.
000261       05 B_TBL PIC X(4).
000262 *> 16進数 対応表 0 〜 15
000263 01 H_TBL1 EXTERNAL.
000264    03 H_TBL11 OCCURS 16.
000265       05 H_TBL PIC X(1).
000266 
000267 LINKAGE SECTION.
000268 *> (IN)  h_num
000269 *> (OUT) b_txt
000270 *>       d_num
000271 *>       h_txt
000272 01 h_num      PIC X(2).
000273 01 b_txt      PIC X(16).
000274 01 d_num      PIC 9(5).
000275 01 h_txt      PIC X(4).
000276 
000277 PROCEDURE DIVISION USING h_num b_txt d_num h_txt.
000278   INITIALIZE b_txt.
000279   INITIALIZE d_num.
000280   INITIALIZE h_txt.
000281   *> 1 byte ずつ処理
000282   PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH OF h_num < i
000283     *> 2 * i - 1
000284     COMPUTE j = BNY * i - 1
000285     *> 8 * i - 7
000286     COMPUTE k = OCT * (i - 1) + 1
000287      *> 3 - (2 * i - 1)
000288     COMPUTE m = BIT4 - BNY * i
000289     *> 16進数 1 byte を 代入することで
000290     MOVE h_num(i:1) TO dbyte
000291     *> 得られた 10進数 を 16 で割る
000292     DIVIDE HXD INTO d GIVING q REMAINDER r
000293     *> 前から格納していく
000294     *> [F]
000295     MOVE H_TBL(q + 1) TO h_txt(j:1)
000296     *> [FF]
000297     MOVE H_TBL(r + 1) TO h_txt(j + 1:1)
000298     *> [1111]
000299     MOVE B_TBL(q + 1) TO b_txt(k:BIT4)
000300     *> [11111111]
000301     MOVE B_TBL(r + 1) TO b_txt(k + BIT4:BIT4)
000302     *> 16^0 の位 から 16^3 の位 までの 8桁
000303     *> 10進数 上位桁 足し込み
000304     COMPUTE d_num = d_num + HXD ** (m + 1) * q
000305     *> 10進数 下位桁 足し込み
000306     COMPUTE d_num = d_num + HXD ** m * r
000307   END-PERFORM.
000308 END PROGRAM HEX_TO_OTHER.

