000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_199_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC 9(10) OCCURS 100 DEPENDING N.
000008 01 B1.
000009    03 B       PIC 9(10) OCCURS 100 DEPENDING N.
000010 01 N          PIC 9(10).
000011 01 N1         PIC 9(10).
000012 01 ary1.
000013    03 ary     PIC S9(10) VALUE ZERO OCCURS 1001.
000014 01 ans        PIC 9(10) VALUE ZERO COMP.
000015 01 i          PIC 9(10) COMP.
000016 01 ln         PIC X(500).
000017 01 pt         PIC S9(10).
000018 01 upper      PIC 9(10) VALUE 1001.
000019 01 zs         PIC Z(9)9.
000020 
000021 PROCEDURE DIVISION.
000022   ACCEPT N.
000023   ADD 1 TO N GIVING N1.
000024   ACCEPT ln.
000025   MOVE 1 TO pt.
000026   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000027     UNSTRING ln DELIMITED SPACE INTO A(i) WITH POINTER pt
000028   END-PERFORM.
000029   ACCEPT ln.
000030   MOVE 1 TO pt.
000031   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000032     UNSTRING ln DELIMITED SPACE INTO B(i) WITH POINTER pt
000033   END-PERFORM.
000034   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000035     ADD 1 TO ary(A(i))
000036     SUBTRACT 1 FROM ary(B(i) + 1)
000037   END-PERFORM.
000038   PERFORM VARYING i FROM 2 BY 1 UNTIL upper < i
000039     ADD ary(i - 1) TO ary(i)
000040   END-PERFORM.
000041   PERFORM VARYING i FROM 1 BY 1 UNTIL upper < i
000042     IF N = ary(i) ADD 1 TO ans
000043   END-PERFORM.
000044   MOVE ans TO zs.
000045   DISPLAY FUNCTION TRIM(zs).
000046   STOP RUN.

