000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_243_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 V          PIC S9(10).
000010 01 ln         PIC X(30).
000011 01 turn       PIC X(1) VALUE "T".
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED SPACE INTO V A B C.
000016   PERFORM UNTIL V < ZERO
000017     IF "T" = turn SUBTRACT A FROM V MOVE "F" TO turn
000018     ELSE IF "F" = turn SUBTRACT B FROM V MOVE "M" TO turn
000019     ELSE IF "M" = turn SUBTRACT C FROM V MOVE "T" TO turn
000020   END-PERFORM.
000021   DISPLAY turn.
000022   STOP RUN.

