000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_103_D.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(6).
000007 01 M          PIC 9(6).
000008 01 ans        PIC X(6).
000009 01 ab1.
000010    03 ab OCCURS 100000 DEPENDING M.
000011       05 a    PIC 9(6).
000012       05 b    PIC 9(6).
000013 01 cnt        PIC 9(6).
000014 01 done       PIC 9(6) VALUE ZERO.
000015 01 i          PIC 9(6) BINARY.
000016 01 ln         PIC X(13).
000017 01 zs         PIC Z(7).
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT ln.
000021   UNSTRING ln DELIMITED BY SPACE INTO N M.
000022   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000023     ACCEPT ln
000024     UNSTRING ln DELIMITED BY SPACE INTO a(i) b(i)
000025   END-PERFORM.
000026   SORT ab ASCENDING b.
000027   MOVE ZERO TO done.
000028   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000029     IF done < a(i) THEN
000030       ADD 1 TO cnt
000031       MOVE b(i) TO done
000032       SUBTRACT 1 FROM done
000033     END-IF
000034   END-PERFORM.
000035   MOVE cnt TO zs.
000036   DISPLAY FUNCTION TRIM(zs).
000037   STOP RUN.

