000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_217_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S1.
000007    03 S       PIC X(3) OCCURS 3 INDEXED IXS.
000008 01 contests1.
000009    03 contests PIC X(3) OCCURS 4.
000010 01 flg        PIC 9(1).
000011 01 i          PIC 9(10).
000012 
000013 PROCEDURE DIVISION.
000014   MOVE "ABC" TO contests(1).
000015   MOVE "ARC" TO contests(2).
000016   MOVE "AGC" TO contests(3).
000017   MOVE "AHC" TO contests(4).
000018   ACCEPT S(1).
000019   ACCEPT S(2).
000020   ACCEPT S(3).
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL 4 < i
000022     MOVE ZERO TO flg
000023     SET IXS TO 1
000024     SEARCH S
000025       WHEN contests(i) = S(IXS)
000026         MOVE 1 TO flg
000027     END-SEARCH
000028     IF ZERO = flg DISPLAY FUNCTION TRIM(contests(i)) EXIT PERFORM
000029   END-PERFORM.
000030   STOP RUN.

