000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_081_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 D          PIC 9(10).
000008 01 N          PIC 9(3).
000009 01 R          PIC 9(1).
000010 01 cnt        PIC 9(2).
000011 01 cur        PIC 9(4) VALUE 1.
000012 01 i          PIC 9(18) VALUE 1.
000013 01 j          PIC 9(18).
000014 01 k          PIC 9(18).
000015 01 len        PIC 9(4).
000016 01 ln         PIC X(2200).
000017 01 maxlen     PIC 9(3).
000018 01 mn         PIC 9(2).
000019 01 zs         PIC Z(2)9.
000020 
000021 PROCEDURE DIVISION.
000022   ACCEPT N.
000023   ACCEPT ln.
000024   MOVE N TO maxlen.
000025   MOVE 99 TO mn.
000026   PERFORM maxlen TIMES
000027     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000028     END-PERFORM
000029     COMPUTE len = j - cur
000030     MOVE ln(cur:len) TO A
000031     MOVE A TO D
000032     MOVE 0 TO R
000033     MOVE 0 TO cnt
000034     PERFORM UNTIL D = 0 OR R = 1
000035       DIVIDE 2 INTO D GIVING D REMAINDER R
000036       IF R = 0 THEN
000037         ADD 1 TO cnt
000038       END-IF
000039     END-PERFORM
000040     COMPUTE mn = FUNCTION MIN(mn, cnt)
000041     COMPUTE cur = j + 1
000042     ADD 1 TO i
000043   END-PERFORM.
000044   MOVE mn TO zs.
000045   DISPLAY FUNCTION TRIM(zs).
000046   STOP RUN.

