000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_234_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        FLOAT-LONG VALUE -1.
000008 01 cur        FLOAT-LONG.
000009 01 i          PIC 9(10) COMP.
000010 01 j          PIC 9(10) COMP.
000011 01 ln         PIC X(30).
000012 01 xy1.
000013    03 xy      OCCURS 100 DEPENDING N.
000014       05 x    PIC S9(10).
000015       05 y    PIC S9(10).
000016 01 zs         PIC Z(9)9.9(10).
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT N.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000021     ACCEPT ln
000022     UNSTRING ln DELIMITED SPACE INTO x(i) y(i)
000023   END-PERFORM.
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000025     ADD 1 TO i GIVING j
000026     PERFORM VARYING j FROM j BY 1 UNTIL N < j
000027       COMPUTE cur =
000028       FUNCTION SQRT((X(j) - x(i)) ** 2 + (y(j) - y(i)) ** 2)
000029       IF ans < cur MOVE cur TO ans
000030     END-PERFORM
000031   END-PERFORM.
000032   MOVE ans TO zs.
000033   DISPLAY FUNCTION TRIM(zs).
000034   STOP RUN.

