000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_057_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(2).
000007 01 B          PIC 9(2).
000008 01 ans        PIC X(2).
000009 01 ln         PIC X(5).
000010 01 zs         PIC Z(2)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A B.
000015   ADD B TO A.
000016   IF 24 <= A THEN
000017     SUBTRACT 24 FROM A
000018   END-IF.
000019   MOVE A TO zs.
000020   DISPLAY FUNCTION TRIM(zs).
000021   STOP RUN.

