000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_224_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A11.
000007    03 A1      OCCURS 50.
000008       05 A    PIC 9(10) OCCURS 50.
000009 01 H          PIC 9(10).
000010 01 W          PIC 9(10).
000011 01 flg        PIC 9(10) VALUE ZERO.
000012 01 i          PIC 9(10) COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 ln         PIC X(550).
000015 01 pt         PIC S9(10).
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   UNSTRING ln DELIMITED SPACE INTO H W.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000021     MOVE 1 TO pt
000022     ACCEPT ln
000023     PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
000024       UNSTRING ln DELIMITED SPACE INTO A(i j) POINTER pt
000025     END-PERFORM
000026   END-PERFORM.
000027   PERFORM VARYING i FROM 1 BY 1 UNTIL H - 1 < i
000028     PERFORM VARYING j FROM 1 BY 1 UNTIL W - 1 < j
000029       IF A(i + 1 j) + A(i j + 1) < A(i j) + A(i + 1 j + 1)
000030         MOVE 1 TO flg
000031         EXIT PERFORM
000032       END-IF
000033     END-PERFORM
000034     IF 1 = flg EXIT PERFORM END-IF
000035   END-PERFORM.
000036   IF 1 = flg DISPLAY "No" ELSE DISPLAY "Yes".
000037   STOP RUN.

