000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_088_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(3).
000007 01 alice      PIC 9(5) VALUE 0.
000008 01 bob        PIC 9(5) VALUE 0.
000009 01 card1.
000010    03 card11 OCCURS 100 DEPENDING ON N.
000011       05 card PIC 9(3).
000012 01 cur        PIC 9(3) VALUE 1.
000013 01 i          PIC 9(18).
000014 01 j          PIC 9(18).
000015 01 len        PIC 9(3).
000016 01 ln         PIC X(600).
000017 01 q          PIC 9(2).
000018 01 r          PIC 9(1).
000019 01 zs         PIC Z(5)9.
000020 
000021 PROCEDURE DIVISION.
000022   ACCEPT N.
000023   ACCEPT ln.
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000025     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000026     END-PERFORM
000027     COMPUTE len = j - cur
000028     MOVE ln(cur:len) TO card(i)
000029     COMPUTE cur = j + 1
000030   END-PERFORM.
000031   SORT card11 ON DESCENDING KEY card.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000033     DIVIDE 2 INTO i GIVING q REMAINDER r
000034     IF R = 0 THEN
000035       ADD card(i) TO bob
000036     ELSE
000037       ADD card(i) TO alice
000038     END-IF
000039   END-PERFORM.
000040   SUBTRACT bob FROM alice.
000041   MOVE alice TO zs.
000042   DISPLAY FUNCTION TRIM(zs).
000043   STOP RUN.

