000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_116_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 s          PIC 9(10).
000007 01 ret        PIC 9(10).
000008 01 zs         PIC Z(9)9.
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT s.
000012   CALL "COLLATZ" USING BY CONTENT s
000013                        BY REFERENCE ret.
000014   MOVE ret TO zs.
000015   DISPLAY FUNCTION TRIM(zs).
000016   STOP RUN.
000017 END PROGRAM ABC_116_B.
000018 
000019 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. F.
000021 
000022 DATA DIVISION.
000023 WORKING-STORAGE SECTION.
000024 01 D          PIC 9(10).
000025 01 R          PIC 9(10).
000026 
000027 LINKAGE SECTION.
000028 *> (IN)  ai
000029 *> (OUT) ret
000030 01 ai         PIC 9(10).
000031 01 ret        PIC 9(10).
000032 
000033 PROCEDURE DIVISION USING ai ret.
000034   INITIALIZE ret
000035   DIVIDE ai BY 2 GIVING D REMAINDER R
000036   IF ZERO = R
000037     MOVE D TO ret
000038   ELSE
000039     MULTIPLY 3 BY ai GIVING ret
000040     ADD 1 TO ret
000041   END-IF.
000042 END PROGRAM F.
000043 
000044 IDENTIFICATION DIVISION.
000045 PROGRAM-ID. COLLATZ.
000046 
000047 DATA DIVISION.
000048 WORKING-STORAGE SECTION.
000049 01 numan      PIC 9(10).
000050 01 flg        PIC 9(1).
000051 01 aix        PIC 9(10) COMP.
000052 01 an1.
000053    03 an11 OCCURS 100000 INDEXED BY XAN.
000054       05 an   PIC 9(10) VALUE ZERO.
000055 
000056 LINKAGE SECTION.
000057 *> (IN)  ai
000058 *> (OUT) ret
000059 01 ai         PIC 9(10).
000060 01 ret        PIC 9(10).
000061 
000062 PROCEDURE DIVISION USING ai ret.
000063   INITIALIZE ret
000064   SET XAN TO 1
000065   MOVE ai TO an(XAN)
000066   ADD 1 TO XAN
000067   ADD 1 TO numan
000068   PERFORM UNTIL 1 = flg
000069     CALL "F" USING BY CONTENT ai
000070                    BY REFERENCE ret
000071     MOVE ret TO ai
000072     MOVE ZERO TO flg
000073     PERFORM VARYING aix FROM 1 BY 1 UNTIL numan < aix
000074       IF ai = an(aix)
000075         MOVE numan TO ret
000076         ADD 1 TO ret
000077         MOVE 1 TO flg
000078         EXIT PERFORM
000079       END-IF
000080     END-PERFORM
000081     MOVE ai TO an(XAN)
000082     ADD 1 TO XAN
000083     ADD 1 TO numan
000084   END-PERFORM.
000085 END PROGRAM COLLATZ.
