000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_161_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11 OCCURS 100 DEPENDING ON N.
000008       05 A    PIC 9(10) COMP.
000009 01 M          PIC 9(10).
000010 01 N          PIC 9(10).
000011 01 accum      PIC 9(10) VALUE ZERO COMP.
000012 01 ans        PIC 9(10).
000013 01 cur        PIC 9(10) VALUE 1 COMP.
000014 01 i          PIC 9(10) VALUE 1 COMP.
000015 01 j          PIC 9(10) COMP.
000016 01 len        PIC 9(10) COMP.
000017 01 ln         PIC X(500).
000018 01 maxlen     PIC 9(10) VALUE 100 COMP.
000019 01 zs         PIC Z(9)9.
000020 
000021 PROCEDURE DIVISION.
000022   ACCEPT ln.
000023   UNSTRING ln DELIMITED SPACE INTO N M.
000024   MOVE N TO maxlen.
000025   ACCEPT ln.
000026   PERFORM maxlen TIMES
000027     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000028     END-PERFORM
000029     COMPUTE len = j - cur
000030     MOVE ln(cur:len) TO A(i)
000031     ADD A(i) TO accum
000032     COMPUTE cur = j + 1
000033     ADD 1 TO i
000034   END-PERFORM.
000035   SORT A11 DESCENDING A.
000036   IF accum / (4 * M) <= A(M) THEN
000037     DISPLAY "Yes"
000038   ELSE
000039     DISPLAY "No"
000040   END-IF.
000041   STOP RUN.

