000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_027_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 l1         PIC 9(10).
000007 01 l2         PIC 9(10).
000008 01 l3         PIC 9(10).
000009 01 ln         PIC X(30).
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO l1 l2 l3.
000015   IF l1 = l2 THEN
000016     MOVE l3 TO zs
000017   ELSE
000018     IF l2 = l3 THEN
000019       MOVE l1 TO zs
000020     ELSE
000021       MOVE l2 TO zs
000022     END-IF
000023   END-IF.
000024   DISPLAY FUNCTION TRIM(zs).
000025   STOP RUN.

