000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_183_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans        PIC Z(9)9.
000007 01 x          PIC S9(10).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT x.
000011   IF ZERO <= x THEN
000012     MOVE x TO ans
000013   ELSE
000014     MOVE ZERO TO ans
000015   END-IF.
000016   DISPLAY FUNCTION TRIM(ans).
000017   STOP RUN.

