000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_262_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 M          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 UV2.
000009    03 UV1     OCCURS 100.
000010       05 UV   PIC 9(1) VALUE ZERO OCCURS 100.
000011 01 ans        PIC 9(10) VALUE ZERO.
000012 01 i          PIC 9(10) COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 k          PIC 9(10) COMP.
000015 01 ln         PIC X(400).
000016 01 uidx       PIC 9(10).
000017 01 vidx       PIC 9(10).
000018 01 zs         PIC Z(9)9.
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT ln.
000022   UNSTRING ln DELIMITED SPACE INTO N M.
000023   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000024     ACCEPT ln
000025     UNSTRING ln DELIMITED SPACE INTO uidx vidx
000026     MOVE 1 TO UV(uidx vidx)
000027     MOVE 1 TO UV(vidx uidx)
000028   END-PERFORM.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000030     ADD 1 TO i GIVING j
000031     PERFORM VARYING j FROM j BY 1 UNTIL N < j
000032       ADD 1 TO j GIVING k
000033       PERFORM VARYING k FROM k BY 1 UNTIL N < k
000034         IF 1 = UV(i j) AND UV(j k) AND UV(k i) ADD 1 TO ans
000035       END-PERFORM
000036     END-PERFORM
000037   END-PERFORM.
000038   MOVE ans TO zs.
000039   DISPLAY FUNCTION TRIM(zs).
000040   STOP RUN.

