000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_185_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1         PIC 9(10).
000007 01 A2         PIC 9(10).
000008 01 A3         PIC 9(10).
000009 01 A4         PIC 9(10).
000010 01 ans        PIC Z(9)9.
000011 01 ln         PIC X(30).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO A1 A2 A3 A4.
000016   COMPUTE ans = FUNCTION MIN(A1 A2 A3 A4).
000017   DISPLAY FUNCTION TRIM(ans).
000018   STOP RUN.

