000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_139_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 ans        PIC 9(10) VALUE ZERO COMP.
000009 01 cur        PIC 9(10) VALUE 1 COMP.
000010 01 ln         PIC X(30).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO A B.
000016   PERFORM UNTIL B <= cur
000017     ADD 1 TO ans
000018     COMPUTE cur = cur + A - 1
000019   END-PERFORM.
000020   MOVE ans TO zs.
000021   DISPLAY FUNCTION TRIM(zs).
000022   STOP RUN.

