000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_094_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ABX1.
000007    03 ABX11 OCCURS 3.
000008       05 ABX  PIC S9(8).
000009 01 cur        PIC 9(2) VALUE 1.
000010 01 i          PIC 9(18) VALUE 1.
000011 01 j          PIC 9(18).
000012 01 len        PIC 9(2).
000013 01 ln         PIC X(10).
000014 01 maxlen     PIC 9(1) VALUE 3.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT ln.
000018   PERFORM maxlen TIMES
000019     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000020     END-PERFORM
000021     COMPUTE len = j - cur
000022     MOVE ln(cur:len) TO ABX(i)
000023     COMPUTE cur = j + 1
000024     ADD 1 TO i
000025   END-PERFORM.
000026   IF ABX(1) <= ABX(3) AND ABX(3) <= ABX(1) + ABX(2) THEN
000027     DISPLAY "YES";
000028   ELSE
000029     DISPLAY "NO";
000030   END-IF.
000031   STOP RUN.

