000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_198_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        PIC Z(9)9.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT N.
000011   IF ZERO = N - 1 MOVE ZERO TO ans ELSE COMPUTE ans = N - 1.
000012   DISPLAY FUNCTION TRIM(ans).
000013   STOP RUN.

