000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_056_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(6).
000007 01 b          PIC 9(6).
000008 01 ln         PIC X(20).
000009 01 tmp        PIC 9(6).
000010 01 W          PIC 9(6).
000011 01 zs         PIC Z(6)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO W a b.
000016   IF b < a THEN
000017     MOVE b TO tmp
000018     MOVE a TO b
000019     MOVE tmp TO a
000020   END-IF.
000021   ADD W TO a.
000022   IF b < a THEN
000023     DISPLAY ZERO
000024   ELSE
000025     SUBTRACT a FROM b
000026     MOVE b TO zs
000027     DISPLAY FUNCTION TRIM(zs)
000028   END-IF.
000029   STOP RUN.

