000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_107_C.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012    01 INDATA  PIC X(1100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 ln         PIC X(1100000).
000016 01 INF        PIC 9(10) VALUE 1000000007.
000017 01 N          PIC 9(10).
000018 01 K          PIC 9(10).
000019 01 maxlen     PIC 9(10).
000020 01 cur        PIC 9(10) VALUE 1.
000021 01 i          PIC 9(10) VALUE 1.
000022 01 j          PIC 9(10).
000023 01 len        PIC 9(10).
000024 01 tmp        PIC 9(10).
000025 01 x1.
000026    03 x11 OCCURS 100000 DEPENDING ON maxlen INDEXED XX1 XX2.
000027       05 x    PIC S9(10).
000028       05 y    PIC 9(10).
000029 01 t          PIC 9(10).
000030 01 flg        PIC 9(1).
000031 01 ans        PIC 9(10).
000032 01 ZS         PIC Z(9)9.
000033 
000034 PROCEDURE DIVISION.
000035   OPEN INPUT SYSIN.
000036   READ SYSIN INTO ln.
000037   UNSTRING ln DELIMITED BY SPACE INTO N K.
000038   READ SYSIN INTO ln.
000039   CLOSE SYSIN.
000040 
000041   MOVE N TO maxlen.
000042 
000043   PERFORM maxlen TIMES
000044     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000045     END-PERFORM
000046     COMPUTE len = j - cur
000047     SET XX1 TO i
000048     IF ln(cur:1) NOT = "-"
000049         MOVE ln(cur:len) TO x(XX1)
000050         MOVE x(XX1) TO y(XX1)
000051     ELSE
000052         ADD 1 TO cur
000053         SUBTRACT 1 FROM len
000054         MOVE ln(cur:len) TO x(XX1)
000055         COMPUTE x(XX1) = -x(XX1)
000056         MOVE x(XX1) TO y(XX1)
000057     END-IF
000058     COMPUTE cur = j + 1
000059     ADD 1 TO i
000060   END-PERFORM.
000061 
000062   MOVE ZERO TO flg.
000063 
000064   SET XX1 TO 1.
000065   SET XX2 TO K.
000066 
000067   IF ZERO <= x(XX1)
000068     MOVE y(XX2) TO ans
000069     MOVE 1 TO flg
000070   END-IF.
000071 
000072   COMPUTE tmp = N - K + 1.
000073 
000074   SET XX1 TO N.
000075   SET XX2 TO tmp.
000076 
000077   IF x(XX1) <= ZERO
000078     MOVE y(XX2) TO ans
000079     MOVE 1 TO flg
000080   END-IF.
000081 
000082   IF ZERO = flg
000083     MOVE INF TO ans
000084     PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000085       COMPUTE tmp = i + K - 1
000086       IF N < tmp
000087         EXIT PERFORM
000088       END-IF
000089       SET XX1 TO i
000090       SET XX2 TO tmp
000091 
000092       IF x(XX1) <= ZERO
000093         IF ZERO <= x(XX2)
000094           IF y(XX1) <= y(XX2)
000095             COMPUTE t = y(XX1) * 2 + y(XX2)
000096           ELSE
000097             COMPUTE t = y(XX1) + y(XX2) * 2
000098           END-IF
000099           IF t < ans
000100             MOVE t TO ans
000101           END-IF
000102         ELSE
000103           COMPUTE tmp = i + K
000104           SET XX2 TO tmp
000105           IF tmp <= N AND ZERO < x(XX2)
000106             MOVE y(XX1) TO t
000107             IF t < ans
000108               MOVE t TO ans
000109             END-IF
000110           END-IF
000111         END-IF
000112       ELSE
000113         COMPUTE tmp = i - 1
000114         SET XX1 TO tmp
000115         IF x(XX1) < ZERO
000116           MOVE y(XX2) TO t
000117           IF t < ans
000118             MOVE t TO ans
000119           END-IF
000120         END-IF
000121       END-IF
000122     END-PERFORM
000123   END-IF
000124 
000125   MOVE ans TO ZS.
000126   DISPLAY FUNCTION TRIM(ZS).
000127   STOP RUN.

