000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_143_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 ans        PIC 9(10).
000009 01 ln         PIC X(30).
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A B.
000015   IF 2 * B < A THEN
000016     COMPUTE ans = A - 2 * B
000017     MOVE ans TO zs
000018     DISPLAY FUNCTION TRIM(zs)
000019   ELSE
000020     DISPLAY 0
000021   END-IF.
000022   STOP RUN.

