000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_066_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(200).
000007 01 flg        PIC 9(1).
000008 01 i          PIC 9(3).
000009 01 ini        PIC 9(3).
000010 01 j          PIC 9(3).
000011 01 k          PIC 9(3).
000012 01 l          PIC 9(3).
000013 01 len        PIC 9(3).
000014 01 len2       PIC 9(3).
000015 01 zs         PIC Z(4).
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT S.
000019   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
000020   SUBTRACT 1 FROM len GIVING l.
000021   PERFORM VARYING i FROM l BY -1 UNTIL i = 1
000022     MOVE 1 TO FLG
000023     IF FUNCTION MOD(i, 2) = 1 THEN
000024       MOVE 0 TO flg
000025     ELSE
000026       MOVE i TO k
000027       DIVIDE 2 INTO k GIVING ini
000028       MOVE ini TO len2
000029       ADD 1 TO ini
000030       IF S(1:len2) NOT = S(ini:len2) THEN
000031         MOVE 0 TO flg
000032       END-IF
000033     END-IF
000034     IF flg = 1 THEN
000035       EXIT PERFORM
000036     END-IF
000037   END-PERFORM.
000038   MOVE i TO zs.
000039   DISPLAY FUNCTION TRIM(zs).
000040   STOP RUN.

