000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_080_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 D          PIC 9(9).
000008 01 N          PIC 9(9).
000009 01 R          PIC 9(1).
000010 01 harshad    PIC 9(2).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   MOVE N TO D.
000015   MOVE 0 TO harshad.
000016   PERFORM UNTIL D = 0 DIVIDE 10 INTO D GIVING D REMAINDER R
000017     ADD R TO harshad
000018   END-PERFORM.
000019   DIVIDE harshad INTO N GIVING D REMAINDER R.
000020   IF R = 0 THEN
000021     DISPLAY "Yes"
000022   ELSE
000023     DISPLAY "No"
000024   END-IF.
000025   STOP RUN.

