000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_009_A.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(100).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A1.
000016    03 A       PIC S9(10) OCCURS 100 DEPENDING ON N INDEXED IXA.
000017 01 N          PIC 9(10).
000018 01 cur        PIC 9(10).
000019 01 flg        PIC 9(1).
000020 01 i          PIC 9(10) COMP.
000021 01 j          PIC 9(10) VALUE 1 COMP.
000022 01 zs         PIC Z(9)9.
000023 
000024 PROCEDURE DIVISION.
000025   OPEN INPUT SYSIN.
000026   READ SYSIN INTO N.
000027   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000028     READ SYSIN INTO cur
000029     MOVE ZERO TO flg
000030     SET IXA TO 1
000031     SEARCH A
000032       AT END
000033         CONTINUE
000034       WHEN cur = A(IXA)
000035         MOVE 1 TO flg
000036       WHEN ZERO = A(IXA)
000037         MOVE ZERO TO flg
000038     END-SEARCH
000039     IF ZERO = flg
000040       MOVE cur TO A(j)
000041       ADD 1 TO j
000042     END-IF
000043   END-PERFORM.
000044   CLOSE SYSIN.
000045   SORT A DESCENDING A.
000046   MOVE A(2) TO zs.
000047   DISPLAY FUNCTION TRIM(zs).
000048   STOP RUN.

