000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_132_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(30).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT S.
000010   IF S(1:1) = S(2:1) AND S(2:1) <> S(3:1) AND S(3:1) = S(4:1)
000011     DISPLAY "Yes"
000012   ELSE
000013     IF S(1:1) = S(3:1) AND S(2:1) <> S(3:1) AND S(2:1) = S(4:1)
000014       DISPLAY "Yes"
000015     ELSE
000016       IF S(1:1) = S(4:1) AND S(1:1) <> S(2:1) AND S(2:1) = S(3:1)
000017         DISPLAY "Yes"
000018       ELSE
000019         DISPLAY "No"
000020       END-IF
000021     END-IF
000022   END-IF.
000023   STOP RUN.

