000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_043_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(3).
000007 01 tmp        PIC 9(4).
000008 01 zs         PIC Z(5).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT N.
000012   COMPUTE tmp = N * (N + 1) / 2.
000013   MOVE tmp TO zs.
000014   DISPLAY FUNCTION TRIM(zs).
000015   STOP RUN.

