000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_232_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA PIC X(100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 S         PIC X(100000).
000016 01 T         PIC X(100000).
000017 01 K         PIC S9(10).
000018 01 diff      PIC S9(10).
000019 01 flg       PIC 9(1) VALUE ZERO.
000020 01 i         PIC 9(10) COMP.
000021 01 len       PIC 9(10).
000022 01 num       PIC 9(10).
000023 01 zs        PIC Z(9)9.
000024 
000025 PROCEDURE DIVISION.
000026   OPEN INPUT SYSIN.
000027   READ SYSIN INTO S.
000028   READ SYSIN INTO T.
000029   CLOSE SYSIN.
000030   COMPUTE num = FUNCTION ORD("z") - FUNCTION ORD("a") + 1.
000031   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
000032   COMPUTE K = FUNCTION ORD(T(1:1)) - FUNCTION ORD(S(1:1)).
000033   IF K < ZERO ADD num TO K.
000034   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000035     COMPUTE diff = FUNCTION ORD(T(i:1)) - FUNCTION ORD(S(i:1))
000036     IF diff < ZERO ADD num TO diff END-IF
000037     IF K NOT = diff MOVE 1 TO flg
000038   END-PERFORM.
000039   IF ZERO = flg DISPLAY "Yes" ELSE DISPLAY "No".
000040   STOP RUN.

