000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_137_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC S9(10).
000007 01 B          PIC S9(10).
000008 01 ans        PIC S9(10).
000009 01 ln         PIC X(30).
000010 01 zs         PIC -Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A B.
000015   COMPUTE ans = FUNCTION MAX(A + B, A - B, A * B).
000016   MOVE ans TO zs.
000017   DISPLAY FUNCTION TRIM(zs).
000018   STOP RUN.

