000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_140_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11 OCCURS 100 DEPENDING ON N.
000008       05 A    PIC S9(10).
000009 01 B1.
000010    03 B11 OCCURS 100 DEPENDING ON N.
000011       05 B    PIC S9(10).
000012 01 C1.
000013    03 C11 OCCURS 100 DEPENDING ON num.
000014       05 C    PIC S9(10).
000015 01 N          PIC 9(10).
000016 01 ans        PIC 9(10).
000017 01 cur        PIC 9(10) VALUE 1 COMP.
000018 01 i          PIC 9(10) VALUE 1 COMP.
000019 01 j          PIC 9(10) COMP.
000020 01 len        PIC 9(10) COMP.
000021 01 ln         PIC X(400).
000022 01 maxlen     PIC 9(10) VALUE 100 COMP.
000023 01 num        PIC 9(10).
000024 01 zs         PIC Z(9)9.
000025 
000026 PROCEDURE DIVISION.
000027   ACCEPT N.
000028   ACCEPT ln.
000029   MOVE N TO maxlen.
000030   COMPUTE num = N - 1.
000031   PERFORM maxlen TIMES
000032     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000033     END-PERFORM
000034     COMPUTE len = j - cur
000035     MOVE ln(cur:len) TO A(i)
000036     COMPUTE cur = j + 1
000037     ADD 1 TO i
000038   END-PERFORM.
000039   ACCEPT ln.
000040   MOVE 1 TO cur.
000041   MOVE 1 TO i.
000042   PERFORM maxlen TIMES
000043     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000044     END-PERFORM
000045     COMPUTE len = j - cur
000046     MOVE ln(cur:len) TO B(i)
000047     COMPUTE ans = ans + B(i)
000048     COMPUTE cur = j + 1
000049     ADD 1 TO i
000050   END-PERFORM.
000051   ACCEPT ln.
000052   MOVE num TO maxlen.
000053   MOVE 1 TO cur.
000054   MOVE 1 TO i.
000055   PERFORM maxlen TIMES
000056     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000057     END-PERFORM
000058     COMPUTE len = j - cur
000059     MOVE ln(cur:len) TO C(i)
000060     COMPUTE cur = j + 1
000061     ADD 1 TO i
000062   END-PERFORM.
000063   MOVE N TO maxlen.
000064   MOVE 1 TO cur.
000065   MOVE 1 TO i.
000066   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000067     IF 1 < i
000068       IF A(i - 1) + 1 = A(i)
000069         COMPUTE ans = ans + C(A(i - 1))
000070       END-IF
000071     END-IF
000072   END-PERFORM.
000073   MOVE ans TO zs.
000074   DISPLAY FUNCTION TRIM(zs).
000075   STOP RUN.

