000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_220_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A         PIC 9(10).
000007 01 B         PIC 9(10).
000008 01 C         PIC 9(10).
000009 01 d         PIC 9(10).
000010 01 ln        PIC X(30).
000011 01 r         PIC 9(10).
000012 01 zs        PIC -(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO A B C.
000017   DIVIDE A BY C GIVING d REMAINDER r.
000018   IF ZERO = r MOVE A TO zs
000019   ELSE IF A <= A + C - r AND A + C - r <= B
000020     COMPUTE zs = A + C - r
000021   ELSE MOVE -1 TO zs.
000022   DISPLAY FUNCTION TRIM(zs).
000023   STOP RUN.

