000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_178_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC S9(10).
000007 01 ans        PIC S9(20).
000008 01 b          PIC S9(10).
000009 01 c          PIC S9(10).
000010 01 d          PIC S9(10).
000011 01 ln         PIC X(50).
000012 01 zs         PIC -(19)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO a b c d.
000017   IF a * c < a * d THEN
000018     COMPUTE ans = a * d
000019   ELSE
000020     COMPUTE ans = a * c
000021   END-IF.
000022   IF ans < b * c THEN
000023     COMPUTE ans = b * c
000024   END-IF.
000025   IF ans < b * d THEN
000026     COMPUTE ans = b * d
000027   END-IF.
000028   MOVE ans TO zs.
000029   DISPLAY FUNCTION TRIM(zs).
000030   STOP RUN.

