000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_100_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 DN1.
000007    03 DN11 OCCURS 2.
000008       05 DN   PIC 9(7).
000009 01 ans        PIC Z(6)9.
000010 01 cur        PIC 9(2) VALUE 1.
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(2).
000014 01 ln         PIC X(10).
000015 01 maxlen     PIC 9(1) VALUE 2.
000016 01 tmp        PIC 9(7).
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   PERFORM maxlen TIMES
000021     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000022     END-PERFORM
000023     COMPUTE len = j - cur
000024     MOVE ln(cur:len) TO DN(i)
000025     COMPUTE cur = j + 1
000026     ADD 1 TO i
000027   END-PERFORM.
000028   IF DN(2) = 100 THEN
000029     ADD 1 TO DN(2)
000030   END-IF.
000031   COMPUTE tmp = 100 ** DN(1) * DN(2);
000032   MOVE tmp TO ans.
000033   DISPLAY FUNCTION TRIM(ans).
000034   STOP RUN.

