000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_004_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        PIC X(7).
000008 01 c1.
000009    03 c11     OCCURS 4.
000010       05 c    PIC X(1) OCCURS 4.
000011 01 cur        PIC 9(10) COMP.
000012 01 i          PIC 9(10) COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 k          PIC 9(10) COMP.
000015 01 l          PIC 9(10) COMP.
000016 01 len        PIC 9(10) COMP.
000017 01 ln         PIC X(400).
000018 01 x1         PIC X(1).
000019 01 x2         PIC X(1).
000020 01 x3         PIC X(1).
000021 01 x4         PIC X(1).
000022 01 y1         PIC X(1).
000023 01 y2         PIC X(1).
000024 01 y3         PIC X(1).
000025 01 y4         PIC X(1).
000026 
000027 PROCEDURE DIVISION.
000028   PERFORM VARYING l FROM 1 BY 1 UNTIL 4 < l
000029     ACCEPT ln
000030     MOVE 1 TO cur
000031     MOVE 1 TO i
000032     PERFORM VARYING k FROM 1 BY 1 UNTIL 4 < k
000033       PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000034       END-PERFORM
000035       COMPUTE len = j - cur
000036       MOVE ln(cur:len) TO c(l k)
000037       COMPUTE cur = j + 1
000038       ADD 1 TO i
000039     END-PERFORM
000040   END-PERFORM.
000041   PERFORM VARYING i FROM 1 BY 1 UNTIL 2 < i
000042     MOVE c(i 1) TO x1
000043     MOVE c(i 2) TO x2
000044     MOVE c(i 3) TO x3
000045     MOVE c(i 4) TO x4
000046     MOVE c(4 - i + 1 1) TO y1
000047     MOVE c(4 - i + 1 2) TO y2
000048     MOVE c(4 - i + 1 3) TO y3
000049     MOVE c(4 - i + 1 4) TO y4
000050     MOVE x4 TO c(4 - i + 1 1)
000051     MOVE x3 TO c(4 - i + 1 2)
000052     MOVE x2 TO c(4 - i + 1 3)
000053     MOVE x1 TO c(4 - i + 1 4)
000054     MOVE y4 TO c(i 1)
000055     MOVE y3 TO c(i 2)
000056     MOVE y2 TO c(i 3)
000057     MOVE y1 TO c(i 4)
000058   END-PERFORM.
000059   PERFORM VARYING i FROM 1 BY 1 UNTIL 4 < i
000060     STRING
000061       c(i 1)
000062       SPACE
000063       c(i 2)
000064       SPACE
000065       c(i 3)
000066       SPACE
000067       c(i 4)
000068       INTO ans
000069     END-STRING
000070     DISPLAY ans
000071   END-PERFORM.
000072   STOP RUN.

