000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_100_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 AB1.
000007    03 AB11 OCCURS 2.
000008       05 AB   PIC S9(8).
000009 01 ans        PIC -(8)9.
000010 01 cur        PIC 9(2) VALUE 1.
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(2).
000014 01 ln         PIC X(6).
000015 01 maxlen     PIC 9(1) VALUE 2.
000016 01 n          PIC X(2) VALUE ":(".
000017 01 y          PIC X(4) VALUE "Yay!".
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT ln.
000021   PERFORM maxlen TIMES
000022     PERFORM VARYING j FROM cur BY 1
000023       UNTIL ln(j:1) = SPACE
000024     END-PERFORM
000025     COMPUTE len = j - cur
000026     MOVE ln(cur:len) TO AB(i)
000027     COMPUTE cur = j + 1
000028     ADD 1 TO i
000029   END-PERFORM.
000030   IF AB(1) <= 8 AND AB(2) <= 8 THEN
000031     DISPLAY y;
000032   ELSE
000033     DISPLAY n;
000034   END-IF.
000035   STOP RUN.

