000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_137_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 K          PIC S9(10).
000007 01 X          PIC S9(10).
000008 01 ans        PIC X(30).
000009 01 ed         PIC S9(10).
000010 01 i          PIC S9(10).
000011 01 ln         PIC X(30).
000012 01 nl         PIC 9(10) VALUE ZERO.
000013 01 sp         PIC 9(10) VALUE ZERO.
000014 01 st         PIC S9(10).
000015 01 zs         PIC -Z(9)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   UNSTRING ln DELIMITED BY SPACE INTO K X.
000020   COMPUTE st = X - K + 1.
000021   COMPUTE ed = X + K - 1.
000022   MOVE st TO i.
000023   IF K = 1
000024     MOVE 1 TO nl
000025     PERFORM DISP
000026     STOP RUN
000027   ELSE
000028     PERFORM DISP
000029   END-IF.
000030   MOVE 1 TO sp.
000031   ADD 1 TO st.
000032   PERFORM VARYING i FROM st BY 1 UNTIL ed <= i
000033     PERFORM DISP
000034   END-PERFORM.
000035   MOVE 1 TO nl.
000036   PERFORM DISP.
000037   STOP RUN.
000038 
000039 DISP SECTION.
000040     MOVE i TO zs.
000041     IF ZERO <> sp
000042       DISPLAY SPACE WITH NO ADVANCING
000043     END-IF.
000044     IF ZERO <> i
000045       IF ZERO <> nl
000046         DISPLAY FUNCTION TRIM(zs)
000047       ELSE
000048         DISPLAY FUNCTION TRIM(zs) WITH NO ADVANCING
000049       END-IF
000050     ELSE
000051       IF ZERO <> nl
000052         DISPLAY ZERO
000053       ELSE
000054         DISPLAY ZERO WITH NO ADVANCING
000055       END-IF
000056     END-IF.

