000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_058_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 E          PIC X(50).
000007 01 O          PIC X(50).
000008 01 ans        PIC X(100).
000009 01 i          PIC 9(2).
000010 01 len        PIC 9(2).
000011 
000012 PROCEDURE DIVISION.
000013     ACCEPT O.
000014     ACCEPT E.
000015     COMPUTE len = FUNCTION STORED-CHAR-LENGTH(O).
000016     PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000017         STRING
000018             ans(1:FUNCTION STORED-CHAR-LENGTH(ans))
000019             O(i:1)
000020             E(i:1)
000021             INTO ans
000022         END-STRING
000023     END-PERFORM.
000024 
000025     DISPLAY FUNCTION TRIM(ans).
000026     STOP RUN.

