000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_198_B.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC X(10).
000007 01 flg        PIC 9(1) VALUE 1.
000008 01 half       PIC 9(10).
000009 01 i          PIC 9(10) COMP.
000010 01 len        PIC 9(10).
000011
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   MOVE FUNCTION STORED-CHAR-LENGTH(N) TO len.
000015   PERFORM VARYING i FROM len BY -1 UNTIL N(i:1) NOT = ZERO
000016     MOVE SPACE TO N(i:1)
000017   END-PERFORM.
000018   MOVE FUNCTION STORED-CHAR-LENGTH(N) TO len.
000019   DIVIDE len BY 2 GIVING half.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000021     IF N(i:1) NOT = N(len - i + 1:1) MOVE ZERO TO flg
000022     EXIT PERFORM
000023   END-PERFORM.
000024   IF 1 = flg DISPLAY "Yes" ELSE DISPLAY "No".
000025   STOP RUN.

