000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_071_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(100000).
000007 01 alpha      PIC X(26) VALUE "abcdefghijklmnopqrstuvwxyz".
000008 01 f1.
000009    03 f11 OCCURS 26.
000010       05 f    PIC 9(1) VALUE ZERO.
000011 01 i          PIC 9(6).
000012 01 j          PIC 9(6).
000013 01 maxlen     PIC 9(2) VALUE 26.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT S.
000017   PERFORM VARYING i FROM 1 BY 1 UNTIL S(i:1) = SPACE
000018     PERFORM VARYING j FROM 1 BY 1 UNTIL maxlen < j
000019       IF S(i:1) = alpha(j:1) THEN
000020         MOVE 1 TO f(j)
000021       END-IF
000022     END-PERFORM
000023   END-PERFORM
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL maxlen < i
000025     IF f(i) = ZERO THEN
000026       DISPLAY alpha(i:1)
000027       EXIT PERFORM
000028     ELSE
000029       IF i = maxlen THEN
000030         DISPLAY "None"
000031       END-IF
000032     END-IF
000033   END-PERFORM
000034   STOP RUN.

