000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_069_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(7).
000007 01 m          PIC 9(3).
000008 01 n          PIC 9(3).
000009 01 tmp        PIC 9(4).
000010 01 zs         PIC Z(5).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO n m.
000015   SUBTRACT 1 FROM n.
000016   SUBTRACT 1 FROM m.
000017   MULTIPLY n BY m GIVING tmp.
000018   MOVE tmp TO ZS.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

