000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_148_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 S          PIC X(100).
000008 01 T          PIC X(100).
000009 01 ans        PIC X(200).
000010 01 cur        PIC 9(10) VALUE 1 COMP.
000011 01 i          PIC 9(10) VALUE 1 COMP.
000012 01 j          PIC 9(10) COMP.
000013 01 len        PIC 9(10) COMP.
000014 01 ln         PIC X(400).
000015 01 maxlen     PIC 9(10) VALUE 100 COMP.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT N.
000019   ACCEPT ln.
000020   UNSTRING ln DELIMITED BY SPACE INTO S T.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000022     STRING ans S(i : 1) T(i : 1) DELIMITED BY SPACE INTO ans
000023   END-PERFORM.
000024   DISPLAY FUNCTION TRIM(ans).
000025   STOP RUN.

