000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_058_A.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC S9(3).
000007 01 b          PIC S9(3).
000008 01 c          PIC S9(3).
000009 01 ln         PIC X(11).
000010
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO a b c.
000014   IF b - a = c - b THEN
000015     DISPLAY "YES"
000016   ELSE
000017     DISPLAY "NO"
000018   END-IF.
000019   STOP RUN.

