000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_179_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D1         PIC 9(10).
000007 01 D2         PIC 9(10).
000008 01 N          PIC 9(10).
000009 01 cnt        PIC 9(10) VALUE ZERO.
000010 01 i          PIC 9(10) COMP.
000011 01 ln         PIC X(30).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT N.
000015   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i OR 3 <= cnt
000016     ACCEPT ln
000017     UNSTRING ln DELIMITED BY SPACE INTO D1 D2
000018     IF D1 = D2 THEN
000019       ADD 1 TO cnt
000020     ELSE
000021       MOVE ZERO TO cnt
000022     END-IF
000023   END-PERFORM.
000024   IF 3 <= cnt THEN
000025     DISPLAY "Yes"
000026   ELSE
000027     DISPLAY "No"
000028   END-IF.
000029   STOP RUN.

