000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_149_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(100).
000007 01 T          PIC X(100).
000008 01 ans        PIC X(200).
000009 01 ln         PIC X(300).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO S T.
000014   STRING FUNCTION TRIM(T) FUNCTION TRIM(S) INTO ans.
000015   DISPLAY FUNCTION TRIM(ans).
000016   STOP RUN.

