000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_164_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC 9(10).
000007 01 W          PIC 9(10).
000008 01 ln         PIC X(30).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT ln.
000012   UNSTRING ln DELIMITED SPACE INTO S W.
000013   IF W < S
000014     DISPLAY "safe"
000015   ELSE
000016     DISPLAY "unsafe"
000017   END-IF.
000018   STOP RUN.

