000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_087_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(4).
000007 01 B          PIC 9(4).
000008 01 D          PIC 9(3).
000009 01 R          PIC 9(3).
000010 01 X          PIC 9(5).
000011 01 zs         PIC Z(3)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT X.
000015   ACCEPT A.
000016   ACCEPT B.
000017   SUBTRACT A FROM X.
000018   DIVIDE B INTO X GIVING D REMAINDER R.
000019   MOVE R TO zs.
000020   DISPLAY FUNCTION TRIM(zs).
000021   STOP RUN.

