000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_216_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X         PIC 9(10).
000007 01 Y         PIC 9(10).
000008 01 ln        PIC X(30).
000009 01 zs        PIC Z(9)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED "." INTO X Y.
000014   MOVE X TO zs.
000015   IF ZERO <= Y AND Y <= 2
000016     DISPLAY FUNCTION TRIM(zs) "-"
000017   ELSE IF 3 <= Y AND Y <= 6
000018     DISPLAY FUNCTION TRIM(zs)
000019   ELSE
000020     DISPLAY FUNCTION TRIM(zs) "+"
000021   END-IF.
000022   STOP RUN.

