000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_258_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 HH         PIC 9(2) VALUE 21.
000007 01 K          PIC 9(10).
000008 01 MM         PIC 9(2) VALUE ZERO.
000009 01 q          PIC 9(10).
000010 01 r          PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT K.
000014   DIVIDE K BY 60 GIVING q REMAINDER r.
000015   ADD q TO HH.
000016   ADD r TO MM.
000017   DISPLAY HH ":" MM.
000018   STOP RUN.

