000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_110_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 maxlen     PIC 9(10) VALUE 100 COMP.
000008 01 cur        PIC 9(10) VALUE 1 COMP.
000009 01 i          PIC 9(10) VALUE 1 COMP.
000010 01 j          PIC 9(10) COMP.
000011 01 len        PIC 9(10) COMP.
000012 01 ans        PIC 9(10).
000013 01 zs         PIC Z(9)9.
000014 01 ABC1.
000015    03 ABC11 OCCURS 3.
000016       05 ABC  PIC S9(10).
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   PERFORM 3 TIMES
000021     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000022     END-PERFORM
000023     COMPUTE len = j - cur
000024     MOVE ln(cur:len) TO ABC(i)
000025     COMPUTE cur = j + 1
000026     ADD 1 TO i
000027   END-PERFORM.
000028   SORT ABC11 ON DESCENDING ABC.
000029   COMPUTE ans = ABC(1) * 10 + ABC(2) + ABC(3).
000030   MOVE ans TO zs.
000031   DISPLAY FUNCTION TRIM(zs).
000032   STOP RUN.
