000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_257_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 X          PIC 9(10).
000008 01 ln         PIC X(30).
000009 01 q          PIC 9(10).
000010 01 r          PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED SPACE INTO N X.
000015   DIVIDE X BY N GIVING q REMAINDER r.
000016   IF r = 0
000017     DISPLAY FUNCTION CHAR(FUNCTION ORD("A") + q - 1)
000018   ELSE
000019     DISPLAY FUNCTION CHAR(FUNCTION ORD("A") + q).
000020   STOP RUN.

