000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_269_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC Z(9)9.
000007 01 B          PIC Z(9)9.
000008 01 C          PIC Z(9)9.
000009 01 D          PIC Z(9)9.
000010 01 S1.
000011    03 S       PIC X(10) OCCURS 10.
000012 01 h          PIC S9(1).
000013 01 i          PIC 9(10) COMP.
000014 01 j          PIC 9(10) COMP.
000015 01 v          PIC S9(1).
000016 
000017 PROCEDURE DIVISION.
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL 10 < i
000019     ACCEPT S(i)
000020   END-PERFORM.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL 10 < i
000022     PERFORM VARYING j FROM 1 BY 1 UNTIL 10 < j
000023       IF "#" = S(i)(j:1)
000024         IF v = 0 MOVE i TO A MOVE 1 TO v END-IF
000025         IF h = 0 MOVE j TO C MOVE 1 TO h END-IF
000026       ELSE
000027         IF h = 1
000028           SUBTRACT 1 FROM j GIVING D
000029           MOVE -1 TO h
000030         END-IF
000031       END-IF
000032     END-PERFORM
000033     IF v = 1 AND "." = S(i)(FUNCTION NUMVAL(C):1)
000034       SUBTRACT 1 FROM i GIVING B
000035       MOVE -1 TO v
000036     END-IF
000037     IF h = 1 SUBTRACT 1 FROM j GIVING D
000038       MOVE -1 TO h
000039     END-IF
000040   END-PERFORM.
000041   IF v = 1 SUBTRACT 1 FROM i GIVING B.
000042   DISPLAY FUNCTION TRIM(A) SPACE FUNCTION TRIM(B).
000043   DISPLAY FUNCTION TRIM(C) SPACE FUNCTION TRIM(D).
000044   STOP RUN.

