000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_074_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 K          PIC 9(3).
000007 01 N          PIC 9(3).
000008 01 ans        PIC X(5).
000009 01 cur        PIC 9(3) VALUE 1.
000010 01 i          PIC 9(18) VALUE 1.
000011 01 j          PIC 9(18).
000012 01 len        PIC 9(3).
000013 01 ln         PIC X(300).
000014 01 maxlen     PIC 9(3).
000015 01 sm         PIC 9(5) VALUE 0.
000016 01 x          PIC 9(3).
000017 01 zs         PIC Z(6).
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT N.
000021   ACCEPT K.
000022   ACCEPT ln.
000023   MOVE N TO maxlen.
000024   PERFORM maxlen TIMES
000025     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000026     END-PERFORM
000027     COMPUTE len = j - cur
000028     MOVE ln(cur:len) TO x
000029     COMPUTE x = FUNCTION MIN(x, K - x)
000030     MULTIPLY 2 BY x
000031     ADD x TO sm
000032     COMPUTE cur = j + 1
000033     ADD 1 TO i
000034   END-PERFORM.
000035   MOVE sm TO zs.
000036   DISPLAY FUNCTION TRIM(zs).
000037   STOP RUN.

