000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_200_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 K         PIC 9(10).
000007 01 N         PIC 9(10).
000008 01 ans       BINARY-DOUBLE.
000009 01 d         BINARY-DOUBLE.
000010 01 i         PIC 9(10) COMP.
000011 01 ln        PIC X(30).
000012 01 r         BINARY-DOUBLE.
000013 01 zs        PIC Z(19)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED SPACE INTO N K.
000018   MOVE N TO ans.
000019   PERFORM VARYING i FROM 1 BY 1 UNTIL K < i
000020     DIVIDE ans BY 200 GIVING d REMAINDER r
000021     IF ZERO < r COMPUTE ans = ans * 1000 + 200
000022     ELSE MOVE d TO ans
000023   END-PERFORM.
000024   MOVE ans TO zs.
000025   DISPLAY FUNCTION TRIM(zs).
000026   STOP RUN.

