000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_007_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 n          PIC 9(10).
000007 01 zs         PIC Z(9)9.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT n.
000011   SUBTRACT 1 FROM n.
000012   MOVE n TO zs.
000013   DISPLAY FUNCTION TRIM(zs).
000014   STOP RUN.

