000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_042_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ABC1.
000007    03 ABC11 OCCURS 3.
000008       05 ABC  PIC 9(2).
000009 01 cur        PIC 9(33) VALUE 1.
000010 01 five       PIC 9(1) VALUE ZERO.
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(33).
000014 01 ln         PIC X(33).
000015 01 maxlen     PIC 9(1) VALUE 3.
000016 01 seven      PIC 9(1) VALUE ZERO.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   PERFORM maxlen TIMES
000021     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000022     END-PERFORM
000023     COMPUTE len = j - cur
000024     MOVE ln(cur:len) TO ABC(i)
000025     COMPUTE cur = j + 1
000026     ADD 1 TO i
000027   END-PERFORM.
000028   PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
000029     IF ABC(i) = 5 THEN
000030       ADD 1 TO five
000031     ELSE IF ABC(i) = 7
000032       ADD 1 TO seven
000033     END-IF
000034   END-PERFORM.
000035   IF five = 2 AND seven = 1 THEN
000036     DISPLAY "YES"
000037   ELSE
000038     DISPLAY "NO"
000039   END-IF.
000040   STOP RUN.

