000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_125_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 maxlen     PIC 9(10) VALUE 100 COMP.
000008 01 cur        PIC 9(10) VALUE 1 COMP.
000009 01 len        PIC 9(10) COMP.
000010 01 ans        PIC 9(10) VALUE ZERO.
000011 01 i          PIC 9(10) VALUE 1 COMP.
000012 01 j          PIC 9(10) COMP.
000013 01 k          PIC 9(10) VALUE 1 COMP.
000014 01 l          PIC 9(10) COMP.
000015 01 m          PIC 9(10) VALUE 1 COMP.
000016 01 zs         PIC Z(9)9.
000017 01 N          PIC 9(10).
000018 01 C1.
000019    03 C11 OCCURS 20 DEPENDING ON N.
000020       05 C    PIC 9(10).
000021 01 V1.
000022    03 V11 OCCURS 20 DEPENDING ON N.
000023       05 V    PIC 9(10).
000024 
000025 PROCEDURE DIVISION.
000026   ACCEPT N.
000027   MOVE N TO maxlen.
000028   ACCEPT ln.
000029   PERFORM maxlen TIMES
000030     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000031     END-PERFORM
000032     COMPUTE len = j - cur
000033     MOVE ln(cur:len) TO V(i)
000034     COMPUTE cur = j + 1
000035     ADD 1 TO i
000036   END-PERFORM.
000037   MOVE 1 TO cur.
000038   ACCEPT ln.
000039   PERFORM maxlen TIMES
000040     PERFORM VARYING l FROM cur BY 1 UNTIL ln(l:1) = SPACE
000041     END-PERFORM
000042     COMPUTE len = l - cur
000043     MOVE ln(cur:len) TO C(k)
000044     COMPUTE cur = l + 1
000045     ADD 1 TO k
000046   END-PERFORM.
000047   MOVE 1 TO cur.
000048   PERFORM VARYING m FROM cur BY 1 UNTIL N < m
000049     IF C(m) < V(m)
000050       COMPUTE ans = ans + V(m) - C(m)
000051     END-IF
000052   END-PERFORM.
000053   MOVE ans TO zs.
000054   DISPLAY FUNCTION TRIM(zs)
000055   STOP RUN.
