000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_186_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 W          PIC 9(10).
000008 01 ans        PIC Z(9)9.
000009 01 d          PIC 9(10).
000010 01 ln         PIC X(30).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO N W.
000015   DIVIDE N BY W GIVING d.
000016   MOVE d TO ans.
000017   DISPLAY FUNCTION TRIM(ans).
000018   STOP RUN.

