000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_090_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans        PIC X(3).
000007 01 c1         PIC X(3).
000008 01 c2         PIC X(3).
000009 01 c3         PIC X(3).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT c1.
000013   ACCEPT c2.
000014   ACCEPT c3.
000015   STRING
000016     c1(1:1)
000017     c2(2:1)
000018     c3(3:1)
000019     INTO ans
000020   END-STRING.
000021   DISPLAY FUNCTION TRIM(ans).
000022   STOP RUN.

