000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_165_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(3).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT S.
000010   IF "ARC" = S
000011     DISPLAY "ABC"
000012   ELSE
000013     DISPLAY "ARC"
000014   END-IF.
000015   STOP RUN.

