000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_239_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 H          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 x          PIC 9(10)V9(9).
000009 01 zs         PIC Z(9)9.9(9).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT H.
000013   COMPUTE x = FUNCTION SQRT(H * (12800000 + H)).
000014   MOVE x TO zs.
000015   DISPLAY FUNCTION TRIM(zs).
000016   STOP RUN.
