000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_170_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans        PIC 9(10).
000007 01 cur        PIC 9(10) VALUE 1 COMP.
000008 01 i          PIC 9(10) VALUE 1 COMP.
000009 01 j          PIC 9(10) COMP.
000010 01 len        PIC 9(10) COMP.
000011 01 ln         PIC X(400).
000012 01 maxlen     PIC 9(10) VALUE 100 COMP.
000013 01 x1.
000014    03 x11 OCCURS 5 INDEXED BY ix.
000015       05 x    PIC S9(10).
000016 01 zs         PIC Z(9)9.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   MOVE 5 TO maxlen.
000021   PERFORM maxlen TIMES
000022     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000023     END-PERFORM
000024     COMPUTE len = j - cur
000025     MOVE ln(cur:len) TO x(i)
000026     COMPUTE cur = j + 1
000027     ADD 1 TO i
000028   END-PERFORM.
000029   SET ix TO 1.
000030   PERFORM UNTIL 5 < ix
000031     SEARCH x11 VARYING ix
000032       AT END
000033         CONTINUE
000034       WHEN ZERO = x(ix)
000035         MOVE ix TO ans
000036         SET ix UP BY 1
000037     END-SEARCH
000038   END-PERFORM.
000039   MOVE ans TO zs.
000040   DISPLAY FUNCTION TRIM(zs).
000041   STOP RUN.

