000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_074_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(5).
000007 01 N          PIC 9(5).
000008 01 zs         PIC Z(6)9.
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT N.
000012   ACCEPT A.
000013   COMPUTE N = N ** 2.
000014   SUBTRACT A FROM N.
000015   MOVE N TO zs.
000016   DISPLAY FUNCTION TRIM(zs).
000017   STOP RUN.

