000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_194_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A         PIC 9(10).
000007 01 AB        PIC 9(10).
000008 01 B         PIC 9(10).
000009 01 ln        PIC X(50).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED SPACE INTO A B.
000014   ADD A TO B GIVING AB.
000015   IF 15 <= AB AND 8 <= B THEN
000016     DISPLAY 1
000017   ELSE
000018     IF 10 <= AB AND 3 <= B THEN
000019       DISPLAY 2
000020     ELSE
000021       IF 3 <= AB THEN
000022         DISPLAY 3
000023       ELSE
000024         DISPLAY 4
000025       END-IF
000026     END-IF
000027   END-IF.
000028   STOP RUN.

