000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_228_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S         PIC 9(10).
000007 01 T         PIC 9(10).
000008 01 X         PIC 9(10).
000009 01 ln        PIC X(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED SPACE INTO S T X.
000014   IF T < S
000015     IF X < S
000016       IF S <= X + 24 AND X + 24 < T + 24 DISPLAY "Yes"
000017       ELSE DISPLAY "No"
000018     ELSE
000019       IF S <= X AND X <= T + 24 DISPLAY "Yes"
000020       ELSE DISPLAY "No"
000021   ELSE IF S <= X AND X <= T DISPLAY "Yes"
000022   ELSE DISPLAY "No".
000023   STOP RUN.

