000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_078_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(6).
000007 01 R          PIC 9(6).
000008 01 X          PIC 9(6).
000009 01 Y          PIC 9(6).
000010 01 Z          PIC 9(6).
000011 01 ln         PIC X(20).
000012 01 zs         PIC Z(6)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO X Y Z.
000017   *> A * Y + (A + 1) * Z <= X
000018   *> A <= (X - Z) / (Y + Z)
000019   SUBTRACT Z FROM X.
000020   ADD Y TO Z.
000021   DIVIDE Z INTO X GIVING D REMAINDER R.
000022   MOVE D TO zs.
000023   DISPLAY FUNCTION TRIM(zs).
000024   STOP RUN.

