000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_163_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(60000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A          PIC 9(10).
000016 01 M          PIC 9(10).
000017 01 N          PIC 9(10).
000018 01 accum      PIC 9(10) VALUE ZERO COMP.
000019 01 ans        PIC 9(10).
000020 01 cur        PIC 9(10) VALUE 1 COMP.
000021 01 i          PIC 9(10) VALUE 1 COMP.
000022 01 j          PIC 9(10) COMP.
000023 01 len        PIC 9(10) COMP.
000024 01 ln         PIC X(400).
000025 01 maxlen     PIC 9(10) VALUE 100 COMP.
000026 01 zs         PIC Z(9)9.
000027 
000028 PROCEDURE DIVISION.
000029   ACCEPT ln.
000030   UNSTRING ln DELIMITED BY SPACE INTO N M.
000031   MOVE M TO maxlen.
000032   OPEN INPUT SYSIN.
000033   READ SYSIN INTO INDATA.
000034   CLOSE SYSIN.
000035   PERFORM maxlen TIMES
000036     PERFORM VARYING j FROM cur BY 1 UNTIL INDATA(j:1) = SPACE
000037     END-PERFORM
000038     COMPUTE len = j - cur
000039     MOVE INDATA(cur:len) TO A
000040     ADD A TO accum
000041     COMPUTE cur = j + 1
000042     ADD 1 TO i
000043   END-PERFORM.
000044   IF N < accum THEN
000045     DISPLAY -1
000046   ELSE
000047     COMPUTE ans = N - accum
000048     MOVE ans TO zs
000049     DISPLAY FUNCTION TRIM(zs)
000050   END-IF.
000051   STOP RUN.

