000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_091_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 M          PIC 9(3).
000007 01 N          PIC 9(3).
000008 01 flg        PIC 9(1).
000009 01 i          PIC 9(18).
000010 01 j          PIC 9(18).
000011 01 point      PIC S9(3) VALUE 0.
000012 01 s1.
000013    03 s11 OCCURS 100.
000014       05 skey PIC X(10) VALUE SPACE.
000015       05 sval PIC 9(3) VALUE 0.
000016 01 slen       PIC 9(3) VALUE 0.
000017 01 t1.
000018    03 t11 OCCURS 100.
000019       05 tkey PIC X(10) VALUE SPACE.
000020       05 tval PIC 9(3) VALUE 0.
000021 01 tlen       PIC 9(3) VALUE 0.
000022 01 tmp        PIC S9(3).
000023 01 tmpkey     PIC X(10) VALUE SPACE.
000024 01 tmpval     PIC 9(3) VALUE 0.
000025 01 zs         PIC Z(3)9.
000026 
000027 PROCEDURE DIVISION.
000028   ACCEPT N.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000030     ACCEPT tmpkey
000031     MOVE 0 TO flg
000032     PERFORM VARYING j FROM 1 BY 1 UNTIL slen < j
000033       IF skey(j) = tmpkey THEN
000034         MOVE 1 TO flg
000035         ADD 1 TO sval(j)
000036       END-IF
000037     END-PERFORM
000038     IF flg = 0 THEN
000039       ADD 1 TO slen
000040       MOVE tmpkey TO skey(slen)
000041       MOVE 1 TO sval(slen)
000042     END-IF
000043   END-PERFORM.
000044   ACCEPT M.
000045   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000046     ACCEPT tmpkey
000047     MOVE 0 TO flg
000048     PERFORM VARYING j FROM 1 BY 1 UNTIL tlen < j
000049       IF tkey(j) = tmpkey THEN
000050         MOVE 1 TO flg
000051         ADD 1 TO tval(j)
000052       END-IF
000053     END-PERFORM
000054     IF flg = 0 THEN
000055       ADD 1 TO tlen
000056       MOVE tmpkey TO tkey(tlen)
000057       MOVE 1 TO tval(tlen)
000058     END-IF
000059   END-PERFORM.
000060   PERFORM VARYING i FROM 1 BY 1 UNTIL slen < i
000061     MOVE sval(i) to tmp
000062     PERFORM VARYING j FROM 1 BY 1 UNTIL tlen < j
000063       IF skey(i) = tkey(j) THEN
000064         SUBTRACT tval(j) FROM tmp
000065       END-IF
000066     END-PERFORM
000067     COMPUTE point = FUNCTION MAX(point, tmp)
000068   END-PERFORM.
000069   MOVE point TO zs.
000070   DISPLAY FUNCTION TRIM(zs).
000071   STOP RUN.

