000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_206_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 price      BINARY-DOUBLE.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT N.
000011   COMPUTE price = 1.08 * N.
000012   IF price < 206 DISPLAY "Yay!" ELSE IF 206 < price DISPLAY ":("
000013   ELSE DISPLAY "so-so".
000014   STOP RUN.

