000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_091_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ABC1.
000007    03 ABC11 OCCURS 3.
000008       05 ABC  PIC 9(4).
000009 01 cur        PIC 9(13) VALUE 1.
000010 01 i          PIC 9(18) VALUE 1.
000011 01 j          PIC 9(18).
000012 01 len        PIC 9(13).
000013 01 ln         PIC X(13).
000014 01 maxlen     PIC 9(1) VALUE 3.
000015 01 tmp        PIC 9(4).
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   PERFORM maxlen TIMES
000020     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000021     END-PERFORM
000022     COMPUTE len = j - cur
000023     MOVE ln(cur:len) TO ABC(i)
000024     COMPUTE cur = j + 1
000025     ADD 1 TO i
000026   END-PERFORM.
000027   ADD ABC(1) TO tmp.
000028   ADD ABC(2) TO tmp.
000029   IF tmp < ABC(3) THEN
000030     DISPLAY "No"
000031   ELSE
000032     DISPLAY "Yes"
000033   END-IF.
000034   STOP RUN.

