000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_243_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(11000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 N          PIC 9(10).
000016 01 A1.
000017    03 A       PIC 9(10) OCCURS 1000 DEPENDING N.
000018 01 B1.
000019    03 B       PIC 9(10) OCCURS 1000 DEPENDING N.
000020 01 ans1       PIC 9(10) VALUE ZERO COMP.
000021 01 ans2       PIC 9(10) VALUE ZERO COMP.
000022 01 i          PIC 9(10) COMP.
000023 01 j          PIC 9(10) COMP.
000024 01 ln         PIC X(30).
000025 01 pt         PIC S9(10).
000026 01 zs         PIC Z(9)9.
000027 
000028 PROCEDURE DIVISION.
000029   OPEN INPUT SYSIN.
000030   READ SYSIN INTO N.
000031   READ SYSIN.
000032   MOVE 1 TO pt.
000033   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000034     UNSTRING INDATA DELIMITED SPACE INTO A(i) POINTER pt
000035   END-PERFORM.
000036   READ SYSIN.
000037   CLOSE SYSIN.
000038   MOVE 1 TO pt.
000039   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000040     UNSTRING INDATA DELIMITED SPACE INTO B(i) POINTER pt
000041   END-PERFORM.
000042   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000043     IF A(i) = B(i) ADD 1 TO ans1
000044     ELSE
000045       PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000046         IF A(i) = B(j) ADD 1 TO ans2 EXIT PERFORM
000047       END-PERFORM
000048   END-PERFORM.
000049   MOVE ans1 TO zs.
000050   DISPLAY FUNCTION TRIM(zs).
000051   MOVE ans2 TO zs.
000052   DISPLAY FUNCTION TRIM(zs).
000053   STOP RUN.

