000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_044_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 a.
000008    03 anum    BINARY-CHAR.
000009 01 chr.
000010    03 num     BINARY-CHAR.
000011 01 cnt1.
000012    03 cnt11 OCCURS 26.
000013       05 cnt  PIC 9(3) VALUE ZERO.
000014 01 flg        PIC X(1) VALUE ZERO.
000015 01 i          PIC 9(3).
000016 01 len        PIC 9(3).
000017 01 tmp        PIC 9(1).
000018 01 w          PIC X(100).
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT w.
000022   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(w).
000023   MOVE 'a' TO a.
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000025     MOVE w(i:1) TO chr
000026     ADD 1 TO cnt(num - anum + 1)
000027   END-PERFORM.
000028   PERFORM VARYING i FROM 1 BY 1 UNTIL 26 < i
000029     COMPUTE tmp = FUNCTION MOD(cnt(i), 2)
000030     IF ZERO < tmp THEN
000031       MOVE 1 TO flg
000032       EXIT PERFORM
000033     END-IF
000034   END-PERFORM.
000035   IF flg = ZERO THEN
000036     DISPLAY "Yes"
000037   ELSE
000038     DISPLAY "No"
000039   END-IF.
000040   STOP RUN.

