000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_173_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 C1.
000007    03 C11 OCCURS 4 DEPENDING num.
000008       05 C    PIC 9(10) VALUE 0 COMP.
000009 01 N          PIC 9(10).
000010 01 S          PIC X(3).
000011 01 ans        PIC X(12).
000012 01 i          PIC 9(10) VALUE 1 COMP.
000013 01 j1         PIC X(12) VALUE "AC WA TLERE".
000014 01 REDEFINES j1.
000015   03 j        PIC X(3) OCCURS 4 INDEXED BY ix.
000016 01 mul        PIC X(3) VALUE " x ".
000017 01 num        PIC 9(10) VALUE 4.
000018 01 zs         PIC Z(9)9.
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT N.
000022   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000023     ACCEPT S
000024     SET ix TO 1
000025     PERFORM UNTIL 4 < ix
000026       SEARCH j VARYING ix
000027         AT END
000028           CONTINUE
000029         WHEN S = j(ix)
000030           ADD 1 TO C(ix)
000031           SET ix UP BY 1
000032       END-SEARCH
000033     END-PERFORM
000034   END-PERFORM.
000035   PERFORM VARYING i FROM 1 BY 1 UNTIL num < i
000036     MOVE SPACE TO ans
000037     MOVE C(i) TO zs
000038     STRING FUNCTION TRIM(j(i)) mul FUNCTION TRIM(zs) INTO ans
000039     DISPLAY FUNCTION TRIM(ans)
000040   END-PERFORM.
000041   STOP RUN.

