000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_002_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 W          PIC X(30).
000007 01 aiueo      PIC X(30) VALUE "aiueo".
000008 01 ans        PIC X(30).
000009 01 i          PIC 9(10) COMP.
000010 01 j          PIC 9(10) VALUE 1 COMP.
000011 01 num        PIC 9(10).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT W.
000015   PERFORM VARYING i FROM 1 BY 1
000016   UNTIL FUNCTION STORED-CHAR-LENGTH(W) < i
000017     MOVE ZERO TO num
000018     INSPECT aiueo TALLYING num FOR ALL W(i:1)
000019     IF ZERO = num THEN
000020       MOVE W(i:1) TO ans(j:1)
000021       ADD 1 TO j
000022     END-IF
000023   END-PERFORM.
000024   DISPLAY FUNCTION TRIM(ans).
000025   STOP RUN.

