000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_260_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(3).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT S.
000010   IF S(1:1) = S(2:1) AND S(2:1) = S(3:1) DISPLAY -1.
000011   IF S(1:1) NOT = S(2:1) AND S(2:1) NOT = S(3:1)
000012   AND S(3:1) NOT = S(1:1) DISPLAY S(1:1).
000013   IF S(1:1) = S(2:1) AND S(2:1) NOT = S(3:1) DISPLAY S(3:1).
000014   IF S(1:1) = S(3:1) AND S(3:1) NOT = S(2:1) DISPLAY S(2:1).
000015   IF S(2:1) = S(3:1) AND S(3:1) NOT = S(1:1) DISPLAY S(1:1).
000016   STOP RUN.

