000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_133_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 X1.
000009    03 X11 OCCURS 100.
000010      05 X111 OCCURS 100.
000011         07 X PIC S9(10).
000012 01 ans        PIC 9(10) VALUE ZERO.
000013 01 cur        PIC 9(10) VALUE 1 COMP.
000014 01 eidx       PIC 9(10) COMP.
000015 01 i          PIC 9(10) VALUE 1 COMP.
000016 01 j          PIC 9(10) COMP.
000017 01 jidx       PIC 9(10) VALUE 1 COMP.
000018 01 k          PIC 9(10) COMP.
000019 01 len        PIC 9(10) COMP.
000020 01 ln         PIC X(400).
000021 01 maxlen     PIC 9(10) VALUE 100 COMP.
000022 01 num        PIC 9(10).
000023 01 nxt        PIC 9(10)V9(10).
000024 01 pre        PIC 9(10)V9(10).
000025 01 sidx       PIC 9(10) COMP VALUE 1.
000026 01 st         PIC 9(10) COMP.
000027 01 zs         PIC Z(9)9.
000028 
000029 PROCEDURE DIVISION.
000030   ACCEPT ln.
000031   UNSTRING ln DELIMITED BY SPACE INTO N D.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000033     ACCEPT ln
000034     MOVE D TO maxlen
000035     MOVE 1 TO cur
000036     MOVE 1 TO jidx
000037     PERFORM maxlen TIMES
000038       PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000039       END-PERFORM
000040       COMPUTE len = j - cur
000041       IF ln(cur:1) = "-"
000042         COMPUTE sidx = cur + 1
000043         COMPUTE eidx = len - 1
000044         MOVE ln(sidx:eidx) TO X(i jidx)
000045         COMPUTE X(i jidx) = -X(i jidx)
000046       ELSE
000047         MOVE ln(cur:len) TO X(i jidx)
000048       END-IF
000049       COMPUTE cur = j + 1
000050       ADD 1 TO jidx
000051     END-PERFORM
000052   END-PERFORM.
000053   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000054     COMPUTE st = i + 1
000055     PERFORM VARYING j FROM st BY 1 UNTIL N < j
000056       MOVE ZERO TO num
000057       PERFORM VARYING k FROM 1 BY 1 UNTIL D < k
000058         COMPUTE num = num + (X(j k) - X(i k)) ** 2
000059       END-PERFORM
000060       COMPUTE pre = FUNCTION SQRT(num)
000061       MOVE pre TO num
000062       MOVE num TO nxt
000063       IF pre = nxt
000064         ADD 1 TO ans
000065       END-IF
000066     END-PERFORM
000067   END-PERFORM.
000068   MOVE ans TO zs.
000069   DISPLAY FUNCTION TRIM(zs).
000070   STOP RUN.

