000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_099_C.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 N          PIC 9(6).
000008 01 ans        PIC X(6).
000009 01 i          PIC 9(6) BINARY.
000010 01 r          PIC 9(1).
000011 01 res        PIC 9(6).
000012 01 sumr       PIC 9(6).
000013 01 t          PIC 9(6).
000014 01 zs         PIC Z(7).
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT N.
000018   MOVE N TO res.
000019   PERFORM VARYING i FROM 0 BY 1 UNTIL N < i
000020     MOVE i TO t
000021     MOVE ZERO TO sumr
000022     PERFORM UNTIL t <= ZERO
000023       DIVIDE 6 INTO t GIVING t REMAINDER r
000024       ADD r TO sumr
000025     END-PERFORM
000026     SUBTRACT i FROM N GIVING t
000027     PERFORM UNTIL t <= ZERO
000028       DIVIDE 9 INTO t GIVING t REMAINDER r
000029       ADD r TO sumr
000030     END-PERFORM
000031     COMPUTE res = FUNCTION MIN(res, sumr)
000032   END-PERFORM.
000033   MOVE res TO zs.
000034   DISPLAY FUNCTION TRIM(zs).
000035   STOP RUN.

