000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_172_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(200000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 S          PIC X(200000).
000016 01 T          PIC X(200000).
000017 01 ans        PIC 9(10) VALUE ZERO COMP.
000018 01 i          PIC 9(10) COMP.
000019 01 len        PIC 9(10).
000020 01 zs         PIC Z(9)9.
000021 
000022 PROCEDURE DIVISION.
000023   OPEN INPUT SYSIN.
000024   READ SYSIN INTO INDATA.
000025   MOVE INDATA TO S.
000026   READ SYSIN INTO INDATA.
000027   MOVE INDATA TO T.
000028   CLOSE SYSIN.
000029   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
000030   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000031     IF S(i : 1) NOT = T(i : 1)
000032       ADD 1 TO ans
000033     END-IF
000034   END-PERFORM.
000035   MOVE ans TO zs.
000036   DISPLAY FUNCTION TRIM(zs).
000037   STOP RUN.

