000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_013_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(10).
000007 01 b          PIC 9(10).
000008 01 x          PIC 9(10).
000009 01 y          PIC 9(10).
000010 01 z          PIC 9(10).
000011 01 ans        PIC 9(10).
000012 01 zs         PIC Z(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT a.
000016   ACCEPT b.
000017   COMPUTE x = 10 + a - b.
000018   COMPUTE y = 10 + b - a.
000019   COMPUTE z = FUNCTION ABS(a - b).
000020   COMPUTE ans = FUNCTION MIN(x y z).
000021   MOVE ans TO zs.
000022   DISPLAY FUNCTION TRIM(zs).
000023   STOP RUN.

