000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_249_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(100).
000007 01 flg        PIC 9(1) VALUE ZERO.
000008 01 i          PIC 9(10) COMP.
000009 01 idx        PIC 9(10).
000010 01 l1.
000011    03 l       PIC 9(1) VALUE ZERO OCCURS 26.
000012 01 len        PIC 9(10).
000013 01 lower      PIC 9(1) VALUE ZERO.
000014 01 u1.
000015    03 u       PIC 9(1) VALUE ZERO OCCURS 26.
000016 01 upper      PIC 9(1) VALUE ZERO.
000017 01 zs         PIC Z(9)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT S.
000021   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
000022   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000023     IF "a" <= S(i:1) AND S(i:1) <= "z"
000024       MOVE 1 TO lower
000025       COMPUTE idx = FUNCTION ORD(S(i:1)) - FUNCTION ORD("a") + 1
000026       ADD 1 TO l(idx)
000027       IF 1 < l(idx) MOVE 1 TO flg EXIT PERFORM END-IF
000028     ELSE
000029       MOVE 1 TO upper
000030       COMPUTE idx = FUNCTION ORD(S(i:1)) - FUNCTION ORD("A") + 1
000031       ADD 1 TO u(idx)
000032       IF 1 < u(idx) MOVE 1 TO flg EXIT PERFORM END-IF
000033     END-IF
000034   END-PERFORM.
000035   IF ZERO = flg AND 1 = lower AND upper DISPLAY "Yes"
000036   ELSE DISPLAY "No".
000037   STOP RUN.

