000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_194_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A      PIC 9(10) OCCURS 1000 DEPENDING N INDEXED IXA.
000008 01 B1.
000009    03 B      PIC 9(10) OCCURS 1000 DEPENDING N INDEXED IXB.
000010 01 CA1.
000011    03 CA     PIC 9(10) OCCURS 1000 DEPENDING N.
000012 01 CB1.
000013    03 CB     PIC 9(10) OCCURS 1000 DEPENDING N.
000014 01 N         PIC 9(10).
000015 01 ans       PIC 9(10).
000016 01 i         PIC 9(10) COMP.
000017 01 idxa      PIC 9(10) COMP.
000018 01 idxb      PIC 9(10) COMP.
000019 01 j         PIC 9(10) COMP.
000020 01 k         PIC 9(10) COMP.
000021 01 ln        PIC X(30).
000022 01 zs        PIC Z(9)9.
000023 
000024 PROCEDURE DIVISION.
000025   ACCEPT N.
000026   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000027     ACCEPT ln
000028     UNSTRING ln DELIMITED SPACE INTO A(i) B(i)
000029     MOVE A(i) TO CA(i)
000030     MOVE B(i) TO CB(i)
000031   END-PERFORM.
000032   SORT CA ASCENDING CA.
000033   SORT CB ASCENDING CB.
000034   SEARCH A
000035     WHEN A(IXA) = CA(1)
000036       MOVE IXA TO idxa
000037   END-SEARCH.
000038   SEARCH B
000039     WHEN B(IXB) = CB(1)
000040       MOVE IXB TO idxb
000041   END-SEARCH.
000042   IF idxa = idxb THEN
000043     COMPUTE ans = FUNCTION MIN(
000044       FUNCTION MAX(CA(1), CB(2))
000045       FUNCTION MAX(CA(2), CB(1))
000046       CA(1) + CB(1)
000047     )
000048   ELSE
000049     COMPUTE ans = FUNCTION MAX(CA(1), CB(1))
000050   END-IF.
000051   MOVE ans TO zs.
000052   DISPLAY FUNCTION TRIM(zs).
000053   STOP RUN.

