000001 PROGRAM-ID. ABC_213_A.
000002 DATA DIVISION.
000003 WORKING-STORAGE SECTION.
000004 01 VAL_A      PIC 9(10).
000005 01 VAL_B      PIC 9(10).
000006 01 NUM_OFF    EXTERNAL PIC 9(1).
000007 01 NUM_ON     EXTERNAL PIC 9(1).
000008 01 NUM_X      EXTERNAL PIC 9(1).
000009 01 X          PIC 9(10).
000010 01 a1.
000011    03 a11 OCCURS 20 DEPENDING ON n.
000012       05 a PIC 9(10).
000013 01 b_txt      PIC X(32) VALUE SPACE.
000014 01 cur        PIC 9(10) VALUE 1 COMP.
000015 01 cr         PIC 9(10) VALUE 1.
000016 01 d_num      PIC 9(10) VALUE ZERO.
000017 01 h_a        PIC X(4) VALUE X"00000000".
000018 01 h_b        PIC X(4) VALUE X"00000000".
000019 01 h_num      PIC X(4) VALUE X"00000000".
000020 01 h_txt      PIC X(8) VALUE SPACE.
000021 01 i          PIC 9(10) VALUE 1 COMP.
000022 01 j          PIC 9(10) COMP.
000023 01 ln         PIC X(100).
000024 01 len        PIC 9(10) COMP.
000025 01 maxlen     PIC 9(10) VALUE 100 COMP.
000026 01 n          PIC 9(10).
000027 01 n_bit      PIC 9(1).
000028 01 r          PIC 9(10).
000029 01 sm         PIC 9(10) VALUE ZERO.
000030 01 x_th       PIC 9(2) VALUE ZERO.
000031 01 x_div      PIC 9(1) VALUE ZERO.
000032 01 zs         PIC Z(9)9.
000033
000034 PROCEDURE DIVISION.
000035   ACCEPT ln.
000036   UNSTRING ln DELIMITED SPACE INTO VAL_A VAL_B.
000037   *> 外部データ
000038   *> 実行単位中の複数のプログラムで使用する定数を設定
000039   CALL "SET_EXTERNAL".
000040   *> 2進数 対応表 0 ? 15
000041   CALL "B_TABLE".
000042   *> 10進数 を 16進数 に変換
000043   CALL "DCM_TO_HEX" USING BY CONTENT VAL_A
000044                           BY REFERENCE h_a.
000045   CALL "DCM_TO_HEX" USING BY CONTENT VAL_B
000046                           BY REFERENCE h_b.
000047   CALL "CBL_XOR" USING h_a, h_b, BY VALUE 4.
000048   *> 16進数 を 2進数、10進数 に変換
000049   CALL "HEX_TO_OTHER" USING BY CONTENT h_b
000050                             BY REFERENCE b_txt
000051                             BY REFERENCE d_num
000052                             BY REFERENCE h_txt.
000053   MOVE d_num TO zs.
000054   DISPLAY FUNCTION TRIM(zs).
000055   STOP RUN.
000056 END PROGRAM ABC_213_A.
000057
000058 PROGRAM-ID. SET_EXTERNAL.
000059 *> 外部データ
000060 *> 実行単位中の複数のプログラムで使用する定数を設定
000061 *> external data
000062 *> Set constants used for multiple programs in running unit
000063 DATA DIVISION.
000064 WORKING-STORAGE SECTION.
000065     01 BNY EXTERNAL PIC 9(1).
000066     01 BIT4 EXTERNAL PIC 9(1).
000067     01 BYT4 EXTERNAL PIC 9(1).
000068     01 BYT32 EXTERNAL PIC 9(2).
000069     01 BYT256 EXTERNAL PIC 9(3).
000070     01 HXD EXTERNAL PIC 9(2).
000071     01 NUM_OFF EXTERNAL PIC 9(1).
000072     01 NUM_ON EXTERNAL PIC 9(1).
000073     01 NUM_X EXTERNAL PIC 9(1).
000074     01 OCT EXTERNAL PIC 9(1).
000075
000076 *> 16進数 対応表 0 ? 15
000077     01 H_TBL1 EXTERNAL.
000078         03 H_TBL11 OCCURS 16.
000079             05 H_TBL PIC X(1).
000080
000081 PROCEDURE DIVISION.
000082     MOVE 2 TO BNY.
000083     MOVE 4 TO BIT4.
000084     MOVE 4 TO BYT4.
000085     MOVE 32 TO BYT32.
000086     MOVE 256 TO BYT256.
000087     MOVE 16 TO HXD.
000088     MOVE 0 TO NUM_OFF.
000089     MOVE 1 TO NUM_ON.
000090     MOVE 9 TO NUM_X.
000091     MOVE 8 TO OCT.
000092
000093     MOVE "0123456789ABCDEF" TO H_TBL1.
000094 END PROGRAM SET_EXTERNAL.
000095
000096 PROGRAM-ID. B_TABLE.
000097 *> 2進数 対応表 0 ? 15
000098 *> 0001
000099 *> 0010
000100 *> 中略
000101 *> 1111
000102 DATA DIVISION.
000103 WORKING-STORAGE SECTION.
000104 *> 16
000105     01 HXD EXTERNAL PIC 9(2).
000106 *> 2
000107     01 BNY EXTERNAL PIC 9(1).
000108 *> 4
000109     01 BYT4 EXTERNAL PIC 9(1).
000110 *> 8
000111     01 OCT EXTERNAL PIC 9(1).
000112
000113     01 p PIC 9(1).
000114
000115     01 i PIC 9(8).
000116     01 j PIC 9(8).
000117
000118     01 q PIC 9(2).
000119     01 r PIC 9(1).
000120
000121     01 s PIC X(1).
000122     01 str PIC X(4).
000123
000124     01 len PIC 9(1).
000125     01 idx PIC 9(2).
000126
000127 *> 2進数 対応表 0 ? 15
000128     01 B_TBL1 EXTERNAL.
000129         03 B_TBL11 OCCURS 16.
000130             05 B_TBL PIC X(4).
000131
000132 PROCEDURE DIVISION.
000133 *> 0 ? 15
000134     PERFORM VARYING i FROM 0 BY 1 UNTIL HXD <= i
000135
000136         MOVE i TO q
000137         MOVE ALL ZERO TO str
000138
000139 *> 繰り返し 2 で割る
000140         PERFORM VARYING j FROM 0 BY 1 UNTIL q <= 0
000141
000142             DIVIDE BNY INTO q GIVING q REMAINDER r
000143
000144             COMPUTE p = FUNCTION STORED-CHAR-LENGTH(str)
000145             SUBTRACT j FROM p
000146
000147             MOVE r TO s
000148
000149             STRING
000150                 s
000151                 INTO str WITH POINTER p
000152             END-STRING
000153
000154         END-PERFORM
000155
000156         ADD 1 TO i GIVING idx
000157 *> 2進数 対応表 設定
000158         MOVE str TO B_TBL(idx)
000159
000160     END-PERFORM.
000161 END PROGRAM B_TABLE.
000162
000163 PROGRAM-ID. DCM_TO_HEX.
000164 *> 10進数 を 16進数 に変換
000165 *> 4 byte (32 bit) 用
000166 *> Convert decimal number to hexadecimal number
000167 *> For 4 byte (32 bit)
000168 DATA DIVISION.
000169 WORKING-STORAGE SECTION.
000170 *> 2
000171     01 BNY EXTERNAL PIC 9(1).
000172 *> 4
000173     01 BYT4 EXTERNAL PIC 9(1).
000174 *> 256
000175     01 BYT256 EXTERNAL PIC 9(3).
000176 *> 8
000177     01 OCT EXTERNAL PIC 9(1).
000178
000179     01 d PIC 9(3) BINARY.
000180
000181     01 filler REDEFINES d.
000182         03 filler PIC X.
000183         03 dbyte PIC X.
000184
000185     01 i PIC 9(1).
000186     01 idx PIC 9(1).
000187
000188     01 q PIC 9(10).
000189     01 r PIC 9(3).
000190
000191 LINKAGE SECTION.
000192 *> (IN)  d_num
000193 *> (OUT) h_num
000194     01 d_num PIC 9(10).
000195     01 h_num PIC X(4).
000196
000197 PROCEDURE DIVISION USING d_num h_num.
000198     INITIALIZE h_num
000199     MOVE d_num TO q
000200
000201 *> 1 byte ずつ処理
000202     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH of h_num < i
000203 *> 4 - i
000204         COMPUTE idx = BYT4 - i
000205
000206 *> 10進数 を 256 で割る
000207         DIVIDE BYT256 INTO q GIVING q REMAINDER r
000208
000209 *> 余り(10進数 1 byte) を 代入することで
000210         MOVE r TO d
000211
000212 *> 16進数 を得ることができる
000213         MOVE dbyte TO h_num(idx + 1:1)
000214     END-PERFORM.
000215 END PROGRAM DCM_TO_HEX.
000216
000217 PROGRAM-ID. HEX_TO_OTHER.
000218 *> 16進数 を 2進数、10進数 に変換
000219 *> 4 byte (32 bit) 用
000220 *> Convert hexadecimal number to binary number, decimal number
000221 *> For 4 byte (32 bit)
000222 DATA DIVISION.
000223 WORKING-STORAGE SECTION.
000224 *> 4
000225     01 BIT4 EXTERNAL PIC 9(1).
000226 *> 2
000227     01 BNY EXTERNAL PIC 9(1).
000228 *> 4
000229     01 BYT4 EXTERNAL PIC 9(1).
000230 *> 256
000231     01 BYT256 EXTERNAL PIC 9(3).
000232 *> 16
000233     01 HXD EXTERNAL PIC 9(2).
000234 *> 8
000235     01 OCT EXTERNAL PIC 9(1).
000236
000237     01 d PIC 9(3) BINARY.
000238
000239     01 filler REDEFINES d.
000240         03 filler PIC X.
000241         03 dbyte PIC X.
000242
000243     01 i PIC 9(1).
000244
000245     01 j PIC 9(1).
000246     01 k PIC 9(2).
000247     01 m PIC 9(1).
000248
000249     01 q PIC 9(10).
000250     01 r PIC 9(2).
000251
000252 *> 2進数 対応表 0 ? 15
000253     01 B_TBL1 EXTERNAL.
000254         03 B_TBL11 OCCURS 16.
000255             05 B_TBL PIC X(4).
000256
000257 *> 16進数 対応表 0 ? 15
000258     01 H_TBL1 EXTERNAL.
000259         03 H_TBL11 OCCURS 16.
000260             05 H_TBL PIC X(1).
000261
000262 LINKAGE SECTION.
000263 *> (IN)  h_num
000264 *> (OUT) b_txt
000265 *>       d_num
000266 *>       h_txt
000267     01 h_num PIC X(4).
000268     01 b_txt PIC X(32).
000269     01 d_num PIC 9(10).
000270     01 h_txt PIC X(8).
000271
000272 PROCEDURE DIVISION USING h_num b_txt d_num h_txt.
000273     INITIALIZE b_txt
000274     INITIALIZE d_num
000275     INITIALIZE h_txt
000276
000277 *> 1 byte ずつ処理
000278     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH OF h_num < i
000279 *> 2 * i - 1
000280         COMPUTE j = BNY * i - 1
000281
000282 *> 8 * i - 7
000283         COMPUTE k = OCT * (i - 1) + 1
000284
000285 *> 7 - (2 * i - 1)
000286         COMPUTE m = OCT - BNY * i
000287
000288 *> 16進数 1 byte を 代入することで
000289         MOVE h_num(i:1) TO dbyte
000290
000291 *> 得られた 10進数 を 16 で割る
000292         DIVIDE HXD INTO d GIVING q REMAINDER r
000293
000294 *> 前から格納していく
000295 *> [F]
000296         MOVE H_TBL(q + 1) TO h_txt(j:1)
000297 *> [FF]
000298         MOVE H_TBL(r + 1) TO h_txt(j + 1:1)
000299
000300 *> [1111]
000301         MOVE B_TBL(q + 1) TO b_txt(k:BIT4)
000302 *> [11111111]
000303         MOVE B_TBL(r + 1) TO b_txt(k + BIT4:BIT4)
000304
000305 *> 16^0 の位 から 16^7 の位 までの 8桁
000306 *> 10進数 上位桁 足し込み
000307         COMPUTE d_num = d_num + HXD ** (m + 1) * q
000308
000309 *> 10進数 下位桁 足し込み
000310         COMPUTE d_num = d_num + HXD ** m * r
000311     END-PERFORM.
000312 END PROGRAM HEX_TO_OTHER.
000313
000314 PROGRAM-ID. DCM_TO_BNY.
000315 *> 10進数 を 2進数 に変換
000316 *> 4 byte (32 bit) 用
000317 *> Convert decimal number to binary number
000318 *> For 4 byte (32 bit)
000319 DATA DIVISION.
000320 WORKING-STORAGE SECTION.
000321 *> 4
000322     01 BIT4 EXTERNAL PIC 9(1).
000323 *> 2
000324     01 BNY EXTERNAL PIC 9(1).
000325 *> 4
000326     01 BYT4 EXTERNAL PIC 9(1).
000327 *> 32
000328     01 BYT32 EXTERNAL PIC 9(2).
000329 *> 256
000330     01 BYT256 EXTERNAL PIC 9(3).
000331 *> 16
000332     01 HXD EXTERNAL PIC 9(2).
000333 *> 8
000334     01 OCT EXTERNAL PIC 9(1).
000335
000336     01 i PIC 9(2).
000337
000338     01 j PIC 9(1).
000339     01 k PIC 9(2).
000340     01 m PIC 9(1).
000341
000342     01 q PIC 9(10).
000343     01 r PIC 9(2).
000344
000345 *> 2進数 対応表 0 ? 15
000346     01 B_TBL1 EXTERNAL.
000347         03 B_TBL11 OCCURS 16.
000348             05 B_TBL PIC X(4).
000349
000350 *> 16進数 対応表 0 ? 15
000351     01 H_TBL1 EXTERNAL.
000352         03 H_TBL11 OCCURS 16.
000353             05 H_TBL PIC X(1).
000354
000355 LINKAGE SECTION.
000356 *> (IN)  d_num
000357 *> (OUT) b_txt
000358     01 d_num PIC 9(10).
000359     01 b_txt PIC X(32).
000360
000361 PROCEDURE DIVISION USING d_num b_txt.
000362     MOVE ALL ZERO TO b_txt
000363
000364     MOVE d_num TO q
000365
000366     PERFORM VARYING i FROM 1 BY 1 UNTIL q <= 0
000367 *> 32 - 4 * i + 1
000368         COMPUTE k = BYT32 - BYT4 * i + 1
000369
000370 *> 10進数 を 16 で割る
000371         DIVIDE HXD INTO q GIVING q REMAINDER r
000372
000373 *> 後ろから格納していく
000374 *> [1111]
000375         MOVE B_TBL(r + 1) TO b_txt(k:BIT4)
000376
000377     END-PERFORM.
000378 END PROGRAM DCM_TO_BNY.
000379
000380 PROGRAM-ID. BNY_TO_DCM.
000381 *> 2進数 を 10進数 に変換
000382 *> 4 byte (32 bit) 用
000383 *> Convert binary number to decimal number
000384 *> For 4 byte (32 bit)
000385 DATA DIVISION.
000386 WORKING-STORAGE SECTION.
000387 *> 4
000388     01 BIT4 EXTERNAL PIC 9(1).
000389 *> 2
000390     01 BNY EXTERNAL PIC 9(1).
000391 *> 4
000392     01 BYT4 EXTERNAL PIC 9(1).
000393 *> 32
000394     01 BYT32 EXTERNAL PIC 9(2).
000395 *> 256
000396     01 BYT256 EXTERNAL PIC 9(3).
000397 *> 16
000398     01 HXD EXTERNAL PIC 9(2).
000399 *> 8
000400     01 OCT EXTERNAL PIC 9(1).
000401
000402     01 i PIC 9(2).
000403     01 j PIC 9(2).
000404
000405     01 tmp PIC 9(1).
000406
000407 LINKAGE SECTION.
000408 *> (IN)  b_num
000409 *> (OUT) d_num
000410     01 b_txt PIC X(32).
000411     01 d_num PIC 9(10).
000412
000413 PROCEDURE DIVISION USING b_txt d_num.
000414     INITIALIZE d_num
000415
000416     MOVE ZERO TO i
000417
000418 *> 32 bit 処理
000419     PERFORM BYT32 TIMES
000420
000421 *> 32 - i
000422         COMPUTE j = BYT32 - i
000423
000424         MOVE b_txt(j:1) TO tmp
000425
000426 *> 2^0 の位 から 2^31 の位 までの 32 bit
000427 *> 10進数 足し込み
000428         COMPUTE d_num = d_num + BNY ** i * tmp
000429
000430         ADD 1 TO i
000431
000432     END-PERFORM.
000433 END PROGRAM BNY_TO_DCM.
000434
000435 PROGRAM-ID. BNY_TO_HEX.
000436 *> 2進数 を 16進数 に変換
000437 *> 4 byte (32 bit) 用
000438 *> Convert binary number to hexadecimal number
000439 *> For 4 byte (32 bit)
000440 DATA DIVISION.
000441 WORKING-STORAGE SECTION.
000442 *> 4
000443     01 BIT4 EXTERNAL PIC 9(1).
000444 *> 2
000445     01 BNY EXTERNAL PIC 9(1).
000446 *> 4
000447     01 BYT4 EXTERNAL PIC 9(1).
000448 *> 256
000449     01 BYT256 EXTERNAL PIC 9(3).
000450 *> 16
000451     01 HXD EXTERNAL PIC 9(2).
000452 *> 8
000453     01 OCT EXTERNAL PIC 9(1).
000454
000455     01 d PIC 9(4) BINARY.
000456
000457     01 filler REDEFINES d.
000458         03 filler PIC X.
000459         03 dbyte PIC X.
000460
000461     01 i PIC 9(2).
000462     01 j PIC 9(2).
000463     01 k PIC 9(2).
000464
000465     01 tmp PIC 9(1).
000466
000467 LINKAGE SECTION.
000468 *> (IN)  b_txt
000469 *> (OUT) h_num
000470     01 b_txt PIC X(32).
000471     01 h_num PIC X(4).
000472
000473 PROCEDURE DIVISION USING b_txt h_num.
000474     INITIALIZE h_num
000475
000476 *> 1 byte ずつ処理
000477     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH OF h_num < i
000478
000479         MOVE ZERO TO d
000480
000481 *> 8 * (i - 1) + 1
000482         COMPUTE k = OCT * (i - 1) + 1
000483
000484 *> 2進数 から 1 byte 取得 10進数 を 代入することで
000485         PERFORM VARYING j FROM 1 BY 1 UNTIL OCT < j
000486             MOVE b_txt(k + j - 1:1) TO tmp
000487             COMPUTE d = d + BNY ** (OCT - j) * tmp
000488         END-PERFORM
000489
000490 *> 16進数 を得ることができる
000491         MOVE dbyte TO h_num(i:1)
000492     END-PERFORM.
000493 END PROGRAM BNY_TO_HEX.
000494
000495 PROGRAM-ID. GET_NTH_BIT.
000496 *> Nビット目 を 取り出す
000497 *> 4 byte (32 bit) 用
000498 *> Get N-th bit
000499 *> For 4 byte (32 bit)
000500 DATA DIVISION.
000501 WORKING-STORAGE SECTION.
000502 *> 2
000503     01 BNY EXTERNAL PIC 9(1).
000504 *> 4
000505     01 BYT4 EXTERNAL PIC 9(1).
000506 *> 32
000507     01 BYT32 EXTERNAL PIC 9(2).
000508 *> 256
000509     01 BYT256 EXTERNAL PIC 9(3).
000510 *> 16
000511     01 HXD EXTERNAL PIC 9(2).
000512 *> 8
000513     01 OCT EXTERNAL PIC 9(1).
000514
000515     01 b_tmp PIC X(32).
000516
000517 LINKAGE SECTION.
000518 *> (IN)  x_th
000519 *>       d_num
000520 *> (OUT) n_bit
000521     01 x_th PIC 9(2) VALUE ZERO.
000522     01 d_num PIC 9(10).
000523     01 n_bit PIC 9(1).
000524
000525 PROCEDURE DIVISION USING x_th d_num n_bit.
000526     INITIALIZE n_bit
000527
000528     CALL "DCM_TO_BNY" USING BY CONTENT d_num
000529                               BY REFERENCE b_tmp
000530
000531 *> 右から x_th 番目を取り出す
000532     MOVE b_tmp(BYT32 - x_th + 1:1) TO n_bit.
000533 END PROGRAM GET_NTH_BIT.
000534
000535 PROGRAM-ID. SET_NTH.
000536 *> Nビット目 操作
000537 *> 4 byte (32 bit) 用
000538 *> Set N-th bit operation
000539 *> For 4 byte (32 bit)
000540 DATA DIVISION.
000541 WORKING-STORAGE SECTION.
000542 *> 2
000543     01 BNY EXTERNAL PIC 9(1).
000544 *> 4
000545     01 BYT4 EXTERNAL PIC 9(1).
000546 *> 32
000547     01 BYT32 EXTERNAL PIC 9(2).
000548 *> 256
000549     01 BYT256 EXTERNAL PIC 9(3).
000550 *> 16
000551     01 HXD EXTERNAL PIC 9(2).
000552 *> 0
000553     01 NUM_OFF EXTERNAL PIC 9(1).
000554 *> 1
000555     01 NUM_ON EXTERNAL PIC 9(1).
000556 *> 9
000557     01 NUM_X EXTERNAL PIC 9(1).
000558 *> 8
000559     01 OCT EXTERNAL PIC 9(1).
000560
000561     01 b_tmp PIC X(32).
000562     01 h_tmp PIC X(4).
000563
000564 LINKAGE SECTION.
000565 *> (IN)  x_th
000566 *>       x_div
000567 *>       d_num
000568 *> (OUT) d_num
000569 *>       h_num
000570     01 x_th PIC 9(2).
000571     01 x_div PIC 9(1).
000572     01 d_num PIC 9(10).
000573     01 h_num PIC X(4).
000574
000575 PROCEDURE DIVISION USING x_th x_div d_num h_num.
000576     MOVE ALL ZERO TO b_tmp
000577
000578     IF x_div = NUM_OFF THEN
000579 *> 1111 1111 1111 1111 1111 1111 1111 1111
000580         MOVE ALL '1' TO b_tmp
000581     END-IF
000582
000583 *> フラグ設定
000584     MOVE x_div TO b_tmp(BYT32 - x_th + 1:1)
000585
000586     IF x_div = NUM_X THEN
000587 *> 1
000588         MOVE NUM_ON TO b_tmp(BYT32 - x_th + 1:1)
000589     END-IF
000590
000591     CALL "BNY_TO_HEX" USING BY CONTENT b_tmp
000592                               BY REFERENCE h_tmp
000593
000594 *> Nビット目 操作
000595 *> 0 をセットする
000596     IF x_div = NUM_OFF THEN
000597         CALL "CBL_AND" USING h_tmp, h_num, BY VALUE BYT4
000598     ELSE
000599 *> 1 をセットする
000600         IF x_div = NUM_ON THEN
000601             CALL "CBL_OR" USING h_tmp, h_num, BY VALUE BYT4
000602 *> 反転する
000603         ELSE
000604             CALL "CBL_XOR" USING h_tmp, h_num, BY VALUE BYT4
000605         END-IF
000606     END-IF.
000607 END PROGRAM SET_NTH.
