000001 *> REF ABC 170 A
000002 IDENTIFICATION DIVISION.
000003 PROGRAM-ID. ABC_146_A.
000004 
000005 DATA DIVISION.
000006 WORKING-STORAGE SECTION.
000007 01 S          PIC X(3).
000008 01 ans        PIC 9(10).
000009 01 n          PIC 9.
000010 01 w1         PIC X(21) VALUE "SUNMONTUEWEDTHUFRISAT".
000011 01 REDEFINES w1.
000012   03 w      PIC X(3) OCCURS 7 INDEXED BY ix.
000013 01 zs         PIC Z(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT S.
000017   MOVE 7 TO n.
000018   PERFORM UNTIL n < ix
000019     SEARCH w VARYING ix
000020       AT END
000021         CONTINUE
000022       WHEN S = w(ix)
000023         MOVE ix TO ans
000024         SET ix UP BY 1
000025     END-SEARCH
000026   END-PERFORM.
000027   COMPUTE ans = 7 - (ans - 1).
000028   MOVE ans TO zs.
000029   DISPLAY FUNCTION TRIM(zs).
000030   STOP RUN.

