000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_053_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(200000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 i          PIC 9(6) BINARY.
000016 01 j          PIC 9(6) BINARY.
000017 01 len        PIC 9(6).
000018 01 ln1.
000019    03 ln      PIC X(1) OCCURS 200000.
000020 01 zs         PIC Z(7).
000021 
000022 PROCEDURE DIVISION.
000023   OPEN INPUT SYSIN.
000024   READ SYSIN INTO ln1.
000025   CLOSE SYSIN.
000026   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(ln1).
000027   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000028     IF ln(i) = 'A' THEN
000029       EXIT PERFORM
000030     END-IF
000031   END-PERFORM.
000032   PERFORM VARYING j FROM len BY -1 UNTIL j < 1
000033     IF ln(j) = 'Z' THEN
000034       EXIT PERFORM
000035     END-IF
000036   END-PERFORM.
000037   SUBTRACT i FROM j.
000038   ADD 1 TO j.
000039   MOVE j TO zs.
000040   DISPLAY FUNCTION TRIM(zs).
000041   STOP RUN.

