000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_190_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D         PIC 9(10).
000007 01 N         PIC 9(10).
000008 01 S         PIC 9(10).
000009 01 X         PIC 9(10).
000010 01 Y         PIC 9(10).
000011 01 flg       PIC 9(1) VALUE ZERO.
000012 01 i         PIC 9(10).
000013 01 ln        PIC X(30).
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED SPACE INTO N S D.
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000019     ACCEPT ln
000020     UNSTRING ln DELIMITED SPACE INTO X Y
000021     IF X < S AND D < Y THEN
000022       MOVE 1 TO flg
000023       EXIT PERFORM
000024     END-IF
000025   END-PERFORM.
000026   IF 1 = flg THEN
000027     DISPLAY "Yes"
000028   ELSE
000029     DISPLAY "No"
000030   END-IF.
000031   STOP RUN.

