000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_045_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(3).
000007 01 b          PIC 9(3).
000008 01 h          PIC 9(5).
000009 01 zs         PIC Z(6).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT a.
000013   ACCEPT b.
000014   ACCEPT h.
000015   ADD a TO b.
000016   MULTIPLY b BY h.
000017   DIVIDE 2 INTO h.
000018   MOVE h TO zs.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

