000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_034_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 x          PIC 9(10).
000008 01 y          PIC 9(10).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT ln.
000012   UNSTRING ln DELIMITED BY SPACE INTO x y.
000013   IF x < y THEN
000014     DISPLAY "Better"
000015   ELSE
000016     DISPLAY "Worse"
000017   END-IF.
000018   STOP RUN.

