000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_038_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(50).
000007 01 len        PIC 9(2).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT S.
000011   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
000012   IF S(len:1) = 'T' THEN
000013       DISPLAY "YES"
000014   ELSE
000015       DISPLAY "NO"
000016   END-IF.
000017   STOP RUN.

