000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_141_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 E         PIC X(3) VALUE "LUD".
000007 01 O         PIC X(3) VALUE "RUD".
000008 01 S         PIC X(100).
000009 01 cnt       PIC 9(10).
000010 01 flg       PIC 9(1) VALUE 1.
000011 01 i         PIC 9(10) COMP.
000012 01 len       PIC 9(10).
000013 01 qt        PIC 9(10).
000014 01 rm        PIC 9(10).
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT S.
000018   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
000019   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000020     DIVIDE i BY 2 GIVING qt REMAINDER rm
000021     MOVE ZERO TO cnt
000022     IF rm = 1
000023       INSPECT O TALLYING cnt FOR ALL S(i:1)
000024       IF ZERO = cnt
000025         MOVE ZERO TO flg
000026         EXIT PERFORM
000027       END-IF
000028     ELSE
000029       INSPECT E TALLYING cnt FOR ALL S(i:1)
000030       IF ZERO = cnt
000031         MOVE ZERO TO flg
000032         EXIT PERFORM
000033       END-IF
000034     END-IF
000035   END-PERFORM.
000036   IF ZERO NOT = flg
000037     DISPLAY "Yes"
000038   ELSE
000039     DISPLAY "No"
000040   END-IF.
000041   STOP RUN.

