000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_210_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 N          PIC 9(10).
000016 01 d          PIC 9(10).
000017 01 i          PIC 9(10) COMP.
000018 01 r          PIC 9(10).
000019 
000020 PROCEDURE DIVISION.
000021   OPEN INPUT SYSIN.
000022   READ SYSIN INTO N.
000023   READ SYSIN.
000024   CLOSE SYSIN.
000025   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000026     IF "1" = INDATA(i:1) EXIT PERFORM
000027   END-PERFORM.
000028   DIVIDE i BY 2 GIVING d REMAINDER r.
000029   IF ZERO = r DISPLAY "Aoki" ELSE DISPLAY "Takahashi".
000030   STOP RUN.

