000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_138_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(10).
000007 01 s          PIC X(10).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT a.
000011   ACCEPT s.
000012   IF 3200 <= a
000013     DISPLAY FUNCTION TRIM(s)
000014   ELSE
000015     DISPLAY "red"
000016   END-IF.
000017   STOP RUN.

