000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_018_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT A.
000012   ACCEPT B.
000013   ACCEPT C.
000014   IF A < B AND B < C THEN
000015     DISPLAY 3
000016     DISPLAY 2
000017     DISPLAY 1
000018   ELSE
000019     IF B < A AND A < C THEN
000020       DISPLAY 2
000021       DISPLAY 3
000022       DISPLAY 1
000023     ELSE
000024       IF A < C AND C < B THEN
000025         DISPLAY 3
000026         DISPLAY 1
000027         DISPLAY 2
000028       ELSE
000029         IF C < A AND A < B THEN
000030           DISPLAY 2
000031           DISPLAY 1
000032           DISPLAY 3
000033         ELSE
000034           IF B < C AND C < A THEN
000035             DISPLAY 1
000036             DISPLAY 3
000037             DISPLAY 2
000038           ELSE
000039             DISPLAY 1
000040             DISPLAY 2
000041             DISPLAY 3
000042           END-IF
000043         END-IF
000044       END-IF
000045     END-IF
000046   END-IF.
000047   STOP RUN.

