000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_240_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(20000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 ln         PIC X(20000).
000016 01 maxlen     PIC 9(10) VALUE 100 COMP.
000017 01 cur        PIC 9(10) VALUE 1 COMP.
000018 01 i          PIC 9(10) VALUE 1 COMP.
000019 01 j          PIC 9(10) COMP.
000020 01 len        PIC 9(10) COMP.
000021 01 zs         PIC Z(9)9.
000022 01 N          PIC 9(10).
000023 01 a          PIC 9(10).
000024 01 flg        PIC 9(1).
000025 01 ix         PIC 9(10) VALUE 1.
000026 01 ai1.
000027    03 ai11 OCCURS 1000 DEPENDING N INDEXED aix.
000028       05 ai   PIC S9(10) VALUE ZERO.
000029 
000030 PROCEDURE DIVISION.
000031   ACCEPT N.
000032   OPEN INPUT SYSIN.
000033   READ SYSIN INTO ln.
000034   CLOSE SYSIN.
000035   MOVE N TO maxlen.
000036   MOVE 1 TO ix.
000037   PERFORM maxlen TIMES
000038     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000039     END-PERFORM
000040     COMPUTE len = j - cur
000041     MOVE ln(cur:len) TO a
000042     MOVE ZERO TO flg
000043     SET aix TO 1
000044     SEARCH ai11
000045       WHEN ai(aix) = a
000046         MOVE 1 TO flg
000047     END-SEARCH
000048     IF ZERO = flg
000049       MOVE a TO ai(ix)
000050       ADD 1 TO ix
000051     END-IF
000052     COMPUTE cur = j + 1
000053     ADD 1 TO i
000054   END-PERFORM.
000055   SUBTRACT 1 FROM ix
000056   MOVE ix TO zs.
000057   DISPLAY FUNCTION TRIM(zs).
000058   STOP RUN.
