000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_235_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 abc        PIC X(3).
000007 01 cur        PIC X(3).
000008 01 ans        PIC 9(4) VALUE ZERO.
000009 01 zs         PIC Z(3)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT abc.
000013   COMPUTE ans = ans + FUNCTION NUMVAL(abc).
000014   STRING abc(2:2) abc(1:1) INTO cur END-STRING.
000015   MOVE cur TO abc.
000016   COMPUTE ans = ans + FUNCTION NUMVAL(cur).
000017   STRING abc(2:2) abc(1:1) INTO cur END-STRING.
000018   MOVE cur TO abc.
000019   COMPUTE ans = ans + FUNCTION NUMVAL(cur).
000020   MOVE ans TO zs.
000021   DISPLAY FUNCTION TRIM(zs).
000022   STOP RUN.

