000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_097_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(18).
000007 01 ans        PIC Z(18).
000008 01 b          PIC 9(4).
000009 01 bp         PIC 9(18).
000010 01 p          PIC 9(4).
000011 01 tmp        PIC 9(18).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT A.
000015   MOVE 1 TO tmp.
000016   PERFORM VARYING b FROM 2 BY 1 UNTIL A < b
000017     PERFORM VARYING p FROM 2 BY 1 UNTIL A < p
000018       COMPUTE bp = b ** p
000019       IF A < bp THEN
000020         EXIT PERFORM
000021       END-IF
000022       COMPUTE tmp = FUNCTION MAX(tmp, bp)
000023     END-PERFORM
000024   END-PERFORM.
000025   MOVE tmp TO ans.
000026   DISPLAY FUNCTION TRIM(ans).
000027   STOP RUN.

