000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_167_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 K          PIC 9(10).
000010 01 ans        PIC S9(10).
000011 01 ln         PIC X(43).
000012 01 zs         PIC -(10)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO A B C K.
000017   IF K <= A
000018     COMPUTE ans = K
000019   ELSE
000020     IF K <= A + B
000021       COMPUTE ans = A
000022     ELSE
000023       COMPUTE ans = A - (K - A - B)
000024     END-IF
000025   END-IF.
000026   MOVE ans TO zs.
000027   DISPLAY FUNCTION TRIM(zs).
000028   STOP RUN.

