000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_157_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(3).
000007 01 ans        PIC Z9.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT N.
000011   COMPUTE ans = (N + 1) / 2.
000012   DISPLAY FUNCTION TRIM(ans).
000013   STOP RUN.

