000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_047_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(3).
000007 01 b          PIC 9(3).
000008 01 c          PIC 9(3).
000009 01 ln         PIC X(11).
000010 01 q          PIC 9(3).
000011 01 r          PIC 9(1).
000012 01 x          PIC 9(3).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO a b c.
000017   COMPUTE x = a + b + c.
000018   DIVIDE 2 INTO x GIVING q REMAINDER r.
000019   IF r = 1 THEN
000020     DISPLAY "No"
000021   ELSE
000022     IF a = q OR b = q OR c = q THEN
000023       DISPLAY "Yes"
000024     ELSE
000025       DISPLAY "No"
000026     END-IF
000027   END-IF.
000028   STOP RUN.

