000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_008_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 S1.
000008    03 S11 OCCURS 50 DEPENDING N INDEXED IXS.
000009       05 S    PIC X(50).
000010       05 num  PIC 9(10) VALUE ZERO.
000011 01 cur        PIC X(50).
000012 01 flg        PIC 9(1).
000013 01 i          PIC 9(10) VALUE 1 COMP.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT N.
000017   PERFORM N TIMES
000018     ACCEPT cur
000019     MOVE ZERO TO flg
000020     SET IXS TO 1
000021     SEARCH S11
000022       AT END
000023         CONTINUE
000024       WHEN cur = S(IXS)
000025         MOVE 1 TO flg
000026         ADD 1 TO num(IXS)
000027       WHEN ZERO = FUNCTION STORED-CHAR-LENGTH(S(IXS))
000028         MOVE ZERO TO flg
000029     END-SEARCH
000030     IF ZERO = flg
000031       MOVE cur TO S(i)
000032       ADD 1 TO num(i)
000033       ADD 1 TO i
000034     END-IF
000035   END-PERFORM.
000036   SORT S11 DESCENDING num ASCENDING S.
000037   DISPLAY FUNCTION TRIM(S(1)).
000038   STOP RUN.

