000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_211_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 2B         PIC 9(10) VALUE ZERO.
000007 01 3B         PIC 9(10) VALUE ZERO.
000008 01 H          PIC 9(10) VALUE ZERO.
000009 01 HR         PIC 9(10) VALUE ZERO.
000010 01 S          PIC X(2).
000011 
000012 PROCEDURE DIVISION.
000013   PERFORM 4 TIMES
000014     ACCEPT S
000015     EVALUATE FUNCTION TRIM(S)
000016       WHEN "H"
000017         ADD 1 TO H
000018       WHEN "2B"
000019         ADD 1 TO 2B
000020       WHEN "3B"
000021         ADD 1 TO 3B
000022       WHEN "HR"
000023         ADD 1 TO HR
000024     END-EVALUATE
000025   END-PERFORM.
000026   IF 1 = H AND 2B AND 3B AND HR DISPLAY "Yes" ELSE DISPLAY "No".
000027   STOP RUN.

