000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_086_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC X(3).
000007 01 b          PIC X(3).
000008 01 flg        PIC 9(1) VALUE 0.
000009 01 i          PIC 9(6).
000010 01 ln         PIC X(7).
000011 01 ln2        PIC X(6).
000012 01 num        PIC 9(6).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO a b.
000017   STRING
000018   a(1:FUNCTION STORED-CHAR-LENGTH(a))
000019   b(1:FUNCTION STORED-CHAR-LENGTH(b))
000020   INTO ln2.
000021   MOVE ln2 TO num.
000022   PERFORM VARYING i FROM 2 BY 1 UNTIL num < i
000023     IF num < i * i THEN
000024       EXIT PERFORM
000025     ELSE
000026       IF num = i * i THEN
000027         MOVE 1 TO flg
000028       END-IF
000029     END-IF
000030   END-PERFORM.
000031   IF flg = 1 THEN
000032     DISPLAY "Yes"
000033   ELSE
000034     DISPLAY "No"
000035   END-IF.
000036   STOP RUN.

