000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_124_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 ans        PIC 9(10).
000008 01 zs         PIC Z(9)9.
000009 01 A          PIC 9(10).
000010 01 B          PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A B.
000015   IF A = B
000016     COMPUTE ans = 2 * A
000017   ELSE
000018     COMPUTE ans = 2 * FUNCTION MAX(A B) - 1
000019   END-IF.
000020   MOVE ans TO zs.
000021   DISPLAY FUNCTION TRIM(zs).
000022   STOP RUN.
