000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_015_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC X(50).
000007 01 B          PIC X(50).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT A.
000011   ACCEPT B.
000012   IF FUNCTION STORED-CHAR-LENGTH(B)
000013   < FUNCTION STORED-CHAR-LENGTH(A) THEN
000014     DISPLAY FUNCTION TRIM(A)
000015   ELSE
000016     DISPLAY FUNCTION TRIM(B)
000017   END-IF.
000018   STOP RUN.

