000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_224_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(20).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT S.
000010   IF S(FUNCTION STORED-CHAR-LENGTH(S) - 1:2) = "er" DISPLAY "er"
000011   ELSE DISPLAY "ist".
000012   STOP RUN.

