000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_174_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 X          PIC S9(10).
000009 01 Y          PIC S9(10).
000010 01 cnt        PIC 9(10) VALUE ZERO COMP.
000011 01 i          PIC 9(10).
000012 01 ln         PIC X(30).
000013 01 zs         PIC Z(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED BY SPACE INTO N D.
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000019     ACCEPT ln
000020     UNSTRING ln DELIMITED BY SPACE INTO X Y
000021     IF FUNCTION SQRT(X ** 2 + Y ** 2) <= D THEN
000022       ADD 1 TO cnt
000023     END-IF
000024   END-PERFORM.
000025   MOVE cnt TO zs.
000026   DISPLAY FUNCTION TRIM(zs).
000027   STOP RUN.

