000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_170_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 C          PIC S9(10).
000007 01 T          PIC S9(10).
000008 01 X          PIC 9(10).
000009 01 Y          PIC 9(10).
000010 01 ans        PIC X(30).
000011 01 ln         PIC X(30).
000012 01 zs         PIC Z(9)9.
000013 
000014 PROCEDURE DIVISION.
000015 *> C + T = X
000016 *> 2 * C + 4 * T = Y
000017 *> T = X - C
000018 *> 2 * C + 4 * (X - C) = Y
000019 *> - 2 * C = Y - 4 * X
000020 *> C = 2 * X - Y / 2
000021 *> T = -X + Y / 2
000022   ACCEPT ln.
000023   UNSTRING ln DELIMITED SPACE INTO X Y.
000024   COMPUTE C = 2 * X - Y / 2.
000025   COMPUTE T = -X + Y / 2.
000026   IF ZERO <= C AND ZERO <= T AND C + T = X AND 2 * C + 4 * T = Y
000027     DISPLAY "Yes"
000028   ELSE
000029     DISPLAY "No"
000030   END-IF.
000031   STOP RUN.

