000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_020_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC X(3).
000007 01 AB         PIC X(6).
000008 01 B          PIC X(3).
000009 01 ans        PIC 9(10).
000010 01 ln         PIC X(7).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO A B.
000016   STRING
000017     FUNCTION TRIM(A)
000018     FUNCTION TRIM(B)
000019     INTO AB
000020   END-STRING.
000021   MOVE FUNCTION TRIM(AB) TO ans.
000022   MULTIPLY ans BY 2 GIVING ans.
000023   MOVE ans TO zs.
000024   DISPLAY FUNCTION TRIM(zs).
000025   STOP RUN.

