000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_184_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(200000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 N          PIC 9(10).
000016 01 X          PIC 9(10).
000017 01 S          PIC X(200000).
000018 01 ans        PIC 9(10) COMP.
000019 01 i          PIC 9(10) COMP.
000020 01 ln         PIC X(200000).
000021 01 zs         PIC Z(9)9.
000022 
000023 PROCEDURE DIVISION.
000024   OPEN INPUT SYSIN.
000025   READ SYSIN INTO ln.
000026   READ SYSIN INTO S.
000027   CLOSE SYSIN.
000028   UNSTRING ln DELIMITED BY SPACE INTO N X.
000029   MOVE X TO ans.
000030   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000031     IF "o" = S(i:1) THEN
000032       ADD 1 TO ans
000033     ELSE
000034       IF ZERO < ans THEN
000035         SUBTRACT 1 FROM ans
000036       END-IF
000037     END-IF
000038   END-PERFORM.
000039   MOVE ans TO zs.
000040   DISPLAY FUNCTION TRIM(zs).
000041   STOP RUN.

