000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_143_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        PIC 9(10) VALUE ZERO.
000008 01 cur        PIC 9(10) VALUE 1 COMP.
000009 01 d1.
000010    03 d11 OCCURS 100 DEPENDING ON N.
000011       05 d    PIC 9(10).
000012 01 i          PIC 9(10) VALUE 1 COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 k          PIC 9(10) COMP.
000015 01 len        PIC 9(10) COMP.
000016 01 ln         PIC X(400).
000017 01 maxlen     PIC 9(10) VALUE 100 COMP.
000018 01 zs         PIC Z(9)9.
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT N.
000022   ACCEPT ln.
000023   MOVE N TO maxlen.
000024   PERFORM maxlen TIMES
000025     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000026     END-PERFORM
000027     COMPUTE len = j - cur
000028     MOVE ln(cur:len) TO d(i)
000029     COMPUTE cur = j + 1
000030     ADD 1 TO i
000031   END-PERFORM.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL 50 < i
000033     COMPUTE k = i + 1
000034     PERFORM VARYING j FROM k BY 1 UNTIL 50 < j
000035       COMPUTE ans = ans + d(i) * d(j)
000036     END-PERFORM
000037   END-PERFORM.
000038   MOVE ans TO zs.
000039   DISPLAY FUNCTION TRIM(zs).
000040   STOP RUN.

