000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_126_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 N          PIC 9(10).
000008 01 K          PIC 9(10).
000009 01 S          PIC X(50).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO N K.
000014   ACCEPT S.
000015   MOVE FUNCTION LOWER-CASE(S(K:1)) TO S(K:1).
000016   DISPLAY FUNCTION TRIM(S).
000017   STOP RUN.
