000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_230_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S         PIC X(10).
000007 01 T         PIC X(12) VALUE "oxxoxxoxxoxx".
000008 01 flg       PIC 9(1) VALUE ZERO.
000009 01 i         PIC 9(10).
000010 01 slen      PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT S.
000014   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO slen.
000015   PERFORM VARYING i FROM 1 BY 1 UNTIL 12 - slen + 1 < i
000016     IF S(1:slen) = T(i:slen) MOVE 1 TO flg EXIT PERFORM
000017   END-PERFORM.
000018   IF ZERO = flg DISPLAY "No" ELSE DISPLAY "Yes".
000019   STOP RUN.

