000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_021_A.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(2).
000007
000008 PROCEDURE DIVISION.
000009   ACCEPT N.
000010  EVALUATE N
000011     WHEN 10
000012       DISPLAY 2
000013       DISPLAY 2
000014       DISPLAY 8
000015     WHEN 9
000016       DISPLAY 2
000017       DISPLAY 1
000018       DISPLAY 8
000019     WHEN 8
000020       DISPLAY 1
000021       DISPLAY 8
000022     WHEN 7
000023       DISPLAY 3
000024       DISPLAY 1
000025       DISPLAY 2
000026       DISPLAY 4
000027     WHEN 6
000028       DISPLAY 2
000029       DISPLAY 2
000030       DISPLAY 4
000031     WHEN 5
000032       DISPLAY 2
000033       DISPLAY 1
000034       DISPLAY 4
000035     WHEN 4
000036       DISPLAY 1
000037       DISPLAY 4
000038     WHEN 3
000039       DISPLAY 2
000040       DISPLAY 1
000041       DISPLAY 2
000042     WHEN 2
000043       DISPLAY 1
000044       DISPLAY 2
000045     WHEN 1
000046       DISPLAY 1
000047       DISPLAY 1
000048   END-EVALUATE.
000049   STOP RUN.

