000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_168_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 N          PIC 9(10).
000008 01 Q          PIC 9(10).
000009 01 R          PIC 9(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED SPACE INTO N.
000014   DIVIDE N BY 10 GIVING Q REMAINDER R.
000015   IF R = 2 OR 4 OR 5 OR 7 OR 9
000016     DISPLAY "hon"
000017   ELSE IF R = 0 OR 1 OR 6 OR 8
000018     DISPLAY "pon"
000019   ELSE
000020     DISPLAY "bon"
000021   END-IF.
000022   STOP RUN.

