000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_205_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC 9(10) OCCURS 1000 DEPENDING N.
000008 01 N          PIC 9(10).
000009 01 i          PIC 9(10) VALUE 1 COMP.
000010 01 len        PIC 9(10) COMP.
000011 01 ln         PIC X(5000).
000012 01 pt         PIC S9(10) VALUE 1.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   ACCEPT ln.
000017   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000018     UNSTRING ln DELIMITED SPACE INTO A(i) POINTER pt
000019   END-PERFORM.
000020   SORT A ASCENDING A.
000021   MOVE 1 TO i.
000022   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000023     IF i NOT = A(i) EXIT PERFORM
000024   END-PERFORM.
000025   IF N < i DISPLAY "Yes" ELSE DISPLAY "No".
000026   STOP RUN.

