000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_032_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(10).
000007 01 ad         PIC 9(10).
000008 01 ans        PIC 9(10).
000009 01 ar         PIC 9(10).
000010 01 b          PIC 9(10).
000011 01 bd         PIC 9(10).
000012 01 br         PIC 9(10) VALUE 1.
000013 01 i          PIC 9(10).
000014 01 n          PIC 9(10).
000015 01 nd         PIC 9(10).
000016 01 nr         PIC 9(10).
000017 01 zs         PIC Z(9)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT a.
000021   ACCEPT b.
000022   ACCEPT n.
000023   DIVIDE n BY a GIVING nd REMAINDER nr.
000024   IF ZERO not = nr
000025     ADD 1 TO nd
000026   END-IF.
000027   PERFORM VARYING i FROM nd BY 1 UNTIL ZERO = br
000028       MULTIPLY a BY i GIVING ans
000029       DIVIDE ans BY B GIVING bd REMAINDER br
000030   END-PERFORM.
000031   MOVE ans TO zs.
000032   DISPLAY FUNCTION TRIM(zs).
000033   STOP RUN.

