000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. PROGRAM_ID.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 ans        PIC 9(10).
000008 01 zs         PIC Z(9)9.
000009 01 A          PIC 9(10).
000010 01 P          PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A P.
000015   COMPUTE ans = (A * 3 + P) / 2.
000016   MOVE ans TO zs.
000017   DISPLAY FUNCTION TRIM(zs).
000018   STOP RUN.
