000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_043_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans1.
000007    03 ans11 OCCURS 10.
000008       05 ans  PIC X(1).
000009 01 i          PIC 9(2).
000010 01 len        PIC 9(2).
000011 01 now        PIC 9(2).
000012 01 s1.
000013    03 s11 OCCURS 10.
000014       05 s    PIC X(1).
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT s1.
000018   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(s1).
000019   MOVE ZERO TO now.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000021     IF s(i) = 'B' THEN
000022       IF now NOT = ZERO THEN
000023         MOVE SPACE TO ans(now)
000024         SUBTRACT 1 FROM now
000025       END-IF
000026     ELSE
000027       ADD 1 TO now
000028       MOVE s(i) TO ans(now)
000029     END-IF
000030   END-PERFORM.
000031   DISPLAY FUNCTION TRIM(ans1).
000032   STOP RUN.

