000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_101_C.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 INP        PIC X(14).
000007 01 INP2       PIC X(700000).
000008 01 NK1.
000009    03 NK11 OCCURS 2.
000010       05 NK   PIC 9(6).
000011 01 R          PIC 9(6).
000012 01 X          PIC 9(6).
000013 01 cur        PIC 9(2) VALUE 1.
000014 01 i          PIC 9(18) VALUE 1.
000015 01 j          PIC 9(18).
000016 01 len        PIC 9(2).
000017 01 maxlen     PIC 9(1) VALUE 2.
000018 01 zs         PIC Z(6).
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT INP.
000022   ACCEPT INP2.
000023   PERFORM maxlen TIMES
000024     PERFORM VARYING j FROM cur BY 1
000025       UNTIL INP(j:1) = SPACE
000026     END-PERFORM
000027     COMPUTE len = j - cur
000028     MOVE INP(cur:len) TO NK(i)
000029     COMPUTE cur = j + 1
000030     ADD 1 TO i
000031   END-PERFORM.
000032 *> N <= K + (K - 1) * (G - 1)
000033 *> (N - K) / (K - 1) + 1
000034   SUBTRACT NK(2) FROM NK(1).
000035   SUBTRACT 1 FROM NK(2).
000036   DIVIDE NK(2) INTO NK(1) GIVING X REMAINDER R.
000037   IF R NOT = 0 THEN
000038     ADD 1 TO X
000039   END-IF.
000040   ADD 1 TO X.
000041   MOVE X TO zs.
000042   DISPLAY FUNCTION TRIM(zs).
000043   STOP RUN.

