000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_162_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 cnt        PIC 9(10).
000009 01 ln         PIC X(30).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   INSPECT ln TALLYING cnt FOR ALL "7".
000014   IF cnt = ZERO
000015     DISPLAY "No"
000016   ELSE
000017     DISPLAY "Yes"
000018   END-IF.
000019   STOP RUN.

