000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_105_C.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC S9(11).
000007 01 R          PIC 9(1).
000008 01 ans        PIC X(128).
000009 01 i          PIC 9(3).
000010 01 len        PIC 9(3).
000011 01 p          PIC 9(3).
000012 01 str        PIC X(128).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   MOVE 1 TO p.
000017   PERFORM UNTIL N = ZERO
000018     IF FUNCTION MOD(N, 2) = 1
000019       SUBTRACT 1 FROM N
000020       STRING
000021         '1'
000022         INTO str POINTER p
000023       END-STRING
000024     ELSE
000025       STRING
000026         ZERO
000027         INTO str POINTER p
000028       END-STRING
000029     END-IF
000030     DIVIDE -2 INTO N
000031   END-PERFORM.
000032   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(str).
000033   MOVE 1 TO p.
000034   PERFORM VARYING i FROM len BY -1 UNTIL i <= ZERO
000035     STRING
000036       str(i:1)
000037       INTO ans POINTER p
000038     END-STRING
000039   END-PERFORM
000040   IF ZERO = len
000041     DISPLAY ZERO
000042   ELSE
000043     DISPLAY ans(1:len)
000044   STOP RUN.

