000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_017_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 flg        PIC 9(1) VALUE 1.
000007 01 len        PIC 9(10).
000008 01 ln         PIC X(50).
000009 01 pre        PIC 9(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO pre.
000014   PERFORM UNTIL FUNCTION STORED-CHAR-LENGTH(ln) <= ZERO
000015     MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
000016     IF ln(len - 1:2) = "ch" THEN
000017       MOVE SPACE TO ln(len - 1:2)
000018     END-IF
000019     MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
000020     IF ln(len:1) = "o" THEN
000021       MOVE SPACE TO ln(len:1)
000022     END-IF
000023     MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
000024     IF ln(len:1) = "k" THEN
000025       MOVE SPACE TO ln(len:1)
000026     END-IF
000027     MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO len
000028     IF ln(len:1) = "u" THEN
000029       MOVE SPACE TO ln(len:1)
000030     END-IF
000031     IF pre = FUNCTION STORED-CHAR-LENGTH(ln) THEN
000032       MOVE ZERO TO flg
000033       EXIT PERFORM
000034     END-IF
000035     MOVE FUNCTION STORED-CHAR-LENGTH(ln) TO pre
000036   END-PERFORM.
000037   IF ZERO = flg THEN
000038     DISPLAY "NO"
000039   ELSE
000040     DISPLAY "YES"
000041   END-IF.
000042   STOP RUN.

