000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_036_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 A          PIC 9(10).
000008 01 B          PIC 9(10).
000009 01 d          PIC 9(10).
000010 01 r          PIC 9(10).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO A B.
000016   DIVIDE B BY A GIVING d REMAINDER r.
000017   IF ZERO < r THEN
000018     ADD 1 TO d
000019   END-IF.
000020   MOVE d TO zs.
000021   DISPLAY FUNCTION TRIM(zs).
000022   STOP RUN.

