000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_185_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC 9(10) OCCURS 1000 DEPENDING M.
000008 01 B1.
000009    03 B       PIC 9(10) OCCURS 1000 DEPENDING M.
000010 01 M          PIC 9(10).
000011 01 N          PIC 9(10).
000012 01 T          PIC 9(10).
000013 01 cur        PIC S9(10).
000014 01 i          PIC 9(10) COMP.
000015 01 ln         PIC X(400).
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   UNSTRING ln DELIMITED BY SPACE INTO N M T.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000021     ACCEPT ln
000022     UNSTRING ln DELIMITED BY SPACE INTO A(i) B(i)
000023   END-PERFORM.
000024   MOVE N TO cur.
000025   SUBTRACT A(1) FROM cur.
000026   IF ZERO < cur AND cur + B(1) - A(1) < N THEN
000027     COMPUTE cur = cur + B(1) - A(1)
000028   ELSE
000029     IF ZERO < cur AND N < cur + B(1) - A(1) THEN
000030       MOVE N TO cur
000031     END-IF
000032   END-IF.
000033   IF ZERO < cur THEN
000034     PERFORM VARYING i FROM 2 BY 1 UNTIL M < i
000035       COMPUTE cur = cur - A(i) + B(i - 1)
000036       IF cur <= ZERO THEN
000037         EXIT PERFORM
000038       END-IF
000039       IF cur + B(i) - A(i) < N THEN
000040         COMPUTE cur = cur + B(i) - A(i)
000041       ELSE
000042         MOVE N TO cur
000043       END-IF
000044     END-PERFORM
000045   END-IF.
000046   IF ZERO < cur AND ZERO < cur - T + B(M) THEN
000047     DISPLAY "Yes"
000048   ELSE
000049     DISPLAY "No"
000050   END-IF.
000051   STOP RUN.

