000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_199_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 ln         PIC X(30).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED SPACE INTO A B C.
000014   IF A ** 2 + B ** 2 < C ** 2 DISPLAY "Yes" ELSE DISPLAY "No".
000015   STOP RUN.

