000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_078_B.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 zs         PIC Z(11).
000008
000009 PROCEDURE DIVISION.
000010     ACCEPT N.
000011     COMPUTE N = FUNCTION SQRT(N).
000012     COMPUTE N = N ** 2.
000013     MOVE N TO zs.
000014     DISPLAY FUNCTION TRIM(zs).
000015     STOP RUN.

