000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_136_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 ans        PIC 9(10).
000010 01 ln         PIC X(30).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO A B C.
000016   IF A < B + C
000017     COMPUTE ans = B + C - A
000018     MOVE ans TO zs
000019     DISPLAY FUNCTION TRIM(zs)
000020   ELSE
000021     DISPLAY ZERO
000022   END-IF.
000023   STOP RUN.

