000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_138_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11 OCCURS 100 DEPENDING ON N.
000008       05 A    PIC S9(10).
000009 01 N          PIC 9(10).
000010 01 ans        PIC 9(10)V9(14) VALUE ZERO.
000011 01 cur        PIC 9(10) VALUE 1 COMP.
000012 01 i          PIC 9(10) VALUE 1 COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 len        PIC 9(10) COMP.
000015 01 ln         PIC X(500).
000016 01 maxlen     PIC 9(10) VALUE 100 COMP.
000017 01 zs         PIC Z(9)9.9(14).
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT N.
000021   ACCEPT ln.
000022   MOVE N TO maxlen.
000023   PERFORM maxlen TIMES
000024     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000025     END-PERFORM
000026     COMPUTE len = j - cur
000027     MOVE ln(cur:len) TO A(i)
000028     COMPUTE ans = ans + 1 / A(i)
000029     COMPUTE cur = j + 1
000030     ADD 1 TO i
000031   END-PERFORM.
000032   COMPUTE ans = 1 / ans.
000033   MOVE ans TO zs.
000034   DISPLAY FUNCTION TRIM(zs).
000035   STOP RUN.

