000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_197_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 H          PIC 9(10).
000007 01 S11.
000008    03 S       PIC X(100) OCCURS 100 DEPENDING H.
000009 01 W          PIC 9(10).
000010 01 X          PIC 9(10).
000011 01 Y          PIC 9(10).
000012 01 ans        PIC 9(10) VALUE ZERO.
000013 01 i          PIC 9(10) COMP.
000014 01 ln         PIC X(30).
000015 01 zs         PIC Z(9)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   UNSTRING ln DELIMITED BY SPACE INTO H W X Y.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000021     ACCEPT S(i)
000022   END-PERFORM.
000023   *> è„â∫ç∂âE
000024   PERFORM VARYING i FROM X BY -1
000025   UNTIL i <= ZERO OR "#" = S(i)(Y:1)
000026     ADD 1 TO ans
000027   END-PERFORM.
000028   PERFORM VARYING i FROM X BY 1
000029   UNTIL H < i OR "#" = S(i)(Y:1)
000030     ADD 1 TO ans
000031   END-PERFORM.
000032   PERFORM VARYING i FROM Y BY -1
000033   UNTIL i <= ZERO OR "#" = S(X)(i:1)
000034     ADD 1 TO ans
000035   END-PERFORM.
000036   PERFORM VARYING i FROM Y BY 1
000037   UNTIL W < i OR "#" = S(X)(i:1)
000038     ADD 1 TO ans
000039   END-PERFORM.
000040   SUBTRACT 3 FROM ans.
000041   MOVE ans TO zs.
000042   DISPLAY FUNCTION TRIM(zs).
000043   STOP RUN.

