000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_097_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 abcd1.
000007    03 abcd11 OCCURS 4.
000008       05 abcd PIC 9(3).
000009 01 cur        PIC 9(2) VALUE 1.
000010 01 i          PIC 9(18) VALUE 1.
000011 01 j          PIC 9(18).
000012 01 len        PIC 9(2).
000013 01 ln         PIC X(16).
000014 01 maxlen     PIC 9(1) VALUE 4.
000015 01 tmp12      PIC 9(3).
000016 01 tmp13      PIC 9(3).
000017 01 tmp23      PIC 9(3).
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT ln.
000021   PERFORM maxlen TIMES
000022     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000023     END-PERFORM
000024     COMPUTE len = j - cur
000025     MOVE ln(cur:len) TO abcd(i)
000026     COMPUTE cur = j + 1
000027     ADD 1 TO i
000028   END-PERFORM.
000029   COMPUTE tmp12 = abcd(1) - abcd(2).
000030   COMPUTE tmp13 = abcd(1) - abcd(3).
000031   COMPUTE tmp23 = abcd(2) - abcd(3).
000032   IF (tmp13 <= abcd(4)) THEN
000033     DISPLAY "Yes"
000034   ELSE
000035     IF (tmp12 <= abcd(4)) AND (tmp23 <= abcd(4)) THEN
000036       DISPLAY "Yes"
000037     ELSE
000038       DISPLAY "No"
000039     END-IF
000040   END-IF.
000041   STOP RUN.

