000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_073_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(4).
000007 01 i          PIC 9(6).
000008 01 l          PIC 9(6).
000009 01 ln         PIC X(13).
000010 01 r          PIC 9(6).
000011 01 sm         PIC 9(6).
000012 01 zs         PIC Z(7).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   MOVE 0 TO sm.
000017   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000018     ACCEPT ln
000019     UNSTRING ln DELIMITED BY SPACE INTO l r
000020     SUBTRACT l FROM r
000021     ADD 1 TO r
000022     ADD r TO sm
000023   END-PERFORM.
000024   MOVE sm TO zs.
000025   DISPLAY FUNCTION TRIM(zs).
000026   STOP RUN.

