000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_220_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A         BINARY-DOUBLE.
000007 01 A10       PIC 9(10) VALUE ZERO.
000008 01 B         BINARY-DOUBLE.
000009 01 B10       PIC 9(10) VALUE ZERO.
000010 01 K         PIC 9(10).
000011 01 d         PIC 9(10).
000012 01 i         PIC 9(10) COMP.
000013 01 ln        PIC X(50).
000014 01 r         PIC 9(10).
000015 01 zs        PIC Z(9)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT K.
000019   ACCEPT ln.
000020   UNSTRING ln DELIMITED SPACE INTO A B.
000021   PERFORM WITH TEST AFTER
000022   VARYING i FROM ZERO BY 1 UNTIL A <= ZERO
000023     DIVIDE A BY 10 GIVING A REMAINDER r
000024     COMPUTE A10 = A10 + r * K ** i
000025   END-PERFORM.
000026   PERFORM WITH TEST AFTER
000027   VARYING i FROM ZERO BY 1 UNTIL B <= ZERO
000028     DIVIDE B BY 10 GIVING B REMAINDER r
000029     COMPUTE B10 = B10 + r * K ** i
000030   END-PERFORM.
000031   COMPUTE zs = A10 * B10.
000032   DISPLAY FUNCTION TRIM(zs).
000033   STOP RUN.

