000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_264_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 C          PIC 9(10).
000007 01 R          PIC 9(10).
000008 01 QC         PIC 9(10).
000009 01 QR         PIC 9(10).
000010 01 RC         PIC 9(10).
000011 01 RR         PIC 9(10).
000012 01 ln         PIC X(30).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO R C.
000017   DIVIDE C BY 2 GIVING QC REMAINDER RC.
000018   DIVIDE R BY 2 GIVING QR REMAINDER RR.
000019   IF C < FUNCTION MIN(R 15 - R + 1)
000020   OR FUNCTION MAX(R 15 - R + 1) < C
000021     IF 1 = RC DISPLAY "black"
000022     ELSE DISPLAY "white"
000023   ELSE
000024     IF 1 = RR DISPLAY "black"
000025     ELSE DISPLAY "white".
000026   STOP RUN.

