000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_124_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 maxlen     PIC 9(10) VALUE 100 COMP.
000008 01 cur        PIC 9(10) VALUE 1 COMP.
000009 01 len        PIC 9(10) COMP.
000010 01 ans        PIC 9(10) VALUE ZERO.
000011 01 height     PIC 9(10) VALUE ZERO.
000012 01 i          PIC 9(10) VALUE 1 COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 zs         PIC Z(9)9.
000015 01 N          PIC 9(10).
000016 01 H1.
000017    03 H11 OCCURS 20 DEPENDING ON N.
000018       05 H    PIC 9(10).
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT N.
000022   MOVE N TO maxlen.
000023   ACCEPT ln.
000024   PERFORM maxlen TIMES
000025     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000026     END-PERFORM
000027     COMPUTE len = j - cur
000028     MOVE ln(cur:len) TO H(i)
000029     IF height <= H(i)
000030       MOVE H(i) TO height
000031       ADD 1 TO ans
000032     END-IF
000033     COMPUTE cur = j + 1
000034     ADD 1 TO i
000035   END-PERFORM.
000036   MOVE ans TO zs.
000037   DISPLAY FUNCTION TRIM(zs)
000038   STOP RUN.
