000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_237_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 *> -9223372036854775808
000007 01 N          PIC X(20).
000008 01 flg        PIC 9(1) VALUE ZERO.
000009 01 len        PIC 9(10).
000010 01 len31      PIC 9(10).
000011 01 str        PIC X(20).
000012 01 str31      PIC X(10) VALUE "2147483648".
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   MOVE FUNCTION STORED-CHAR-LENGTH(N) TO len.
000017   MOVE FUNCTION STORED-CHAR-LENGTH(str31) TO len31.
000018   IF "-" = N(1:1) MOVE N(2:len) TO str SUBTRACT 1 FROM len
000019   ELSE MOVE N TO str.
000020   IF len < len31 MOVE 1 TO flg
000021   ELSE IF len31 = len
000022     IF FUNCTION NUMVAL(str) < FUNCTION NUMVAL(str31)
000023       MOVE 1 TO flg
000024     ELSE IF N(1:1) = "-"
000025     AND FUNCTION NUMVAL(str31) = FUNCTION NUMVAL(str)
000026       MOVE 1 TO flg.
000027   IF 1 = flg DISPLAY "Yes" ELSE DISPLAY "No".
000028   STOP RUN.

