000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_216_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC 9(10).
000007 01 ST1.
000008    03 ST     PIC X(30) OCCURS 1000 DEPENDING N INDEXED IXST.
000009 01 flg       PIC 9(1) VALUE ZERO.
000010 01 i         PIC 9(10) COMP.
000011 01 j         PIC 9(10) VALUE 1 COMP.
000012 01 nm        PIC X(30).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000017     ACCEPT nm
000018     SET IXST TO 1
000019     SEARCH ST
000020       WHEN SPACE = ST(IXST)
000021         CONTINUE
000022       WHEN nm = ST(IXST)
000023         MOVE 1 TO flg
000024     END-SEARCH
000025     IF 1 = flg EXIT PERFORM
000026     ELSE MOVE nm TO ST(j) ADD 1 TO j
000027   END-PERFORM.
000028   IF 1 = flg DISPLAY "Yes" ELSE DISPLAY "No"
000029   STOP RUN.

