000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_203_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 K          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 ans        PIC 9(10) VALUE ZERO.
000009 01 i          PIC 9(10) COMP.
000010 01 ln         PIC X(30).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO N K.
000016   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000017     COMPUTE ans = ans + i * 100 * K + (1 + K) * K / 2
000018   END-PERFORM.
000019   MOVE ans TO zs.
000020   DISPLAY FUNCTION TRIM(zs).
000021   STOP RUN.

