000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_261_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC X(1000) OCCURS 1000 DEPENDING N.
000008 01 N          PIC 9(10).
000009 01 flg        PIC 9(10) VALUE ZERO.
000010 01 i          PIC 9(10) COMP.
000011 01 j          PIC 9(10) COMP.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT N.
000015   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000016     ACCEPT A(i)
000017   END-PERFORM.
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000019     ADD 1 TO i GIVING j
000020     PERFORM VARYING j FROM j BY 1 UNTIL N < j
000021       IF "W" = A(i)(j:1) AND "L" <> A(j)(i:1)
000022         MOVE 1 TO flg
000023       END-IF
000024       IF "L" = A(i)(j:1) AND "W" <> A(j)(i:1)
000025         MOVE 1 TO flg
000026       END-IF
000027       IF "D" = A(i)(j:1) AND "D" <> A(j)(i:1)
000028         MOVE 1 TO flg
000029       END-IF
000030       IF ZERO <> flg EXIT PERFORM
000031     END-PERFORM
000032     IF ZERO <> flg EXIT PERFORM
000033   END-PERFORM.
000034   IF ZERO = flg DISPLAY "correct"
000035   ELSE DISPLAY "incorrect".
000036   STOP RUN.

