000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_079_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(2).
000007 01 i          PIC 9(2).
000008 01 lucas      PIC 9(18).
000009 01 ppr        PIC 9(18).
000010 01 pr         PIC 9(18).
000011 01 tmp        PIC 9(18).
000012 01 zs         PIC Z(18)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   PERFORM LUCASNUMBER.
000017   MOVE lucas TO zs.
000018   DISPLAY FUNCTION TRIM(zs).
000019   STOP RUN.
000020 
000021 LUCASNUMBER SECTION.
000022   MOVE 2 TO ppr.
000023   MOVE 1 TO pr.
000024   PERFORM VARYING i FROM 2 BY 1 UNTIL N < i
000025     ADD ppr pr GIVING lucas
000026     MOVE pr TO ppr
000027     MOVE lucas TO pr
000028   END-PERFORM.
000029   IF N = 1 THEN
000030     MOVE 1 TO lucas
000031   END-IF.

