000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_263_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 D          PIC 9(10).
000010 01 E          PIC 9(10).
000011 01 cards1.
000012    03 cards   PIC 9(10) VALUES ZERO OCCURS 13.
000013 01 flg2       PIC 9(1) VALUE ZERO.
000014 01 flg3       PIC 9(1) VALUE ZERO.
000015 01 i          PIC 9(10) COMP.
000016 01 ln         PIC X(30).
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   UNSTRING ln DELIMITED SPACE INTO A B C D E.
000021   ADD 1 TO cards(A).
000022   ADD 1 TO cards(B).
000023   ADD 1 TO cards(C).
000024   ADD 1 TO cards(D).
000025   ADD 1 TO cards(E).
000026   PERFORM VARYING i FROM 1 BY 1 UNTIL 13 < i
000027     IF 2 = cards(i) MOVE 1 TO flg2
000028     ELSE IF 3 = cards(i) MOVE 1 TO flg3
000029   END-PERFORM.
000030   IF 1 = flg2 AND flg3 DISPLAY "Yes" ELSE DISPLAY "No"
000031   STOP RUN.

