000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_173_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        PIC 9(10).
000008 01 num        PIC 9(10).
000009 01 qt         PIC 9(10).
000010 01 rm         PIC 9(10).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT N.
000015   DIVIDE N BY 1000 GIVING qt REMAINDER rm.
000016   COMPUTE num = 1000 - rm.
000017   DIVIDE num BY 1000 GIVING qt REMAINDER ans.
000018   MOVE ans TO zs.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

