000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_011_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 zs         PIC Z(9)9.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT N.
000011   IF 12 = N THEN
000012     MOVE 1 TO N
000013   ELSE
000014     ADD 1 TO N
000015   END-IF.
000016   MOVE N TO zs.
000017   DISPLAY FUNCTION TRIM(zs).
000018   STOP RUN.

