000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_255_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC 9(10) OCCURS 1000.
000008 01 K          PIC 9(10).
000009 01 N          PIC 9(10).
000010 01 X1.
000011    03 X       PIC S9(10) OCCURS 1000.
000012 01 Y1.
000013    03 Y       PIC S9(10) OCCURS 1000.
000014 01 cur        FLOAT-LONG.
000015 01 i          PIC 9(10) COMP.
000016 01 j          PIC 9(10) COMP.
000017 01 mn         FLOAT-LONG.
000018 01 mx         FLOAT-LONG VALUE ZERO.
000019 01 pt         PIC S9(10) VALUE 1.
000020 01 ans        PIC X(30).
000021 01 ln         PIC X(5000).
000022 01 zs         PIC Z(9)9.9(17).
000023 
000024 PROCEDURE DIVISION.
000025   ACCEPT ln.
000026   UNSTRING ln DELIMITED SPACE INTO N K.
000027   ACCEPT ln.
000028   PERFORM VARYING i FROM 1 BY 1 UNTIL K < i
000029     UNSTRING ln DELIMITED SPACE INTO A(i) POINTER pt
000030   END-PERFORM.
000031   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000032     ACCEPT ln
000033     UNSTRING ln DELIMITED SPACE INTO X(i) Y(i)
000034   END-PERFORM.
000035   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000036     MOVE 1000000007 TO mn
000037     PERFORM VARYING j FROM 1 BY 1 UNTIL K < j
000038       COMPUTE cur = ((x(i) - x(A(j))) ** 2
000039       + (y(i) - y(A(j))) ** 2) ** 0.5
000040       IF cur < mn MOVE cur TO mn
000041     END-PERFORM
000042     IF mx < mn MOVE mn TO mx
000043   END-PERFORM.
000044   MOVE mx TO zs.
000045   DISPLAY FUNCTION TRIM(zs).
000046   STOP RUN.

