000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_006_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 INF        PIC 9(10) VALUE 10007.
000007 01 a          PIC 9(10).
000008 01 a1         PIC 9(10) VALUE ZERO.
000009 01 a2         PIC 9(10) VALUE ZERO.
000010 01 a3         PIC 9(10) VALUE 1.
000011 01 d          PIC 9(10).
000012 01 i          PIC 9(10) COMP.
000013 01 n          PIC 9(10).
000014 01 zs         PIC Z(9)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT n.
000018   IF 1 = n THEN
000019     MOVE a1 TO a
000020   ELSE
000021     IF 2 = n THEN
000022       MOVE a2 TO a
000023     ELSE
000024       IF 3 = n THEN
000025         MOVE a3 TO a
000026       ELSE
000027         PERFORM VARYING i FROM 4 BY 1 UNTIL n < i
000028           COMPUTE a = a1 + a2
000029           DIVIDE a BY INF GIVING d REMAINDER a
000030           ADD a3 TO a
000031           DIVIDE a BY INF GIVING d REMAINDER a
000032           MOVE a2 TO a1
000033           MOVE a3 TO a2
000034           MOVE a TO a3
000035         END-PERFORM
000036       END-IF
000037     END-IF
000038   END-IF.
000039   MOVE a TO zs.
000040   DISPLAY FUNCTION TRIM(zs).
000041   STOP RUN.

