000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_031_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 D          PIC 9(10).
000008 01 ans        PIC 9(10).
000009 01 ln         PIC X(30).
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A D.
000015   COMPUTE ans = (FUNCTION MIN(A, D) + 1) * FUNCTION MAX(A, D)
000016   MOVE ans TO zs.
000017   DISPLAY FUNCTION TRIM(zs).
000018   STOP RUN.

