000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_236_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA PIC X(2800000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A          PIC 9(10).
000016 01 N          PIC 9(10).
000017 01 i          PIC 9(10).
000018 01 lst1.
000019    03 lst     PIC 9(10) VALUE ZERO
000020               OCCURS 100000 DEPENDING N INDEXED IXlst.
000021 01 pt         PIC S9(10) VALUE 1.
000022 01 zs         PIC Z(9)9.
000023 
000024 PROCEDURE DIVISION.
000025   OPEN INPUT SYSIN.
000026   READ SYSIN INTO N.
000027   READ SYSIN.
000028   CLOSE SYSIN.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL 4 * N - 1 < i
000030     UNSTRING INDATA DELIMITED SPACE INTO A POINTER pt
000031     ADD 1 TO lst(A)
000032   END-PERFORM.
000033   SET IXlst TO 1.
000034   SEARCH lst
000035     WHEN 3 = lst(IXlst)
000036       MOVE IXlst TO zs
000037   END-SEARCH.
000038   DISPLAY FUNCTION TRIM(zs).
000039   STOP RUN.

