000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_258_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A       PIC X(10) OCCURS 10 DEPENDING N.
000008 01 N          PIC 9(10).
000009 01 cur        PIC X(10).
000010 01 curx       PIC 9(10).
000011 01 cury       PIC 9(10).
000012 01 i          PIC 9(10) COMP.
000013 01 idx        PIC 9(10) COMP.
000014 01 j          PIC 9(10) COMP.
000015 01 k          PIC 9(10) COMP.
000016 01 x          PIC 9(10) COMP.
000017 01 y          PIC 9(10) COMP.
000018 01 mx         PIC X(10) VALUE SPACE.
000019 01 xy1.
000020    03 xy      OCCURS 8.
000021       05 dx   PIC S9(1).
000022       05 dy   PIC S9(1).
000023 
000024 
000025 PROCEDURE DIVISION.
000026   ACCEPT N.
000027   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000028     ACCEPT A(i)
000029   END-PERFORM.
000030   *> 下、右、上、左、右下、右上、左下、左上
000031   *> dy
000032   MOVE 1 TO dy(1).
000033   MOVE ZERO TO dy(2).
000034   MOVE -1 TO dy(3).
000035   MOVE ZERO TO dy(4).
000036   MOVE 1 TO dy(5).
000037   MOVE -1 TO dy(6).
000038   MOVE 1 TO dy(7).
000039   MOVE -1 TO dy(8).
000040   *> dx
000041   MOVE ZERO TO dx(1).
000042   MOVE 1 TO dx(2).
000043   MOVE ZERO TO dx(3).
000044   MOVE -1 TO dx(4).
000045   MOVE 1 TO dx(5).
000046   MOVE 1 TO dx(6).
000047   MOVE -1 TO dx(7).
000048   MOVE -1 TO dx(8).
000049   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000050     PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000051       PERFORM VARYING idx FROM 1 BY 1 UNTIL 8 < idx
000052         MOVE i TO cury
000053         MOVE j TO curx
000054         PERFORM VARYING k FROM 1 BY 1 UNTIL N < k
000055           MOVE A(cury)(curx:1) TO cur(k:1)
000056           ADD dy(idx) TO cury
000057           ADD dx(idx) TO curx
000058           IF N < cury MOVE 1 TO cury END-IF
000059           IF N < curx MOVE 1 TO curx END-IF
000060           IF cury < 1 MOVE N TO cury END-IF
000061           IF curx < 1 MOVE N TO curx
000062         END-PERFORM
000063         IF mx < cur move cur TO mx
000064       END-PERFORM
000065     END-PERFORM
000066   END-PERFORM.
000067   DISPLAY FUNCTION TRIM(mx).
000068   STOP RUN.

