000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_245_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(10000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 N          PIC 9(10).
000016 01 A          PIC 9(10).
000017 01 ary1.
000018    03 ary     PIC 9(1) VALUE ZERO OCCURS 2001.
000019 01 i          PIC 9(10) COMP.
000020 01 ln         PIC X(30).
000021 01 pt         PIC S9(10) VALUE 1.
000022 01 zs         PIC Z(9)9.
000023 
000024 PROCEDURE DIVISION.
000025   OPEN INPUT SYSIN.
000026   READ SYSIN INTO N.
000027   READ SYSIN.
000028   CLOSE SYSIN.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000030     UNSTRING INDATA DELIMITED SPACE INTO A POINTER pt
000031     ADD 1 TO Ary(A + 1)
000032   END-PERFORM.
000033   PERFORM VARYING i FROM 1 BY 1 UNTIL 2001 < i
000034     IF ZERO = Ary(i) COMPUTE zs = i - 1 EXIT PERFORM
000035   END-PERFORM.
000036   DISPLAY FUNCTION TRIM(zs).
000037   STOP RUN.

