000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_177_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(10).
000007 01 S          PIC 9(10).
000008 01 T          PIC 9(10).
000009 01 dv         PIC 9(10).
000010 01 ln         PIC X(30).
000011 01 rm         PIC 9(10).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO D T S.
000016   DIVIDE D BY S GIVING dv REMAINDER rm.
000017   IF dv < T THEN
000018     DISPLAY "Yes"
000019   ELSE
000020     IF T = dv AND ZERO = rm THEN
000021       DISPLAY "Yes"
000022     ELSE
000023       DISPLAY "No"
000024     END-IF
000025   END-IF.
000026   STOP RUN.

