000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_069_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 dummy      PIC X(1).
000007 01 l          PIC X(2).
000008 01 len        PIC 9(3).
000009 01 s          PIC X(100).
000010 01 tmp        PIC X(4).
000011 01 tmpl       PIC 9(2).
000012 01 zs         PIC Z(3).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT s.
000016   MOVE FUNCTION STORED-CHAR-LENGTH(s) TO len.
000017   SUBTRACT 2 FROM len GIVING tmpl.
000018   MOVE tmpl TO zs.
000019   PERFORM UNLEN.
000020   STRING
000021     s(1:1)
000022     l(1:FUNCTION STORED-CHAR-LENGTH(l))
000023     s(len:1)
000024     INTO tmp
000025   END-STRING.
000026   DISPLAY FUNCTION TRIM(tmp).
000027   STOP RUN.
000028 
000029 UNLEN SECTION.
000030   UNSTRING
000031     zs DELIMITED BY ALL SPACE
000032     INTO dummy l
000033   END-UNSTRING.

