000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_006_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 d          PIC 9(10).
000008 01 r          PIC 9(10).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT N.
000012   DIVIDE N BY 3 GIVING d REMAINDER r.
000013   IF ZERO = r THEN
000014     DISPLAY "YES"
000015   ELSE
000016     DISPLAY "NO"
000017   END-IF.
000018   STOP RUN.

