000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_051_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 s          PIC X(19).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT s.
000010   INSPECT s REPLACING ALL "," BY SPACE.
000011   DISPLAY s.
000012   STOP RUN.

