000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_266_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC S9(10)V9(11) VALUE ZERO.
000007 01 i          PIC S9(10).
000008 01 idx        PIC S9(10)V9(11) VALUE 0.0000000001.
000009 01 num        PIC S9(10)V9(11) VALUE 0.0998244353.
000010 01 q          BINARY-DOUBLE UNSIGNED.
000011 01 r          PIC 9(10)V9(11).
000012 01 s          PIC X(20).
000013 01 scale      PIC 9(11) VALUE 10000000000.
000014 01 zs         PIC Z(9)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT s.
000018   PERFORM VARYING i FROM 20 BY -1 UNTIL i <= ZERO
000019     IF "-" NOT = s(i:1) AND SPACE NOT = s(i:1)
000020       COMPUTE N = N + FUNCTION NUMVAL(s(i:1)) * idx
000021       COMPUTE idx = 10 * idx
000022     ELSE
000023       IF "-" = S(i:1)
000024         COMPUTE N = -1 * N
000025       END-IF
000026     END-IF
000027   END-PERFORM.
000028   IF ZERO <= N
000029     DIVIDE N BY num GIVING q REMAINDER r
000030     COMPUTE zs = r * scale
000031   ELSE
000032     DIVIDE N BY num GIVING q REMAINDER r
000033     COMPUTE N = N + q * num
000034     PERFORM UNTIL ZERO <= N
000035       ADD num TO N
000036     END-PERFORM
000037     COMPUTE zs = N * scale
000038   END-IF.
000039   DISPLAY FUNCTION TRIM(zs).
000040   STOP RUN.

