000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_132_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans        PIC 9(10) VALUE ZERO.
000007 01 cur        PIC 9(10) VALUE 1 COMP.
000008 01 i          PIC 9(10) VALUE 1 COMP.
000009 01 j          PIC 9(10) COMP.
000010 01 len        PIC 9(10) COMP.
000011 01 ln         PIC X(400).
000012 01 maxlen     PIC 9(10) VALUE 100 COMP.
000013 01 n          PIC 9(10).
000014 01 p1.
000015    03 p11 OCCURS 100 DEPENDING ON n.
000016       05 p    PIC S9(10).
000017 01 zs         PIC Z(9)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT n.
000021   ACCEPT ln.
000022   MOVE n TO maxlen.
000023   PERFORM maxlen TIMES
000024     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000025     END-PERFORM
000026     COMPUTE len = j - cur
000027     MOVE ln(cur:len) TO p(i)
000028     COMPUTE cur = j + 1
000029     ADD 1 TO i
000030   END-PERFORM.
000031   PERFORM VARYING i FROM 2 BY 1 UNTIL n - 1 < i
000032     IF p(i - 1) < p(i) AND p(i) < p(i + 1)
000033       ADD 1 TO ans
000034     ELSE
000035       IF p(i + 1) < p(i) AND p(i) < p(i - 1)
000036         ADD 1 TO ans
000037       END-IF
000038     END-IF
000039   END-PERFORM.
000040   MOVE ans TO zs.
000041   DISPLAY FUNCTION TRIM(zs).
000042   STOP RUN.

