000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_116_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 AB         PIC 9(10).
000008 01 BC         PIC 9(10).
000009 01 CA         PIC 9(10).
000010 01 ans        PIC 9(10).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO AB BC CA.
000016   COMPUTE ans = AB * BC / 2.
000017   MOVE ans TO zs.
000018   DISPLAY FUNCTION TRIM(zs).
000019   STOP RUN.
