000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_126_A.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 N          PIC 9(10).
000080 01 K          PIC 9(10).
000090 01 S          PIC X(50).
000100 
000110 PROCEDURE DIVISION.
000120   ACCEPT ln.
000130   UNSTRING ln DELIMITED BY SPACE INTO N K.
000140   ACCEPT S.
000150   MOVE FUNCTION LOWER-CASE(S(K:1)) TO S(K:1).
000160   DISPLAY S.
000170   STOP RUN.
