000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_039_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(3).
000007 01 AB         PIC 9(5).
000008 01 B          PIC 9(3).
000009 01 BC         PIC 9(5).
000010 01 C          PIC 9(3).
000011 01 CA         PIC 9(5).
000012 01 ln         PIC X(11).
000013 01 square     PIC 9(5).
000014 01 zs         PIC Z(6).
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT ln.
000018   UNSTRING ln DELIMITED BY SPACE INTO A B C.
000019   MULTIPLY A BY B GIVING AB.
000020   MULTIPLY B BY C GIVING BC.
000021   MULTIPLY C BY A GIVING CA.
000022   MOVE ZERO TO square.
000023   ADD AB TO square.
000024   ADD BC TO square.
000025   ADD CA TO square.
000026   MULTIPLY 2 BY square.
000027   MOVE square TO zs.
000028   DISPLAY FUNCTION TRIM(zs).
000029   STOP RUN.

