000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_256_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 P          PIC 9(10) VALUE ZERO.
000009 01 cur        PIC 9(10).
000010 01 i          PIC 9(10) COMP.
000011 01 j          PIC 9(10) COMP.
000012 01 ln         PIC X(500).
000013 01 pt         PIC S9(10) VALUE 1.
000014 01 squares1.
000015    03 squares PIC 9(10) OCCURS 4.
000016 01 zs         PIC Z(9)9.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT N.
000020   ACCEPT ln.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000022     UNSTRING ln DELIMITED SPACE INTO A POINTER pt
000023     MOVE 1 TO squares(1)
000024     PERFORM VARYING j FROM 4 BY -1 UNTIL j < 1
000025       ADD A TO j GIVING cur
000026       IF 1 = squares(j)
000027         IF 4 < cur
000028           MOVE ZERO TO squares(j)
000029           ADD 1 TO P
000030         ELSE
000031           MOVE ZERO TO squares(j)
000032           MOVE 1 TO squares(cur)
000033     END-PERFORM
000034   END-PERFORM.
000035   MOVE P TO zs.
000036   DISPLAY FUNCTION TRIM(zs).
000037   STOP RUN.

