000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_165_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 K          PIC 9(10).
000009 01 ln         PIC X(30).
000010 01 q          PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT K.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED SPACE INTO A B.
000016   DIVIDE B BY K GIVING q.
000017   IF A <= q * K
000018     DISPLAY "OK"
000019   ELSE
000020     DISPLAY "NG"
000021   END-IF.
000022   STOP RUN.

