000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_036_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 i          PIC 9(10) VALUE 1 COMP.
000008 01 j          PIC 9(10) COMP.
000009 01 N          PIC 9(10).
000010 01 s1.
000011    03 s       PIC X(50) OCCURS 50 DEPENDING ON N.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT N.
000015   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000016     ACCEPT ln
000017     PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000018       MOVE ln(j:1) TO s(j)(N - i + 1:1)
000019     END-PERFORM
000020   END-PERFORM.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000022     DISPLAY FUNCTION TRIM(s(i))
000023   END-PERFORM.
000024   STOP RUN.

