000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_065_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC S9(10).
000008 01 X          PIC 9(10).
000009 01 ln         PIC X(32).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO X A B.
000014   SUBTRACT A FROM B.
000015   IF B <= 0 THEN
000016     DISPLAY "delicious"
000017   ELSE
000018     IF B <= X THEN
000019       DISPLAY "safe"
000020     ELSE
000021       DISPLAY "dangerous"
000022     END-IF
000023   END-IF.
000024   STOP RUN.

