000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_158_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(3).
000007 01 cnt        PIC 9(10).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT S.
000011   INSPECT S TALLYING cnt FOR ALL "A".
000012   IF cnt = 1 OR 2
000013     DISPLAY "Yes"
000014   ELSE
000015     DISPLAY "No"
000016   END-IF.
000017   STOP RUN.

