000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_061_A.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC S9(3).
000007 01 B          PIC S9(3).
000008 01 C          PIC S9(3).
000009 01 ln         PIC X(14).
000010
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO A B C.
000014   IF A <= C AND C <= B THEN
000015     DISPLAY "Yes"
000016   ELSE
000017     DISPLAY "No"
000018   END-IF.
000019   STOP RUN.

