000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_260_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 X          PIC 9(10).
000008 01 Y          PIC 9(10).
000009 01 Z          PIC 9(10).
000010 01 cnt        PIC 9(10) COMP.
000011 01 i          PIC 9(10) COMP.
000012 01 ln         PIC X(4000).
000013 01 pt         PIC S9(10).
000014 01 score1.
000015    03 score OCCURS 1000 DEPENDING N.
000016       05 num  PIC 9(10).
000017       05 A    PIC 9(10).
000018       05 B    PIC 9(10).
000019       05 AB   PIC 9(10).
000020       05 pass PIC 9(1) VALUE ZERO.
000021 01 zs         PIC Z(9)9.
000022 
000023 PROCEDURE DIVISION.
000024   ACCEPT ln.
000025   UNSTRING ln DELIMITED SPACE INTO N X Y Z.
000026   ACCEPT ln.
000027   MOVE 1 TO pt.
000028   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000029     MOVE i TO num(i)
000030     UNSTRING ln DELIMITED SPACE INTO A(i) POINTER pt
000031   END-PERFORM.
000032   ACCEPT ln.
000033   MOVE 1 TO pt.
000034   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000035     UNSTRING ln DELIMITED SPACE INTO B(i) POINTER pt
000036     ADD A(i) TO B(i) GIVING AB(i)
000037   END-PERFORM.
000038   SORT score DESCENDING A ASCENDING num.
000039   MOVE ZERO TO cnt.
000040   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000041     IF X <= cnt EXIT PERFORM END-IF
000042     MOVE 1 TO pass(i) ADD 1 TO cnt
000043   END-PERFORM.
000044   SORT score DESCENDING B ASCENDING num.
000045   MOVE ZERO TO cnt.
000046   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000047     IF Y <= cnt EXIT PERFORM END-IF
000048     IF ZERO = pass(i) MOVE 1 TO pass(i) ADD 1 TO cnt
000049   END-PERFORM.
000050   SORT score DESCENDING AB ASCENDING num.
000051   MOVE ZERO TO cnt.
000052   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000053     IF Z <= cnt EXIT PERFORM END-IF
000054     IF ZERO = pass(i) MOVE 1 TO pass(i) ADD 1 TO cnt
000055   END-PERFORM.
000056   SORT score ASCENDING num.
000057   MOVE ZERO TO cnt.
000058   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000059     IF X + Y + Z <= cnt EXIT PERFORM END-IF
000060     IF pass(i) = 1 MOVE num(i) TO zs DISPLAY FUNCTION TRIM(zs)
000061   END-PERFORM.
000062   STOP RUN.

