000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_177_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(1000).
000007 01 T          PIC X(1000).
000008 01 i          PIC 9(10) COMP.
000009 01 j          PIC 9(10) COMP.
000010 01 ans        PIC 9(10) VALUE 1000.
000011 01 cur        PIC 9(10) COMP.
000012 01 flg        PIC 9(1).
000013 01 ln         PIC 9(10).
000014 01 ls         PIC 9(10).
000015 01 lt         PIC 9(10).
000016 01 zs         PIC Z(9)9.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT S.
000020   ACCEPT T.
000021   COMPUTE ls = FUNCTION STORED-CHAR-LENGTH(S).
000022   COMPUTE lt = FUNCTION STORED-CHAR-LENGTH(T).
000023   PERFORM VARYING i FROM 1 BY 1 UNTIL ls < i
000024     MOVE ZERO TO cur
000025     MOVE ZERO TO flg
000026     PERFORM VARYING j FROM i BY 1
000027     UNTIL ls < i + lt - 1 OR lt < j - i + 1
000028       MOVE 1 TO flg
000029       IF S(j:1) NOT = T(j - i + 1:1) THEN
000030         ADD 1 TO cur
000031       END-IF
000032     END-PERFORM
000033     IF ZERO < flg THEN
000034       COMPUTE ans = FUNCTION MIN(ans cur)
000035     END-IF
000036   END-PERFORM.
000037   MOVE ans TO zs.
000038   DISPLAY FUNCTION TRIM(zs).
000039   STOP RUN.

