000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_189_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC 9(10).
000007 01 P         PIC 9(10).
000008 01 V         PIC 9(10).
000009 01 X         PIC 9(10).
000010 01 alc       FLOAT-LONG VALUE ZERO.
000011 01 ans       PIC Z(9)9.
000012 01 i         PIC 9(10).
000013 01 ln        PIC X(30).
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED SPACE INTO N X.
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000019     ACCEPT ln
000020     UNSTRING ln DELIMITED SPACE INTO V P
000021     COMPUTE alc = alc + V * P / 100
000022     IF X < alc THEN
000023       EXIT PERFORM
000024     END-IF
000025   END-PERFORM.
000026   IF alc <= X THEN
000027     DISPLAY -1
000028   ELSE
000029     MOVE i TO ans
000030     DISPLAY FUNCTION TRIM(ans)
000031   END-IF.
000032   STOP RUN.

