000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_022_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC S9(10).
000007 01 N          PIC 9(10).
000008 01 S          PIC 9(10).
000009 01 T          PIC 9(10).
000010 01 cnt        PIC 9(10) VALUE ZERO COMP.
000011 01 i          PIC 9(10).
000012 01 ln         PIC X(400).
000013 01 pre        PIC S9(10) VALUE ZERO.
000014 01 zs         PIC Z(9)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT ln.
000018   UNSTRING ln DELIMITED BY SPACE INTO N S T.
000019   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000020     ACCEPT A
000021     ADD pre TO A
000022     IF S <= A AND A <= T THEN
000023       ADD 1 TO cnt
000024     END-IF
000025     MOVE A TO pre
000026   END-PERFORM.
000027   MOVE cnt TO zs.
000028   DISPLAY FUNCTION TRIM(zs).
000029   STOP RUN.

