000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_161_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X          PIC 9(10).
000007 01 Y          PIC 9(10).
000008 01 Z          PIC 9(10).
000009 01 ans        PIC X(30).
000010 01 ln         PIC X(30).
000011 01 zx         PIC Z(9)9.
000012 01 zy         PIC Z(9)9.
000013 01 zz         PIC Z(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED SPACE INTO X Y Z.
000018   MOVE X TO zx.
000019   MOVE Y TO zy.
000020   MOVE Z TO zz.
000021   STRING
000022     FUNCTION TRIM(zz)
000023     SPACE
000024     FUNCTION TRIM(zx)
000025     SPACE
000026     FUNCTION TRIM(zy)
000027   INTO ans.
000028   DISPLAY FUNCTION TRIM(ans).
000029   STOP RUN.

