000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_262_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 Y          PIC 9(4).
000007 01 q          PIC 9(4).
000008 01 r          PIC 9(4).
000009 01 year       PIC 9(4).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT Y.
000013   DIVIDE Y BY 4 GIVING q REMAINDER r.
000014   EVALUATE r
000015     WHEN ZERO COMPUTE year = Y + 2
000016     WHEN 1 COMPUTE year = Y + 1
000017     WHEN 2 MOVE Y TO year
000018     WHEN OTHER COMPUTE year = Y + 3
000019   END-EVALUATE.
000020   DISPLAY year.
000021   STOP RUN.

