000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_010_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(30).
000007 01 pp         PIC X(30).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT S.
000011   STRING
000012     FUNCTION TRIM(S)
000013     "pp"
000014     INTO pp
000015   END-STRING.
000016   DISPLAY FUNCTION TRIM(pp).
000017   STOP RUN.

