000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_108_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 a1         PIC S9(10).
000008 01 a2         PIC S9(10).
000009 01 a3         PIC S9(10).
000010 01 a4         PIC S9(10).
000011 01 ddx        PIC 9(10).
000012 01 ddy        PIC 9(10).
000013 01 dx         PIC S9(10).
000014 01 dy         PIC S9(10).
000015 01 tx         PIC S9(10).
000016 01 ty         PIC S9(10).
000017 01 x1         PIC S9(10).
000018 01 y1         PIC S9(10).
000019 01 x2         PIC S9(10).
000020 01 y2         PIC S9(10).
000021 
000022 01 A          PIC 9(10).
000023 01 B          PIC 9(10).
000024 01 ans        PIC X(30).
000025 01 za1        PIC -(5)9.
000026 01 za2        PIC -(5)9.
000027 01 za3        PIC -(5)9.
000028 01 za4        PIC -(5)9.
000029 
000030 PROCEDURE DIVISION.
000031   ACCEPT ln.
000032   UNSTRING ln DELIMITED BY SPACE INTO x1 y1 x2 y2.
000033   COMPUTE dx = x2 - x1.
000034   COMPUTE dy = y2 - y1.
000035   MOVE dx TO ddx.
000036   MOVE dy TO ddy.
000037 
000038   IF ZERO <= dx AND ZERO <= dy
000039     COMPUTE a1 = x2 - ddy
000040     COMPUTE a2 = y2 + ddx
000041     COMPUTE a3 = a1 - ddx
000042     COMPUTE a4 = a2 - ddy
000043   ELSE
000044     IF dx < ZERO AND ZERO <= dy
000045       COMPUTE a1 = x2 - ddy
000046       COMPUTE a2 = y2 - ddx
000047       COMPUTE a3 = a1 + ddx
000048       COMPUTE a4 = a2 - ddy
000049     ELSE
000050       IF dx < ZERO AND dy < ZERO
000051         COMPUTE a1 = x2 + ddy
000052         COMPUTE a2 = y2 - ddx
000053         COMPUTE a3 = a1 + ddx
000054         COMPUTE a4 = a2 + ddy
000055       ELSE
000056         COMPUTE a1 = x2 + ddy
000057         COMPUTE a2 = y2 + ddx
000058         COMPUTE a3 = a1 - ddx
000059         COMPUTE a4 = a2 + ddy
000060       END-IF
000061     END-IF
000062   END-IF.
000063 
000064   MOVE a1 TO za1.
000065   MOVE a2 TO za2.
000066   MOVE a3 TO za3.
000067   MOVE a4 TO za4.
000068 
000069   INITIALIZE ln.
000070 
000071   STRING
000072   FUNCTION TRIM(za1)
000073   SPACE
000074   FUNCTION TRIM(za2)
000075   SPACE
000076   FUNCTION TRIM(za3)
000077   SPACE
000078   FUNCTION TRIM(za4)
000079   INTO ln.
000080 
000081   DISPLAY FUNCTION TRIM(ln).
000082   STOP RUN.
