000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_189_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 C         PIC X(3).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT C.
000010   IF C(1:1) = C(2:1) AND C(3:1) THEN
000011     DISPLAY "Won"
000012   ELSE
000013     DISPLAY "Lost"
000014   END-IF.
000015   STOP RUN.

