000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_016_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(10).
000007 01 M          PIC 9(10).
000008 01 dv         PIC 9(10).
000009 01 ln         PIC X(5).
000010 01 rm         PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO M D.
000015   DIVIDE M BY D GIVING dv REMAINDER rm.
000016   IF ZERO = rm THEN
000017     DISPLAY "YES"
000018   ELSE
000019     DISPLAY "NO"
000020   END-IF.
000021   STOP RUN.

