000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_171_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC X(1).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT a.
000010   IF a <= "Z"
000011     DISPLAY "A"
000012   ELSE
000013     DISPLAY "a"
000014   END-IF.
000015   STOP RUN.

