000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_142_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA  PIC X(400000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 K          PIC 9(10).
000016 01 N          PIC 9(10).
000017 01 ans        PIC 9(10) VALUE ZERO.
000018 01 cur        PIC 9(10) VALUE 1 COMP.
000019 01 h1.
000020    03 h11 OCCURS 100000 DEPENDING ON N.
000021       05 h    PIC S9(10).
000022 01 i          PIC 9(10) VALUE 1 COMP.
000023 01 j          PIC 9(10) COMP.
000024 01 len        PIC 9(10) COMP.
000025 01 ln         PIC X(400).
000026 01 maxlen     PIC 9(10) COMP.
000027 01 zs         PIC Z(9)9.
000028 
000029 PROCEDURE DIVISION.
000030   ACCEPT ln.
000031   UNSTRING ln DELIMITED BY SPACE INTO N K.
000032   OPEN INPUT SYSIN.
000033   READ SYSIN INTO INDATA.
000034   CLOSE SYSIN.
000035   MOVE N TO maxlen.
000036   PERFORM maxlen TIMES
000037     PERFORM VARYING j FROM cur BY 1 UNTIL INDATA(j:1) = SPACE
000038     END-PERFORM
000039     COMPUTE len = j - cur
000040     MOVE INDATA(cur:len) TO h(i)
000041     IF K <= h(i)
000042       ADD 1 TO ans
000043     END-IF
000044     COMPUTE cur = j + 1
000045     ADD 1 TO i
000046   END-PERFORM.
000047   MOVE ans TO zs.
000048   DISPLAY FUNCTION TRIM(zs).
000049   STOP RUN.

