000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_267_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S1.
000007    03 S       PIC X(10) OCCURS 5 INDEXED six.
000008 01 days       PIC 9(10).
000009 01 ln         PIC X(30).
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   MOVE "Monday" TO S(1).
000015   MOVE "Tuesday" TO S(2).
000016   MOVE "Wednesday" TO S(3).
000017   MOVE "Thursday" TO S(4).
000018   MOVE "Friday" TO S(5).
000019   SEARCH S
000020     WHEN FUNCTION TRIM(S(six)) = FUNCTION TRIM(ln)
000021       MOVE six TO days
000022   END-SEARCH.
000023   COMPUTE days = 5 - days + 1.
000024   MOVE days TO zs.
000025   DISPLAY FUNCTION TRIM(zs).
000026   STOP RUN.

