000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_119_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 N          PIC 9(10).
000008 01 u          PIC X(3).
000009 01 x          PIC 9(10)V9(8).
000010 01 ans        PIC 9(10)V9(8) VALUE ZERO.
000011 01 zs         PIC Z(9)9.9(8).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT N.
000015   PERFORM N TIMES
000016     ACCEPT ln
000017     UNSTRING ln DELIMITED BY SPACE INTO x u
000018     IF "BTC" = u
000019       COMPUTE ans = ans + 380000.0 * x
000020     ELSE
000021       ADD x TO ans
000022     END-IF
000023   END-PERFORM
000024   MOVE ans TO zs.
000025   DISPLAY FUNCTION TRIM(zs).
000026   STOP RUN.
