000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_228_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA PIC X(700000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A1.
000016    03 A      PIC 9(10) OCCURS 100000 DEPENDING N.
000017 01 N         PIC 9(10).
000018 01 X         PIC 9(10).
000019 01 ans       PIC 9(10) COMP.
000020 01 bools1.
000021    03 bools  PIC 9(10) VALUE ZERO OCCURS 100000 DEPENDING N.
000022 01 friend    PIC 9(10).
000023 01 i         PIC 9(10) COMP.
000024 01 pt        PIC 9(10) VALUE 1.
000025 01 zs        PIC Z(9)9.
000026 
000027 PROCEDURE DIVISION.
000028   OPEN INPUT SYSIN.
000029   READ SYSIN.
000030   UNSTRING INDATA DELIMITED SPACE INTO N X.
000031   READ SYSIN.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000033     UNSTRING INDATA DELIMITED SPACE INTO A(i) POINTER pt
000034   END-PERFORM.
000035   CLOSE SYSIN.
000036   MOVE X TO friend.
000037   PERFORM UNTIL ZERO NOT = bools(friend)
000038     ADD 1 TO ans
000039     MOVE 1 TO bools(friend)
000040     MOVE A(friend) TO friend
000041   END-PERFORM.
000042   MOVE ans TO zs.
000043   DISPLAY FUNCTION TRIM(zs).
000044   STOP RUN.

