000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_124_A.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 ans        PIC 9(10).
000080 01 zs         PIC Z(9)9.
000090 01 A          PIC 9(10).
000100 01 B          PIC 9(10).
000110 
000120 PROCEDURE DIVISION.
000130   ACCEPT ln.
000140   UNSTRING ln DELIMITED BY SPACE INTO A B.
000150   IF A = B
000160     COMPUTE ans = 2 * A
000170   ELSE
000180     COMPUTE ans = 2 * FUNCTION MAX(A B) - 1
000190   END-IF.
000200   MOVE ans TO zs.
000210   DISPLAY FUNCTION TRIM(zs).
000220   STOP RUN.
