000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_120_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 A          PIC 9(10).
000008 01 D          PIC 9(10).
000009 01 B          PIC 9(10).
000010 01 K          PIC 9(10).
000011 01 R          PIC 9(10).
000012 01 i          PIC 9(10) VALUE 1.
000013 01 j          PIC 9(10) VALUE 1.
000014 01 n          PIC 9(10).
000015 01 numa       PIC 9(10).
000016 01 numb       PIC 9(10).
000017 01 numc       PIC 9(10).
000018 01 zs         PIC Z(9)9.
000019 01 LA1.
000020    03 LA11 OCCURS 100 INDEXED BY XA.
000021       05 LA    PIC 9(10) VALUE ZERO.
000022 01 LB1.
000023    03 LB11 OCCURS 100 INDEXED BY XB.
000024       05 LB    PIC 9(10) VALUE ZERO.
000025 01 LC1.
000026    03 LC11 OCCURS 100 INDEXED BY XC.
000027       05 LC    PIC 9(10) VALUE ZERO.
000028 
000029 PROCEDURE DIVISION.
000030   ACCEPT ln.
000031   UNSTRING ln DELIMITED BY SPACE INTO A B K.
000032 
000033   MOVE A TO n.
000034   MOVE ZERO TO numa.
000035   SET XA TO 1.
000036 
000037   PERFORM UNTIL FUNCTION SQRT(n) < i
000038     DIVIDE i INTO n GIVING D REMAINDER R
000039     IF ZERO = R
000040       MOVE i TO LA(XA)
000041       ADD 1 TO numa
000042       IF D NOT = i
000043         ADD 1 TO XA
000044         MOVE D TO LA(XA)
000045         ADD 1 TO numa
000046       END-IF
000047       ADD 1 TO XA
000048     END-IF
000049     ADD 1 TO i
000050   END-PERFORM.
000051 
000052   MOVE B TO n.
000053   MOVE ZERO TO numb.
000054   SET XB TO 1.
000055 
000056   PERFORM UNTIL FUNCTION SQRT(n) < j
000057     DIVIDE j INTO n GIVING D REMAINDER R
000058     IF ZERO = R
000059       MOVE j TO LB(XB)
000060       ADD 1 TO numb
000061       IF D NOT = j
000062         ADD 1 TO XB
000063         MOVE D TO LB(XB)
000064         ADD 1 TO numb
000065       END-IF
000066       ADD 1 TO XB
000067     END-IF
000068     ADD 1 TO j
000069   END-PERFORM.
000070 
000071   SORT LA11 DESCENDING LA.
000072   SORT LB11 DESCENDING LB.
000073 
000074   MOVE 1 TO i.
000075   MOVE 1 TO j.
000076   SET XA TO 1.
000077   SET XB TO 1.
000078   SET XC TO 1.
000079 
000080   PERFORM UNTIL numa < i
000081     PERFORM UNTIL numb < j
000082       IF LA(XA) = LB(XB)
000083         MOVE LA(XA) TO LC(XC)
000084         ADD 1 TO numc
000085         ADD 1 TO XA
000086         ADD 1 TO XB
000087         ADD 1 TO XC
000088         ADD 1 TO i
000089         ADD 1 TO j
000090       ELSE
000091         IF LA(XA) < LB(XB)
000092           ADD 1 TO XB
000093           ADD 1 TO j
000094         ELSE
000095           ADD 1 TO XA
000096           ADD 1 TO i
000097       END-IF
000098     END-PERFORM
000099   END-PERFORM.
000100 
000101   MOVE LC(K) TO zs.
000102   DISPLAY FUNCTION TRIM(zs).
000103   STOP RUN.
