000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_096_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ABC1.
000007    03 ABC11 OCCURS 3.
000008       05 ABC  PIC 9(2).
000009 01 K          PIC 9(2).
000010 01 cur        PIC 9(2) VALUE 1.
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(2).
000014 01 ln         PIC X(30).
000015 01 maxlen     PIC 9(1) VALUE 3.
000016 01 mx         PIC 9(5).
000017 01 tmp        PIC 9(5).
000018 01 zs         PIC Z(6).
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT ln.
000022   ACCEPT K.
000023   PERFORM maxlen TIMES
000024     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000025     END-PERFORM
000026     COMPUTE len = j - cur
000027     MOVE ln(cur:len) TO ABC(i)
000028     COMPUTE cur = j + 1
000029     ADD 1 TO i
000030   END-PERFORM.
000031   ADD ABC(1) ABC(2) ABC(3) TO tmp.
000032   COMPUTE mx = FUNCTION MAX(ABC(1), ABC(2), ABC(3)).
000033   SUBTRACT mx FROM tmp.
000034   COMPUTE mx = mx * (2 ** K).
000035   ADD mx TO tmp.
000036   MOVE tmp TO zs.
000037   DISPLAY FUNCTION TRIM(zs).
000038   STOP RUN.

