000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_263_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 P1.
000008    03 P       PIC 9(10) OCCURS 50.
000009 01 ans        PIC 9(10) VALUE 1.
000010 01 flg        PIC 9(1) VALUE ZERO.
000011 01 i          PIC 9(10) COMP.
000012 01 idx        PIC 9(10).
000013 01 ln         PIC X(400).
000014 01 pt         PIC S9(10) VALUE 1.
000015 01 zs         PIC Z(9)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT N.
000019   ACCEPT ln.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL N - 1 < i
000021     UNSTRING ln DELIMITED SPACE INTO P(i) POINTER pt
000022   END-PERFORM.
000023   SUBTRACT 1 FROM N GIVING idx.
000024   PERFORM UNTIL 1 = P(idx)
000025     MOVE P(idx) TO idx
000026     SUBTRACT 1 FROM idx
000027     ADD 1 TO ans
000028   END-PERFORM.
000029   MOVE ans TO zs.
000030   DISPLAY FUNCTION TRIM(zs).
000031   STOP RUN.

