000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_123_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(10).
000007 01 b          PIC 9(10).
000008 01 c          PIC 9(10).
000009 01 d          PIC 9(10).
000010 01 e          PIC 9(10).
000011 01 k          PIC 9(10).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT a.
000015   ACCEPT b.
000016   ACCEPT c.
000017   ACCEPT d.
000018   ACCEPT e.
000019   ACCEPT k.
000020   IF e - a <= k
000021     DISPLAY "Yay!"
000022   ELSE
000023     DISPLAY ":("
000024   END-IF.
000025   STOP RUN.
