000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_215_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC X(19).
000007 01 flnum     PIC 9(9)V9(10).
000008 01 i         PIC S9(10) COMP.
000009 01 j         PIC 9(10) VALUE 20.
000010 01 len       PIC 9(10).
000011 01 num       PIC 9(9)V9(10) VALUE 0.0000000001.
000012 01 two       BINARY-DOUBLE VALUE 2.
000013 01 xnum      PIC X(20) VALUE "000000000.0000000000".
000014 01 zs        PIC Z(18)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT N.
000018   MOVE FUNCTION STORED-CHAR-LENGTH(N) TO len.
000019   PERFORM VARYING i FROM len BY -1 UNTIL i <= ZERO
000020     IF j NOT = 10 MOVE N(i:1) TO xnum(j:1)
000021     ELSE SUBTRACT 1 FROM j MOVE N(i:1) TO xnum(j:1)
000022     END-IF
000023     SUBTRACT 1 FROM j
000024   END-PERFORM.
000025   MOVE xnum TO flnum.
000026   MOVE ZERO TO i.
000027   PERFORM WITH TEST AFTER
000028   VARYING i FROM ZERO BY 1 UNTIL flnum < num
000029     MULTIPLY two BY num
000030   END-PERFORM.
000031   MOVE i TO zs.
000032   DISPLAY FUNCTION TRIM(zs).
000033   STOP RUN.

