000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_229_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S1         PIC X(2).
000007 01 S2         PIC X(2).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT S1.
000011   ACCEPT S2.
000012   IF "#" = S1(1:1) AND S2(2:1) AND "#" NOT = S1(2:1) AND S2(1:1)
000013     DISPLAY "No"
000014   ELSE IF "#" = S1(2:1) AND S2(1:1)
000015   AND "#" NOT = S1(1:1) AND S2(2:1)
000016     DISPLAY "No"
000017   ELSE
000018     DISPLAY "Yes".
000019   STOP RUN.

