000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_201_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ST1.
000008    03 ST      OCCURS 1000 DEPENDING N.
000009       05 S    PIC X(15).
000010       05 T    PIC 9(10).
000011 01 B          PIC 9(10).
000012 01 i          PIC 9(10) COMP.
000013 01 ln         PIC X(30).
000014 01 pt         PIC S9(10) VALUE 1.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT N.
000018   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000019     ACCEPT ln
000020     UNSTRING ln DELIMITED SPACE INTO S(i) T(i)
000021   END-PERFORM.
000022   SORT ST DESCENDING T.
000023   DISPLAY FUNCTION TRIM(S(2)).
000024   STOP RUN.

