000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_076_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 G          PIC 9(4).
000007 01 R          PIC S9(4).
000008 01 zs         PIC -(5)9.
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT R.
000012   ACCEPT G.
000013   SUBTRACT R FROM G GIVING R.
000014   ADD G TO R.
000015   MOVE R TO zs.
000016   DISPLAY FUNCTION TRIM(zs).
000017   STOP RUN.

