000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_146_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012    01 INDATA  PIC X(10000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 N          PIC 9(10).
000016 01 S          PIC X(10000).
000017 01 alp        PIC X(26) VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
000018 01 ans        PIC X(10000).
000019 01 cnt        PIC 9(10) VALUE 26.
000020 01 f          PIC X(26).
000021 01 i          PIC 9(10) COMP.
000022 01 j          PIC 9(10) COMP.
000023 01 t          PIC X(26).
000024 
000025 PROCEDURE DIVISION.
000026   ACCEPT N.
000027   OPEN INPUT SYSIN.
000028   READ SYSIN INTO INDATA.
000029   CLOSE SYSIN.
000030   MOVE INDATA TO S.
000031   MOVE alp TO f.
000032   STRING alp(N + 1 : cnt - N) alp(1 : N) INTO t.
000033   PERFORM TRAN.
000034   DISPLAY FUNCTION TRIM(ans).
000035   STOP RUN.
000036 
000037 TRAN SECTION.
000038   PERFORM VARYING i FROM 1 BY 1
000039   UNTIL FUNCTION STORED-CHAR-LENGTH(S) < i
000040     PERFORM VARYING j FROM 1 BY 1 UNTIL cnt < j
000041       IF S(i : 1) = f(j : 1)
000042         EXIT PERFORM
000043       END-IF
000044     END-PERFORM
000045     MOVE t(j : 1) TO ans(i : 1)
000046   END-PERFORM.

