000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_191_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA    PIC X(1100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A         PIC 9(10).
000016 01 N         PIC 9(10).
000017 01 X         PIC 9(10).
000018 01 ans       PIC X(1100000) VALUE SPACE.
000019 01 i         PIC 9(10) COMP.
000020 01 ln        PIC X(1100000).
000021 01 str       PIC Z(9)9.
000022 01 pt        PIC S9(10) VALUE 1.
000023 01 pta       PIC S9(10) VALUE 1.
000024 
000025 PROCEDURE DIVISION.
000026   OPEN INPUT SYSIN.
000027   READ SYSIN INTO ln.
000028   UNSTRING ln DELIMITED SPACE INTO N X.
000029   READ SYSIN INTO ln.
000030   CLOSE SYSIN.
000031   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000032     UNSTRING ln DELIMITED SPACE INTO A WITH POINTER pt
000033     IF A NOT = X THEN
000034       MOVE A TO str
000035       STRING
000036         SPACE
000037         FUNCTION TRIM(str)
000038         INTO ans
000039         WITH POINTER pta
000040       END-STRING
000041     END-IF
000042   END-PERFORM.
000043   DISPLAY FUNCTION TRIM(ans).
000044   STOP RUN.

