000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_164_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 D          PIC 9(10).
000010 01 ak         PIC 9(10).
000011 01 ln         PIC X(15).
000012 01 tk         PIC 9(10).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO A B C D.
000017   COMPUTE tk = (C + B - 1) / B.
000018   COMPUTE ak = (A + D - 1) / D.
000019   IF tk <= ak
000020     DISPLAY "Yes"
000021   ELSE
000022     DISPLAY "No"
000023   END-IF.
000024   STOP RUN.

