000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_129_B.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 maxlen     PIC 9(10) VALUE 100 COMP.
000080 01 cur        PIC 9(10) VALUE 1 COMP.
000090 01 i          PIC 9(10) VALUE 1 COMP.
000100 01 j          PIC 9(10) COMP.
000110 01 k          PIC 9(10) COMP.
000120 01 len        PIC 9(10) COMP.
000130 01 ans        PIC 9(10) VALUE 1000000007.
000140 01 num        PIC 9(10) VALUE ZERO.
000150 01 df         PIC 9(10) VALUE ZERO.
000160 01 sm         PIC 9(10) VALUE ZERO.
000170 01 zs         PIC Z(9)9.
000180 01 N          PIC 9(10).
000190 01 W1.
000200    03 W11 OCCURS 100 DEPENDING ON N.
000210       05 W    PIC S9(10).
000220 
000230 PROCEDURE DIVISION.
000240   ACCEPT N.
000250   ACCEPT ln.
000260   MOVE N TO maxlen.
000270   PERFORM maxlen TIMES
000280     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000290     END-PERFORM
000300     COMPUTE len = j - cur
000310     MOVE ln(cur:len) TO W(i)
000320     ADD W(i) TO sm
000330     COMPUTE cur = j + 1
000340     ADD 1 TO i
000350   END-PERFORM.
000360   PERFORM VARYING k FROM 1 BY 1 UNTIL N < k
000370     ADD W(k) TO num
000380     COMPUTE df = sm - 2 * num
000390     IF df < ans
000400       COMPUTE ans = df
000410     END-IF
000420   END-PERFORM.
000430   MOVE ans TO zs.
000440   DISPLAY FUNCTION TRIM(zs).
000450   STOP RUN.
