000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_128_A.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 ans        PIC 9(10).
000080 01 zs         PIC Z(9)9.
000090 01 A          PIC 9(10).
000100 01 P          PIC 9(10).
000110 
000120 PROCEDURE DIVISION.
000130   ACCEPT ln.
000140   UNSTRING ln DELIMITED BY SPACE INTO A P.
000150   COMPUTE ans = (A * 3 + P) / 2.
000160   MOVE ans TO zs.
000170   DISPLAY FUNCTION TRIM(zs).
000180   STOP RUN.
