000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_244_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 N          PIC 9(10).
000016 01 direction  PIC X(1) VALUE "E".
000017 01 i          PIC 9(10) COMP.
000018 01 x          PIC S9(10) COMP.
000019 01 y          PIC S9(10) COMP.
000020 01 zsx        PIC -(9)9.
000021 01 zsy        PIC -(9)9.
000022 
000023 PROCEDURE DIVISION.
000024   OPEN INPUT SYSIN.
000025   READ SYSIN INTO N.
000026   READ SYSIN.
000027   CLOSE SYSIN.
000028   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000029     IF "R" = INDATA(i:1)
000030       IF "E" = direction
000031         MOVE "S" TO direction
000032       ELSE
000033         IF "S" = direction MOVE "W" TO direction
000034         ELSE
000035          IF "W" = direction MOVE "N" TO direction
000036          ELSE MOVE "E" TO direction
000037          END-IF
000038         END-IF
000039       END-IF
000040     ELSE
000041       IF "E" = direction
000042         ADD 1 TO x
000043       ELSE
000044         IF "S" = direction ADD -1 TO y
000045         ELSE
000046           IF "W" = direction ADD -1 TO x
000047           ELSE ADD 1 TO y
000048           END-IF
000049         END-IF
000050       END-IF
000051     END-IF
000052   END-PERFORM.
000053   MOVE x TO zsx.
000054   MOVE y TO zsy.
000055   DISPLAY FUNCTION TRIM(zsx) SPACE FUNCTION TRIM(zsy).
000056   STOP RUN.

