000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_154_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S              PIC X(100).
000007 01 ans            PIC X(100).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT S.
000011   MOVE ALL "x" TO ans(1:FUNCTION STORED-CHAR-LENGTH(S))
000012   DISPLAY FUNCTION TRIM(ans).
000013   STOP RUN.

