000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_236_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(10).
000007 01 a          PIC 9(10).
000008 01 b          PIC 9(10).
000009 01 chr        PIC X(1).
000010 01 ln         PIC X(30).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT S.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED SPACE INTO a b.
000016   MOVE S(b:1) TO chr.
000017   MOVE S(a:1) TO S(b:1).
000018   MOVE chr TO S(a:1).
000019   DISPLAY FUNCTION TRIM(S).
000020   STOP RUN.

