000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_178_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 x          PIC 9(10).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT x.
000010   IF ZERO = x THEN
000011     DISPLAY 1
000012   ELSE
000013     DISPLAY ZERO
000014   END-IF.
000015   STOP RUN.

