000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_126_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(4).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT S.
000010   IF (S(1:2) < "01" OR "12" < S(1:2))
000011   AND (S(3:2) < "01" OR "12" < S(3:2))
000012     DISPLAY "NA"
000013   ELSE
000014     IF (S(1:2) < "01" OR "12" < S(1:2))
000015     AND ("01" <= S(3:2) AND S(3:2) <= "12")
000016       DISPLAY "YYMM"
000017     ELSE
000018       IF ("01" <= S(1:2) AND S(1:2) <= "12")
000019       AND (S(3:2) < "01" OR "12" < S(3:2))
000020         DISPLAY "MMYY"
000021       ELSE
000022         DISPLAY "AMBIGUOUS"
000023   END-IF.
000024   STOP RUN.
