000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_040_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(7).
000007 01 n          PIC 9(3).
000008 01 tmp        PIC 9(3).
000009 01 x          PIC 9(3).
000010 01 zs         PIC Z(3)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO n x.
000015   COMPUTE tmp = FUNCTION MIN (x - 1, n - x).
000016   MOVE tmp TO zs.
000017   DISPLAY FUNCTION TRIM(zs).
000018   STOP RUN.

