000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. PROGRAM_ID.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 a          PIC 9(10).
000070 01 b          PIC 9(10).
000080 01 c          PIC 9(10).
000090 01 d          PIC 9(10).
000100 01 e          PIC 9(10).
000110 01 k          PIC 9(10).
000120 
000130 PROCEDURE DIVISION.
000140   ACCEPT a.
000150   ACCEPT b.
000160   ACCEPT c.
000170   ACCEPT d.
000180   ACCEPT e.
000190   ACCEPT k.
000200   IF e - a <= k
000210     DISPLAY "Yay!"
000220   ELSE
000230     DISPLAY ":("
000240   END-IF.
000250   STOP RUN.
