000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_105_D.
000003 ENVIRONMENT DIVISION.
000004 INPUT-OUTPUT SECTION.
000005 FILE-CONTROL.
000006 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000007 
000008 DATA DIVISION.
000009 FILE SECTION.
000010 FD SYSIN.
000011 01 INDATA     PIC X(1100000).
000012 
000013 WORKING-STORAGE SECTION.
000014 01 INP     PIC X(1100000).
000015 01 N       PIC 9(6).
000016 01 NM      PIC X(17).
000017 01 M       PIC 9(10).
000018 01 X_MAX   PIC 9(10) VALUE 9999999999.
000019 01 X1.
000020    03 X    PIC 9(10) OCCURS 100000 DEPENDING maxlen.
000021 01 Y1.
000022    03 YNUM PIC 9(6) VALUE ZERO.
000023    03 Y11 OCCURS 100000.
000024       05 Y PIC 9(10).
000025       05 YCNT PIC 9(6) VALUE ZERO.
000026 01 ans     PIC X(18).
000027 01 bk      PIC 9(10).
000028 01 cur     PIC 9(7) VALUE 1.
000029 01 flg     PIC 9(1).
000030 01 i       PIC 9(7) VALUE 1.
000031 01 j       PIC 9(7).
000032 01 len     PIC 9(7).
000033 01 maxlen  PIC 9(7).
000034 01 r       PIC 9(10).
000035 01 sm      PIC 9(18).
000036 01 tmp     PIC 9(10).
000037 01 xd      PIC 9(15).
000038 01 xr      PIC 9(10).
000039 01 zs      PIC Z(18)9.
000040 
000041 PROCEDURE DIVISION.
000042   ACCEPT NM.
000043   UNSTRING NM
000044   DELIMITED BY SPACE
000045   INTO N M.
000046   OPEN INPUT SYSIN.
000047   READ SYSIN INTO INP.
000048   CLOSE SYSIN.
000049   MOVE N TO maxlen.
000050   MOVE ZERO TO sm.
000051   PERFORM maxlen TIMES
000052     PERFORM VARYING j FROM cur BY 1
000053       UNTIL INP(j:1) = SPACE
000054     END-PERFORM
000055     COMPUTE len = j - cur
000056     MOVE INP(cur:len) TO tmp
000057     ADD tmp TO sm
000058     DIVIDE M INTO sm GIVING xd REMAINDER xr
000059     MOVE xr TO X(i)
000060     COMPUTE cur = j + 1
000061     ADD 1 TO i
000062   END-PERFORM.
000063   SORT X ASCENDING X.
000064   MOVE X_MAX TO bk.
000065   PERFORM VARYING i FROM 1 BY 1 UNTIL maxlen < i
000066   IF bk = X(i) THEN
000067     ADD 1 TO YCNT(YNUM)
000068   ELSE
000069     MOVE X(i) TO bk
000070     ADD 1 TO YNUM
000071     MOVE X(i) TO Y(YNUM)
000072     ADD 1 TO YCNT(YNUM)
000073   END-IF
000074   END-PERFORM.
000075   MOVE ZERO TO sm.
000076   PERFORM VARYING i FROM 1 BY 1 UNTIL YNUM < i
000077 *> pair
000078   COMPUTE sm = sm + YCNT(i) * (YCNT(i) - 1) / 2
000079 *> alone
000080     IF ZERO = Y(i)
000081       COMPUTE sm = sm + YCNT(i)
000082     END-IF
000083   END-PERFORM.
000084   MOVE sm TO zs.
000085   DISPLAY FUNCTION TRIM(zs).
000086   STOP RUN.

