000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_208_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A         PIC 9(10).
000007 01 B         PIC 9(10).
000008 01 ln        PIC X(30).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT ln.
000012   UNSTRING ln DELIMITED SPACE INTO A B.
000013   IF B <= 6 * A AND A <= B DISPLAY "Yes" ELSE DISPLAY "No".
000014   STOP RUN.

