000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_015_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 bug        PIC 9(10) VALUE ZERO.
000009 01 cur        PIC 9(10) VALUE 1 COMP.
000010 01 d          PIC 9(10).
000011 01 i          PIC 9(10) VALUE 1 COMP.
000012 01 j          PIC 9(10) COMP.
000013 01 len        PIC 9(10) COMP.
000014 01 ln         PIC X(400).
000015 01 maxlen     PIC 9(10) VALUE 100 COMP.
000016 01 pgm        PIC 9(10) VALUE ZERO COMP.
000017 01 r          PIC 9(10).
000018 01 zs         PIC Z(9)9.
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT N.
000022   ACCEPT ln.
000023   MOVE N TO maxlen.
000024   PERFORM maxlen TIMES
000025     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000026     END-PERFORM
000027     COMPUTE len = j - cur
000028     MOVE ln(cur:len) TO A
000029     ADD A TO bug
000030     IF ZERO NOT = A THEN
000031       ADD 1 TO pgm
000032     END-IF
000033     COMPUTE cur = j + 1
000034     ADD 1 TO i
000035   END-PERFORM.
000036   DIVIDE bug BY pgm GIVING d REMAINDER r.
000037   IF ZERO NOT = r THEN
000038     ADD 1 TO d
000039   END-IF.
000040   MOVE d TO zs.
000041   DISPLAY FUNCTION TRIM(zs).
000042   STOP RUN.

