000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_210_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 N          PIC 9(10).
000008 01 X          PIC 9(10).
000009 01 Y          PIC 9(10).
000010 01 ans        PIC Z(9)9.
000011 01 ln         PIC X(30).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED SPACE INTO N A X Y.
000016   IF N <= A COMPUTE ans = N * X
000017   ELSE COMPUTE ans = A * X + (N - A) * Y.
000018   DISPLAY FUNCTION TRIM(ans).
000019   STOP RUN.

