000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_196_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC S9(10).
000007 01 ans        PIC -(9)9.
000008 01 b          PIC S9(10).
000009 01 c          PIC S9(10).
000010 01 d          PIC S9(10).
000011 01 ln         PIC X(30).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO a b.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED BY SPACE INTO c d.
000018   SUBTRACT c FROM b GIVING ans.
000019   DISPLAY FUNCTION TRIM(ans).
000020   STOP RUN.

