000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_037_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(4).
000007 01 B          PIC 9(4).
000008 01 C          PIC 9(7).
000009 01 ln         PIC X(17).
000010 01 zs         PIC Z(7)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A B C.
000015   COMPUTE A = FUNCTION MIN(A, B).
000016   DIVIDE A INTO C.
000017   MOVE C TO zs.
000018   DISPLAY FUNCTION TRIM(zs).
000019   STOP RUN.

