000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_059_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(32).
000007 01 s1         PIC X(10).
000008 01 s2         PIC X(10).
000009 01 s3         PIC X(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO s1 s2 s3.
000014   MOVE FUNCTION UPPER-CASE(s1) TO s1.
000015   MOVE FUNCTION UPPER-CASE(s2) TO s2.
000016   MOVE FUNCTION UPPER-CASE(s3) TO s3.
000017   DISPLAY s1(1:1) s2(1:1) s3(1:1).
000018   STOP RUN.

