000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_023_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X          PIC X(2).
000007 01 X1         PIC 9(10).
000008 01 X2         PIC 9(10).
000009 01 ans        PIC 9(10) VALUE ZERO.
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT X.
000014   MOVE X(1:1) TO X1.
000015   MOVE X(2:1) TO X2.
000016   ADD X1 TO ans.
000017   ADD X2 TO ans.
000018   MOVE ans TO zs.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

