000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_083_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(2).
000007 01 B          PIC 9(2).
000008 01 N          PIC 9(5).
000009 01 R          PIC 9(5).
000010 01 X          PIC 9(5).
000011 01 i          PIC 9(5).
000012 01 ln         PIC X(10).
000013 01 num        PIC 9(3).
000014 01 sm         PIC 9(10).
000015 01 zs         PIC Z(9)9.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   UNSTRING ln DELIMITED BY SPACE INTO N A B.
000020   MOVE 0 TO sm.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000022     MOVE i TO X
000023     MOVE 0 TO num
000024     PERFORM UNTIL X <= 0
000025       DIVIDE 10 INTO X GIVING X REMAINDER R
000026       ADD R TO num
000027     END-PERFORM
000028     IF A <= num AND num <= B THEN
000029       ADD i TO sm
000030     END-IF
000031   END-PERFORM.
000032   MOVE sm TO zs.
000033   DISPLAY FUNCTION TRIM(zs).
000034   STOP RUN.

