000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_267_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(30).
000007 01 clm1.
000008    03 clm     PIC X(1) OCCURS 7.
000009 01 flg        PIC 9(1) VALUE ZERO.
000010 01 i          PIC 9(10) COMP.
000011 01 j          PIC 9(10) COMP.
000012 01 k          PIC 9(10) COMP.
000013 01 zs         PIC Z(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT S.
000017   MOVE S(7:1) TO clm(1).
000018   MOVE S(4:1) TO clm(2).
000019   MOVE FUNCTION MAX(S(2:1) S(8:1)) TO clm(3)
000020   MOVE FUNCTION MAX(S(1:1) S(5:1)) TO clm(4)
000021   MOVE FUNCTION MAX(S(3:1) S(9:1)) TO clm(5)
000022   MOVE S(6:1) TO clm(6).
000023   MOVE S(10:1) TO clm(7).
000024   IF "1" = S(1:1) DISPLAY "No" STOP RUN END-IF.
000025   PERFORM VARYING i FROM 1 BY 1 UNTIL 7 < i
000026     ADD 1 TO i GIVING j
000027     PERFORM VARYING j FROM j BY 1 UNTIL 7 < j
000028       IF "1" = clm(i) AND "1" = clm(j)
000029         ADD 1 TO i GIVING k
000030         PERFORM VARYING k FROM k BY 1 UNTIL j - 1 < k
000031           IF ZERO = clm(k) MOVE 1 TO flg EXIT PERFORM END-IF
000032         END-PERFORM
000033         IF 1 = flg EXIT PERFORM END-IF
000034       END-IF
000035     END-PERFORM
000036     IF 1 = flg EXIT PERFORM END-IF
000037   END-PERFORM.
000038   IF 1 = flg DISPLAY "Yes" ELSE DISPLAY "No".
000039   STOP RUN.

