000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_012_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        PIC X(30).
000008 01 hour       PIC 9(2).
000009 01 min        PIC 9(2).
000010 01 sec        PIC 9(2).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   DIVIDE N BY 60 GIVING N REMAINDER sec.
000015   DIVIDE N BY 60 GIVING N REMAINDER min.
000016   DIVIDE N BY 60 GIVING N REMAINDER hour.
000017   STRING
000018     hour
000019     ":"
000020     min
000021     ":"
000022     sec INTO ans
000023   END-STRING.
000024   DISPLAY FUNCTION TRIM(ans).
000025   STOP RUN.

