000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_136_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        PIC 9(10) VALUE ZERO.
000008 01 i          PIC 9(10) COMP.
000009 01 num        PIC 9(10).
000010 01 qt         PIC 9(10).
000011 01 rm         PIC 9(10).
000012 01 zs         PIC Z(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000017     COMPUTE num = FUNCTION LOG10(i)
000018     ADD 1 TO num
000019     DIVIDE num BY 2 GIVING qt REMAINDER rm
000020     IF rm = 1
000021       ADD 1 TO ans
000022     END-IF
000023   END-PERFORM.
000024   MOVE ans TO zs.
000025   DISPLAY FUNCTION TRIM(zs).
000026   STOP RUN.

