000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_092_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11 OCCURS 100.
000008       05 A    PIC 9(3).
000009 01 DX1.
000010    03 DX11 OCCURS 2.
000011       05 DX   PIC 9(3).
000012 01 N          PIC 9(3).
000013 01 R          PIC 9(3).
000014 01 X          PIC 9(3).
000015 01 cur        PIC 9(8) VALUE 1.
000016 01 i          PIC 9(18) VALUE 1.
000017 01 j          PIC 9(18).
000018 01 k          PIC 9(3).
000019 01 len        PIC 9(8).
000020 01 ln         PIC X(8).
000021 01 maxlen     PIC 9(1) VALUE 2.
000022 01 p          PIC 9(3).
000023 01 q          PIC 9(3).
000024 01 sm         PIC 9(5).
000025 01 zs         PIC Z(6).
000026 
000027 PROCEDURE DIVISION.
000028   ACCEPT N.
000029   ACCEPT ln.
000030   PERFORM maxlen TIMES
000031     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000032     END-PERFORM
000033     COMPUTE len = j - cur
000034     MOVE ln(cur:len) TO DX(i)
000035     COMPUTE cur = j + 1
000036     ADD 1 TO i
000037   END-PERFORM.
000038   PERFORM VARYING k FROM 1 BY 1 UNTIL N < k
000039     ACCEPT A(k)
000040   END-PERFORM.
000041   MOVE 0 TO sm.
000042   PERFORM VARYING p FROM 0 BY 1 UNTIL DX(1) < p + 1
000043     PERFORM VARYING q FROM 1 BY 1 UNTIL N < q
000044       IF p = 0 THEN
000045         ADD 1 TO sm
000046       ELSE
000047         DIVIDE A(q) INTO p GIVING X REMAINDER R
000048         IF R = 0 THEN
000049           ADD 1 TO sm
000050         END-IF
000051       END-IF
000052     END-PERFORM
000053   END-PERFORM.
000054   ADD DX(2) TO sm.
000055   MOVE sm TO zs.
000056   DISPLAY FUNCTION TRIM(zs).
000057   STOP RUN.

