000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_068_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC X(3).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT N.
000010   DISPLAY "ABC" N.
000011   STOP RUN.

