000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_050_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC S9(10).
000008 01 ln         PIC X(23).
000009 01 op         PIC X(1).
000010 01 zs         PIC -(10)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A op B.
000015   IF op = '+' THEN
000016     ADD A TO B
000017   ELSE
000018     SUBTRACT B FROM A GIVING B
000019   END-IF.
000020   MOVE B TO zs.
000021   DISPLAY FUNCTION TRIM(zs).
000022   STOP RUN.

