000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_200_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC 9(10).
000007 01 ans       PIC Z(9)9.
000008 01 d         PIC 9(10).
000009 01 r         PIC 9(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT N.
000013   DIVIDE N BY 100 GIVING d REMAINDER r.
000014   IF ZERO < r ADD 1 TO d GIVING ans ELSE MOVE d TO ans.
000015   DISPLAY FUNCTION TRIM(ans).
000016   STOP RUN.

