000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_259_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(10).
000007 01 M          PIC 9(10).
000008 01 N          PIC 9(10).
000009 01 T          PIC 9(10).
000010 01 X          PIC 9(10).
000011 01 ln         PIC X(30).
000012 01 zs         PIC Z(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO N M X T D.
000017   IF X <= M MOVE T TO zs ELSE COMPUTE zs = T - D * (X - M).
000018   DISPLAY FUNCTION TRIM(zs).
000019   STOP RUN.

