000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_096_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ab1.
000007    03 ab11 OCCURS 2.
000008       05 ab   PIC 9(3).
000009 01 cur        PIC 9(2) VALUE 1.
000010 01 i          PIC 9(18) VALUE 1.
000011 01 j          PIC 9(18).
000012 01 len        PIC 9(2).
000013 01 ln         PIC X(30).
000014 01 maxlen     PIC 9(1) VALUE 2.
000015 01 zs         PIC Z(3).
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   PERFORM maxlen TIMES
000020     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000021     END-PERFORM
000022     COMPUTE len = j - cur
000023     MOVE ln(cur:len) TO ab(i)
000024     COMPUTE cur = j + 1
000025     ADD 1 TO i
000026   END-PERFORM.
000027   IF ab(2) < ab(1) THEN
000028     SUBTRACT 1 FROM ab(1)
000029   END-IF.
000030   MOVE ab(1) TO zs.
000031   DISPLAY FUNCTION TRIM(zs).
000032   STOP RUN.

