000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_226_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X          PIC 9(10)V9(3).
000007 01 zs         PIC Z(9)9.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT X.
000011   COMPUTE zs ROUNDED = X.
000012   DISPLAY FUNCTION TRIM(zs).
000013   STOP RUN.

