000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_152_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 LN             PIC X(10).
000007 01 a              PIC 9(1).
000008 01 ans            PIC X(10).
000009 01 b              PIC 9(1).
000010 01 ca             PIC X(1).
000011 01 i              PIC 9(10).
000012 01 n              PIC 9(10).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT LN.
000016   UNSTRING LN DELIMITED BY SPACE INTO a b.
000017   IF a < b
000018       MOVE b TO n
000019       MOVE a TO ca
000020   ELSE
000021       MOVE a TO n
000022       MOVE b TO ca
000023   END-IF.
000024   PERFORM VARYING i FROM 1 BY 1 UNTIL n < i
000025       MOVE ca TO ans(i:1)
000026   END-PERFORM.
000027   DISPLAY ans(1:n).
000028   STOP RUN.

