000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_195_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A         PIC 9(10).
000007 01 B         PIC 9(10).
000008 01 W         PIC 9(10).
000009 01 da        PIC 9(10).
000010 01 db        PIC 9(10).
000011 01 ln        PIC X(30).
000012 01 rb        PIC 9(10).
000013 01 za        PIC Z(9)9.
000014 01 zb        PIC Z(9)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT ln.
000018   UNSTRING ln DELIMITED SPACE INTO A B W.
000019   MULTIPLY W BY 1000 GIVING W.
000020   DIVIDE W BY A GIVING da.
000021   DIVIDE W BY B GIVING db REMAINDER rb.
000022   IF ZERO NOT = rb THEN
000023     ADD 1 TO db
000024   END-IF.
000025   IF da < db THEN
000026     DISPLAY "UNSATISFIABLE"
000027   ELSE
000028     MOVE da TO za
000029     MOVE db TO zb
000030     DISPLAY FUNCTION TRIM(zb) SPACE FUNCTION TRIM(za)
000031   END-IF.
000032   STOP RUN.

