000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_142_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 ans        PIC 9(1)V9(10).
000008 01 q          PIC 9(10).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT N.
000012   COMPUTE q = (N + 1) / 2.
000013   COMPUTE ans = q / N.
000014   DISPLAY ans.
000015   STOP RUN.

