000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_047_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 H          PIC 9(3).
000007 01 N          PIC 9(3).
000008 01 W          PIC 9(3).
000009 01 a          PIC 9(1).
000010 01 i          PIC 9(3).
000011 01 ln         PIC X(11).
000012 01 ln2        PIC X(9).
000013 01 sq         PIC 9(5).
000014 01 x          PIC 9(3).
000015 01 xl         PIC 9(3).
000016 01 xs         PIC 9(3).
000017 01 y          PIC 9(3).
000018 01 yl         PIC 9(3).
000019 01 ys         PIC 9(3).
000020 01 zs         PIC Z(5)9.
000021 
000022 PROCEDURE DIVISION.
000023   ACCEPT ln.
000024   UNSTRING ln DELIMITED BY SPACE INTO W H N.
000025   MOVE ZERO TO xs.
000026   MOVE W TO xl.
000027   MOVE ZERO TO ys.
000028   MOVE H TO yl.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000030     ACCEPT ln2
000031     UNSTRING ln2 DELIMITED BY SPACE INTO x y a
000032     EVALUATE a
000033       WHEN 1
000034         COMPUTE xs = FUNCTION MAX(xs, x)
000035       WHEN 2
000036         COMPUTE xl = FUNCTION MIN(xl, x)
000037       WHEN 3
000038         COMPUTE ys = FUNCTION MAX(ys, y)
000039       WHEN 4
000040         COMPUTE yl = FUNCTION MIN(yl, y)
000041     END-EVALUATE
000042   END-PERFORM.
000043   IF xl <= xs OR yl <= ys THEN
000044     MOVE ZERO TO sq
000045   ELSE
000046     COMPUTE sq = (xl - xs) * (yl - ys)
000047   END-IF.
000048   MOVE sq TO zs.
000049   DISPLAY FUNCTION TRIM(zs).
000050   STOP RUN.

