000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_050_B.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 M          PIC 9(3).
000007 01 P          PIC 9(3).
000008 01 T1.
000009    03 T11 OCCURS 600 DEPENDING ON maxlen.
000010       05 T PIC 9(6).
000011 01 X          PIC 9(6).
000012 01 cur        PIC 9(3) VALUE 1.
000013 01 i          PIC 9(18) VALUE 1.
000014 01 j          PIC 9(18).
000015 01 len        PIC 9(3).
000016 01 ln         PIC X(700).
000017 01 ln2        PIC X(10).
000018 01 maxlen     PIC 9(3) VALUE 600.
000019 01 sm         PIC 9(8).
000020 01 tmp        PIC 9(8).
000021 01 zs         PIC Z(8)9.
000022
000023 PROCEDURE DIVISION.
000024   ACCEPT maxlen.
000025   ACCEPT ln.
000026   MOVE ZERO TO sm.
000027   PERFORM maxlen TIMES
000028     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000029     END-PERFORM
000030     COMPUTE len = j - cur
000031     MOVE ln(cur:len) TO T(i)
000032     ADD T(i) TO sm
000033     COMPUTE cur = j + 1
000034     ADD 1 TO i
000035   END-PERFORM.
000036   ACCEPT M.
000037   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000038     ACCEPT ln2
000039     UNSTRING ln2 DELIMITED BY SPACE INTO P X
000040     SUBTRACT T(P) FROM sm GIVING tmp
000041     ADD X TO tmp
000042     MOVE tmp TO zs
000043     DISPLAY FUNCTION TRIM(zs)
000044   END-PERFORM.
000045   STOP RUN.

