000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_193_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A      PIC 9(10) OCCURS 100000 DEPENDING N.
000008 01 N         PIC 9(10).
000009 01 P1.
000010    03 P      PIC 9(10) OCCURS 100000 DEPENDING N.
000011 01 X1.
000012    03 X      PIC S9(10) OCCURS 100000 DEPENDING N.
000013 01 ans       PIC 9(10) VALUE 1000000007.
000014 01 i         PIC 9(10) COMP.
000015 01 ln        PIC X(50).
000016 01 mx        PIC S9(10) VALUE -1000000007.
000017 01 zs        PIC Z(9)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT N.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000022     ACCEPT ln
000023     UNSTRING ln DELIMITED SPACE INTO A(i) P(i) X(i)
000024     SUBTRACT A(i) FROM X(i)
000025     IF mx < X(i) THEN
000026       MOVE X(i) TO mx
000027     END-IF
000028   END-PERFORM.
000029   IF mx <= ZERO THEN
000030     DISPLAY -1
000031   ELSE
000032     PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000033       IF ZERO < X(i) AND P(i) < ans THEN
000034         MOVE P(i) TO ans
000035       END-IF
000036     END-PERFORM
000037     MOVE ans TO zs
000038     DISPLAY FUNCTION TRIM(zs)
000039   END-IF.
000040   STOP RUN.

