000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_049_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 c          PIC X(1).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT c.
000010   IF c = 'a' OR 'e' OR 'i' OR 'o' OR 'u'
000011     DISPLAY "vowel"
000012   ELSE
000013     DISPLAY "consonant"
000014   END-IF.
000015   STOP RUN.

