000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_265_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(1100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A1.
000016    03 A       PIC 9(10) OCCURS 100000 DEPENDING N.
000017 01 M          PIC 9(10).
000018 01 N          PIC 9(10).
000019 01 T          PIC S9(10).
000020 01 XY1.
000021    03 XY      OCCURS 100000 DEPENDING M.
000022       05 X    PIC 9(10).
000023       05 Y    PIC 9(10).
000024 01 flg        PIC 9(1) VALUE ZERO.
000025 01 i          PIC 9(10) COMP.
000026 01 idxxy      PIC 9(10) COMP VALUE 1.
000027 01 ln         PIC X(400).
000028 01 pt         PIC S9(10) VALUE 1.
000029 01 zs         PIC Z(9)9.
000030 
000031 PROCEDURE DIVISION.
000032   ACCEPT ln.
000033   UNSTRING ln DELIMITED SPACE INTO N M T.
000034   OPEN INPUT SYSIN.
000035   READ SYSIN INTO INDATA.
000036   CLOSE SYSIN.
000037   PERFORM VARYING i FROM 1 BY 1 UNTIL N - 1 < i
000038     UNSTRING INDATA DELIMITED SPACE INTO A(i) POINTER pt
000039   END-PERFORM.
000040   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000041     ACCEPT ln
000042     UNSTRING ln DELIMITED SPACE INTO X(i) Y(i)
000043   END-PERFORM.
000044   PERFORM VARYING i FROM 1 BY 1 UNTIL N - 1 < i
000045     IF T <= ZERO MOVE 1 TO flg EXIT PERFORM END-IF
000046     IF i = X(idxxy) ADD Y(idxxy) TO T ADD 1 TO idxxy END-IF
000047     SUBTRACT A(i) FROM T
000048   END-PERFORM.
000049   IF ZERO < T AND ZERO = flg DISPLAY "Yes" ELSE DISPLAY "No".
000050   STOP RUN.

