000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_071_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(4).
000007 01 b          PIC 9(4).
000008 01 ln         PIC X(14).
000009 01 x          PIC 9(4).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO x a b.
000014   SUBTRACT x FROM a.
000015   SUBTRACT x FROM b.
000016   IF a < b THEN
000017     DISPLAY 'A'
000018   ELSE
000019     DISPLAY 'B'
000020   END-IF.
000021   STOP RUN.

