000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_261_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 L          PIC 9(10) VALUE ZERO.
000007 01 L1         PIC 9(10).
000008 01 L2         PIC 9(10).
000009 01 LR         PIC 9(10) VALUE ZERO.
000010 01 R          PIC 9(10) VALUE ZERO.
000011 01 R1         PIC 9(10).
000012 01 R2         PIC 9(10).
000013 01 ln         PIC X(30).
000014 01 zs         PIC Z(9)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT ln.
000018   UNSTRING ln DELIMITED SPACE INTO L1 R1 L2 R2.
000019   IF L1 <= L2 AND L2 <= R1
000020     MOVE L2 TO L
000021     IF L1 <= R2 AND R2 <= R1
000022       MOVE R2 TO R
000023     ELSE
000024       MOVE R1 TO R
000025     END-IF
000026   ELSE
000027     IF L2 <= L1 AND L1 <= R2
000028       MOVE L1 TO L
000029       IF L2 <= R1 AND R1 <= R2
000030         MOVE R1 TO R
000031       ELSE
000032         MOVE R2 TO R
000033       END-IF
000034     END-IF
000035   END-IF.
000036   SUBTRACT L FROM R GIVING LR.
000037   MOVE LR TO zs.
000038   DISPLAY FUNCTION TRIM(zs).
000039   STOP RUN.

