000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_192_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S         PIC X(1000).
000007 01 ans       PIC Z(9)9.
000008 01 d         PIC 9(10).
000009 01 i         PIC 9(10) COMP.
000010 01 len       PIC 9(10).
000011 01 r         PIC 9(10).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT S.
000015   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
000016   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000017     DIVIDE i BY 2 GIVING d REMAINDER r
000018     IF 1 = r AND (S(i:1) < "a" OR "z" < S(i:1)) THEN
000019       EXIT PERFORM
000020     END-IF
000021     IF ZERO = r AND (S(i:1) < "A" OR "Z" < S(i:1)) THEN
000022       EXIT PERFORM
000023     END-IF
000024   END-PERFORM.
000025   IF len < i THEN
000026     DISPLAY "Yes"
000027   ELSE
000028     DISPLAY "No"
000029   END-IF.
000030   STOP RUN.

