000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_247_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(4).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT S.
000010   MOVE S(3:1) TO S(4:1).
000011   MOVE S(2:1) TO S(3:1).
000012   MOVE S(1:1) TO S(2:1).
000013   MOVE ZERO TO S(1:1).
000014   DISPLAY S.
000015   STOP RUN.

