000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_122_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 i          PIC 9(10) VALUE 1 COMP.
000007 01 b          PIC X(1).
000008 01 AC         PIC X(2) VALUE "AC".
000009 01 TG         PIC X(2) VALUE "TG".
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT b.
000013   PERFORM VARYING i from 1 BY 1 UNTIL 2 < i
000014     IF AC(i:1) = b
000015       DISPLAY TG(i:1)
000016       EXIT PERFORM
000017     ELSE
000018       IF TG(i:1) = b
000019         DISPLAY AC(i:1)
000020         EXIT PERFORM
000021       END-IF
000022     END-IF
000023   END-PERFORM.
000024   STOP RUN.
