000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_039_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 zs         PIC Z(11).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT A.
000011   COMPUTE A = A ** 0.25.
000012   MOVE A TO zs.
000013   DISPLAY FUNCTION TRIM(zs).
000014   STOP RUN.

