000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_029_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(10).
000007 01 ans        PIC 9(10).
000008 01 n          PIC 9(10).
000009 01 zs         PIC Z(9)9.
000010 
000011 PROCEDURE DIVISION.
000012   PERFORM 12 TIMES
000013     ACCEPT S
000014     MOVE ZERO TO n
000015     INSPECT S TALLYING n FOR ALL "r"
000016     IF ZERO < n THEN
000017       ADD 1 TO ans
000018     END-IF
000019   END-PERFORM.
000020   MOVE ans TO zs.
000021   DISPLAY FUNCTION TRIM(zs).
000022   STOP RUN.

