000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_147_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007   03 A11 OCCURS 100 DEPENDING ON N.
000008       05 A PIC 9(10) COMP.
000009 01 N          PIC 9(10).
000010 01 accum      PIC 9(10) VALUE ZERO COMP.
000011 01 cur        PIC 9(10) VALUE 1 COMP.
000012 01 i          PIC 9(10) VALUE 1 COMP.
000013 01 j          PIC 9(10) COMP.
000014 01 len        PIC 9(10) COMP.
000015 01 ln         PIC X(400).
000016 01 maxlen     PIC 9(10) VALUE 100 COMP.
000017 
000018 PROCEDURE DIVISION.
000019   MOVE 3 TO N.
000020   ACCEPT ln.
000021   MOVE N TO maxlen.
000022   PERFORM maxlen TIMES
000023     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000024     END-PERFORM
000025     COMPUTE len = j - cur
000026     MOVE ln(cur:len) TO A(i)
000027     ADD A(i) TO accum
000028     COMPUTE cur = j + 1
000029     ADD 1 TO i
000030   END-PERFORM.
000031   IF 22 <= accum THEN
000032     DISPLAY "bust"
000033   ELSE
000034     DISPLAY "win"
000035   END-IF.
000036   STOP RUN.

