000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_088_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(4).
000007 01 N          PIC 9(5).
000008 01 R          PIC 9(3).
000009 01 X          PIC 9(3).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT N.
000013   ACCEPT A.
000014   DIVIDE 500 INTO N GIVING X REMAINDER R.
000015   IF R <= A THEN
000016     DISPLAY "Yes"
000017   ELSE
000018     DISPLAY "No"
000019   END-IF
000020   STOP RUN.

