000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_251_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(3).
000007 01 i          PIC 9(10) VALUE 1.
000008 01 len        PIC 9(10).
000009 01 pt         PIC S9(10) VALUE 1.
000010 01 str        PIC X(6).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT S.
000014   MOVE FUNCTION STORED-CHAR-LENGTH(S) TO len.
000015   PERFORM VARYING i FROM 1 BY len UNTIL 6 < i
000016     MOVE S(1:len) TO str(i:len)
000017   END-PERFORM.
000018   DISPLAY FUNCTION TRIM(str)
000019   STOP RUN.

