000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_028_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT N.
000010   IF N <= 59 THEN
000011     DISPLAY "Bad"
000012   ELSE
000013     IF N <= 89 THEN
000014       DISPLAY "Good"
000015     ELSE
000016       IF N <=99 THEN
000017         DISPLAY "Great"
000018       ELSE
000019         DISPLAY "Perfect"
000020       END-IF
000021     END-IF
000022   END-IF.

