000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_077_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 C1         PIC X(3).
000007 01 C2         PIC X(3).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT C1.
000011   ACCEPT C2.
000012   IF C1(1:1) = C2(3:1)
000013     AND C1(2:1) = C2(2:1) AND C1(3:1) = C2(1:1) THEN
000014     DISPLAY "YES"
000015   ELSE
000016     DISPLAY "NO"
000017   END-IF.
000018   STOP RUN.

