000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_072_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(100000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 i          PIC 9(6) BINARY.
000016 01 len        PIC 9(6).
000017 01 ln         PIC X(50000).
000018 01 m          PIC 9(1).
000019 01 p          PIC 9(5) BINARY.
000020 01 s1.
000021    03 s       PIC X(1) OCCURS 100000.
000022 
000023 PROCEDURE DIVISION.
000024   OPEN INPUT SYSIN.
000025   READ SYSIN INTO s1.
000026   CLOSE SYSIN.
000027   MOVE 1 TO p.
000028   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(s1).
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000030     COMPUTE m = FUNCTION MOD(i, 2)
000031     IF m = 1 THEN
000032       STRING
000033         s(i)
000034         INTO ln WITH POINTER p
000035       END-STRING
000036     END-IF
000037   END-PERFORM
000038   DISPLAY ln(1:FUNCTION STORED-CHAR-LENGTH(ln)).
000039   STOP RUN.

