000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_219_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 zs         PIC Z(9)9.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT A.
000011   MOVE A TO zs.
000012   IF 90 <= A
000013     DISPLAY "expert"
000014     STOP RUN
000015   ELSE IF 70 <= A
000016     SUBTRACT A FROM 90 GIVING zs
000017   ELSE IF 40 <= A
000018     SUBTRACT A FROM 70 GIVING zs
000019   ELSE
000020     SUBTRACT A FROM 40 GIVING zs
000021   END-IF.
000022   DISPLAY FUNCTION TRIM(zs).
000023   STOP RUN.

