000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_019_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans        PIC X(2000).
000007 01 bk         PIC X(2000).
000008 01 cnt        PIC 9(10) VALUE ZERO COMP.
000009 01 cur        PIC X(1).
000010 01 i          PIC 9(10) COMP.
000011 01 len        PIC 9(10) COMP.
000012 01 pre        PIC X(1).
000013 01 s          PIC X(1000).
000014 01 zs         PIC Z(9)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT s.
000018   MOVE FUNCTION STORED-CHAR-LENGTH(s) TO len.
000019   MOVE s(1:1) TO pre.
000020   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000021     MOVE s(i:1) TO cur
000022     IF pre NOT = cur THEN
000023       MOVE ans TO bk
000024       MOVE cnt TO zs
000025       STRING
000026         FUNCTION TRIM(bk)
000027         pre
000028         FUNCTION TRIM(zs)
000029         INTO ans
000030       END-STRING
000031       MOVE ZERO TO cnt
000032     END-IF
000033     ADD 1 TO cnt
000034     MOVE cur TO pre
000035   END-PERFORM.
000036   *> 最後の文字
000037   MOVE ans TO bk.
000038   MOVE cnt TO zs.
000039   STRING
000040     FUNCTION TRIM(bk)
000041     pre
000042     FUNCTION TRIM(zs)
000043     INTO ans
000044   END-STRING.
000045   DISPLAY FUNCTION TRIM(ans).
000046   STOP RUN.

