000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_085_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(10).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT ln.
000010   INSPECT ln REPLACING FIRST "17/" BY "18/".
000011   DISPLAY ln.
000012   STOP RUN.

