000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_169_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(2000000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A1.
000016    03 A11 OCCURS 100000 DEPENDING N DESCENDING A INDEXED BY K.
000017       05 A    PIC 9(19).
000018 01 N          PIC 9(10).
000019 01 ans        PIC 9(36) VALUE 1.
000020 01 cur        PIC 9(10) VALUE 1 COMP.
000021 01 flg        PIC 9(1) VALUE ZERO.
000022 01 i          PIC 9(10) VALUE 1 COMP.
000023 01 inf        PIC 9(19) VALUE 1000000000000000000.
000024 01 j          PIC 9(10) COMP.
000025 01 len        PIC 9(10) COMP.
000026 01 maxlen     PIC 9(10) VALUE 100 COMP.
000027 01 zs         PIC Z(35)9.
000028 
000029 PROCEDURE DIVISION.
000030   ACCEPT N.
000031   OPEN INPUT SYSIN.
000032   READ SYSIN.
000033   CLOSE SYSIN.
000034   MOVE N TO maxlen.
000035   PERFORM maxlen TIMES
000036     PERFORM VARYING j FROM cur BY 1 UNTIL INDATA(j:1) = SPACE
000037     END-PERFORM
000038     COMPUTE len = j - cur
000039     MOVE INDATA(cur:len) TO A(i)
000040     IF ZERO = A(i)
000041       MOVE 1 TO flg
000042       EXIT PERFORM
000043     END-IF
000044     COMPUTE cur = j + 1
000045     ADD 1 TO i
000046   END-PERFORM.
000047   IF 1 = flg
000048     DISPLAY ZERO
000049   ELSE
000050     PERFORM VARYING i FROM 1 BY 1 UNTIL maxlen < i
000051       IF INF < A(i)
000052         MOVE 1 TO flg
000053         EXIT PERFORM
000054       END-IF
000055       IF INF < ans * A(i)
000056         MOVE 1 TO flg
000057         EXIT PERFORM
000058       ELSE
000059         MULTIPLY ans BY A(i) GIVING ans
000060       END-IF
000061     END-PERFORM
000062     IF 1 = flg
000063       DISPLAY -1
000064     ELSE
000065       MOVE ans TO zs
000066       DISPLAY FUNCTION TRIM(zs)
000067     END-IF
000068   END-IF.
000069   STOP RUN.

