000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_135_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 ans        PIC X(30).
000009 01 ln         PIC X(30).
000010 01 num        PIC 9(10).
000011 01 qt         PIC 9(10).
000012 01 rm         PIC 9(10).
000013 01 zs         PIC Z(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED BY SPACE INTO A B.
000018   COMPUTE num = A + B
000019   DIVIDE num BY 2 GIVING qt REMAINDER rm.
000020   IF ZERO = rm
000021     MOVE qt TO zs
000022     DISPLAY FUNCTION TRIM(zs)
000023   ELSE
000024     DISPLAY "IMPOSSIBLE"
000025   END-IF.
000026   STOP RUN.

