000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_191_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D         PIC 9(10).
000007 01 S         PIC 9(10).
000008 01 T         PIC 9(10).
000009 01 V         PIC 9(10).
000010 01 ln        PIC X(30).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED SPACE INTO V T S D.
000015   IF V * T <= D AND D <= V * S THEN
000016     DISPLAY "No"
000017   ELSE
000018     DISPLAY "Yes"
000019   END-IF.
000020   STOP RUN.

