000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_127_B.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 ans        PIC 9(10).
000080 01 zs         PIC Z(9)9.
000090 01 r          PIC 9(10).
000100 01 D          PIC 9(10).
000110 01 x          PIC 9(10).
000120 
000130 PROCEDURE DIVISION.
000140   ACCEPT ln.
000150   UNSTRING ln DELIMITED BY SPACE INTO r D x.
000160   PERFORM 10 TIMES
000170     COMPUTE x = r * x - D
000180     MOVE x TO zs
000190     DISPLAY FUNCTION TRIM(zs)
000200   END-PERFORM.
000210   STOP RUN.
