000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_103_C.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(21000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 INP        PIC X(21000).
000016 01 N          PIC 9(4).
000017 01 a          PIC 9(6).
000018 01 ans        PIC X(9).
000019 01 cur        PIC 9(5) VALUE 1.
000020 01 i          PIC 9(18) VALUE 1.
000021 01 j          PIC 9(18).
000022 01 len        PIC 9(5).
000023 01 maxlen     PIC 9(4) VALUE 3000.
000024 01 sm         PIC 9(9).
000025 01 zs         PIC Z(10).
000026 
000027 PROCEDURE DIVISION.
000028   ACCEPT N.
000029   OPEN INPUT SYSIN.
000030   READ SYSIN INTO INP.
000031   CLOSE SYSIN.
000032   MOVE ZERO TO sm.
000033   MOVE N TO maxlen.
000034   PERFORM maxlen TIMES
000035     PERFORM VARYING j FROM cur BY 1
000036       UNTIL INP(j:1) = SPACE
000037     END-PERFORM
000038     COMPUTE len = j - cur
000039     MOVE INP(cur:len) TO a
000040     SUBTRACT 1 FROM a
000041     ADD a TO sm
000042     COMPUTE cur = j + 1
000043     ADD 1 TO i
000044   END-PERFORM.
000045   MOVE sm TO zs.
000046   DISPLAY FUNCTION TRIM(zs).
000047   STOP RUN.

