000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_105_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 i          PIC 9(10) VALUE 1 COMP.
000008 01 j          PIC 9(10) COMP.
000009 01 flg        PIC 9(1).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT N.
000013   MOVE ZERO TO flg.
000014   PERFORM VARYING i FROM 0 BY 1 UNTIL N < 4 * i
000015     PERFORM VARYING j FROM 0 BY 1 UNTIL N < 7 * j
000016       IF 4 * i + 7 * j = N
000017         MOVE 1 TO flg
000018       END-IF
000019     END-PERFORM
000020   END-PERFORM.
000021   IF 1 = flg
000022     DISPLAY "Yes"
000023   ELSE
000024     DISPLAY "No"
000025   END-IF.
000026   STOP RUN.

