000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_102_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 INP        PIC X(1100).
000008 01 N          PIC 9(3).
000009 01 cur        PIC 9(4) VALUE 1.
000010 01 df         PIC 9(10).
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(4).
000014 01 maxlen     PIC 9(3).
000015 01 mn         PIC 9(10).
000016 01 mx         PIC 9(10).
000017 01 zs         PIC Z(10)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT N.
000021   MOVE N TO maxlen.
000022   ACCEPT INP.
000023   MOVE 1000000001 TO mn.
000024   MOVE 0 TO mx.
000025   PERFORM maxlen TIMES
000026     PERFORM VARYING j FROM cur BY 1
000027       UNTIL INP(j:1) = SPACE
000028     END-PERFORM
000029     COMPUTE len = j - cur
000030     MOVE INP(cur:len) TO A
000031     COMPUTE mn = FUNCTION MIN(mn, A)
000032     COMPUTE mx = FUNCTION MAX(mx, A)
000033     COMPUTE cur = j + 1
000034     ADD 1 TO i
000035   END-PERFORM.
000036   SUBTRACT mn FROM mx GIVING df.
000037   MOVE df TO zs.
000038   DISPLAY FUNCTION TRIM(zs).
000039   STOP RUN.

