000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_270_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 AB1.
000008    03 AB      PIC 9(10) OCCURS 3.
000009 01 B          PIC 9(10).
000010 01 i          PIC 9(10) COMP.
000011 01 ln         PIC X(30).
000012 01 num        PIC 9(10).
000013 01 point      PIC 9(10).
000014 01 zs         PIC Z(9)9.
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT ln.
000018   UNSTRING ln DELIMITED SPACE INTO A B.
000019   MOVE A TO num.
000020   PERFORM check_solved.
000021   MOVE B TO num.
000022   PERFORM check_solved.
000023   PERFORM VARYING i FROM 1 BY 1 UNTIL 3 < i
000024     IF ZERO < AB(i)
000025       ADD i TO point
000026       IF 3 = i THEN ADD 1 TO point
000027       END-IF
000028     END-IF
000029   END-PERFORM.
000030   MOVE point TO zs.
000031   DISPLAY FUNCTION TRIM(zs).
000032   STOP RUN.
000033 
000034 check_solved SECTION.
000035   IF 1 = num ADD 1 TO AB(1)
000036   ELSE IF 2 = num ADD 1 TO AB(2)
000037   ELSE IF 3 = num ADD 1 TO AB(1) ADD 1 TO AB(2)
000038   ELSE IF 4 = num ADD 1 TO AB(3)
000039   ELSE IF 5 = num ADD 1 TO AB(1) ADD 1 TO AB(3)
000040   ELSE IF 6 = num ADD 1 TO AB(2) ADD 1 TO AB(3)
000041   ELSE IF 7 = num ADD 1 TO AB(1) ADD 1 TO AB(2) ADD 1 TO AB(3).

