000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_112_B.
000030
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(10).
000070 01 i          PIC 9(9) COMP.
000080 01 ans        PIC 9(9) VALUE 1001.
000090 01 zs         PIC Z(9)9.
000100 01 N          PIC 9(9).
000110 01 T          PIC 9(9).
000120 01 ci         PIC 9(9).
000130 01 ti         PIC 9(9).
000140
000150 PROCEDURE DIVISION.
000160   ACCEPT ln.
000170   UNSTRING ln DELIMITED BY SPACE INTO N T.
000180   PERFORM N TIMES
000190     ACCEPT ln
000200     UNSTRING ln DELIMITED BY SPACE INTO ci ti
000210     IF ti <= T AND ci < ans
000220       MOVE ci TO ans
000230     END-IF
000240   END-PERFORM.
000250   IF ans = 1001
000260     DISPLAY "TLE"
000270   ELSE
000280     MOVE ans TO zs
000290     DISPLAY FUNCTION TRIM(zs)
000300   END-IF.
000310   STOP RUN.
