000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_001_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 H1         PIC 9(10).
000007 01 H2         PIC 9(10).
000008 01 ans        PIC S9(30).
000009 01 zs         PIC -(9)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT H1.
000013   ACCEPT H2.
000014   SUBTRACT H2 FROM H1 GIVING ans.
000015   MOVE ans TO zs.
000016   DISPLAY FUNCTION TRIM(zs).
000017   STOP RUN.

