000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_104_C.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 MAX_NUM    PIC 9(4) VALUE 1000.
000007 01 HXD        EXTERNAL PIC 9(2).
000008 01 NUM_OFF    EXTERNAL PIC 9(1).
000009 01 NUM_ON     EXTERNAL PIC 9(1).
000010 01 NUM_X      EXTERNAL PIC 9(1).
000011 01 h_num      PIC X(2) VALUE X"0000".
000012 01 h_txt      PIC X(4) VALUE SPACE.
000013 01 b_txt      PIC X(16) VALUE SPACE.
000014 01 d_num      PIC 9(5) VALUE ZERO.
000015 01 x_th       PIC 9(2) VALUE ZERO.
000016 01 x_div      PIC 9(1) VALUE ZERO.
000017 01 n_bit      PIC 9(1).
000018 01 INP        PIC X(11).
000019 01 D          PIC 9(2).
000020 01 G          PIC 9(8).
000021 01 nm         PIC 9(3).
000022 01 pt         PIC 9(7).
000023 01 problem1.
000024     03 problem OCCURS 1000 DEPENDING D.
000025         05 n  PIC 9(3).
000026         05 p  PIC 9(7).
000027 01 i          PIC 9(4).
000028 01 j          PIC 9(2).
000029 01 k          PIC 9(3).
000030 01 m          PIC 9(2).
000031 01 mx         PIC 9(4).
000032 01 num        PIC 9(4).
000033 01 point      PIC 9(8).
000034 01 mnnum      PIC 9(4).
000035 01 ans        PIC X(4).
000036 01 flg        PIC 9(1).
000037 01 ext        PIC 9(1).
000038 01 zs         PIC Z(5).
000039 
000040 PROCEDURE DIVISION.
000041   ACCEPT INP.
000042   UNSTRING INP DELIMITED BY SPACE INTO D G.
000043   PERFORM VARYING i FROM 1 BY 1 UNTIL D < i
000044     ACCEPT INP
000045     UNSTRING INP
000046     DELIMITED BY SPACE
000047     INTO nm pt
000048     MOVE nm TO n(i)
000049     MOVE pt TO p(i)
000050   END-PERFORM.
000051 *> 外部データ
000052 *> 実行単位中の複数のプログラムで使用する定数を設定
000053   CALL "SET_EXTERNAL".
000054 *> 2進数 対応表 0 ? 15
000055   CALL "B_TABLE".
000056 *> 最大 D 10
000057 *> 1023
000058   COMPUTE mx = 2 ** D - 1.
000059 *> 最大問題数 + 1
000060   ADD 1 TO MAX_NUM GIVING mnnum.
000061   PERFORM VARYING i FROM 0 BY 1 UNTIL mx < i
000062     MOVE i TO d_num
000063     CALL "DCM_TO_BNY" USING BY CONTENT d_num
000064                               BY REFERENCE b_txt
000065     MOVE ZERO TO num
000066     MOVE ZERO TO point
000067     PERFORM VARYING j FROM 1 BY 1 UNTIL D < j
000068       MOVE b_txt(HXD - j + 1:1) TO n_bit
000069       IF NUM_ON = n_bit THEN
000070         ADD n(j) TO num
000071         COMPUTE point = point + j * 100 * n(j)
000072         ADD p(j) TO point
000073       END-IF
000074     END-PERFORM
000075     MOVE 1 TO flg
000076     PERFORM FILLPOINT
000077     IF 1 = flg THEN
000078       COMPUTE mnnum = FUNCTION MIN(mnnum, num)
000079     END-IF
000080   END-PERFORM.
000081   MOVE mnnum TO zs.
000082   DISPLAY FUNCTION TRIM(zs).
000083   STOP RUN.
000084 
000085 FILLPOINT SECTION.
000086   IF point < G THEN
000087     PERFORM VARYING k FROM D BY -1 UNTIL k <= ZERO
000088       MOVE b_txt(HXD - k + 1:1) TO n_bit
000089       IF NUM_OFF = n_bit THEN
000090         MOVE ZERO TO ext
000091         PERFORM VARYING m FROM 1 BY 1 UNTIL n(k) < m
000092           COMPUTE point = point + 100 * k
000093           ADD 1 TO num
000094           IF m NOT = n(k) AND G <= point
000095             MOVE 1 TO ext
000096             EXIT PERFORM
000097           ELSE
000098             IF m = n(k) THEN
000099               MOVE 0 TO flg
000100               MOVE 1 TO ext
000101               EXIT PERFORM
000102             END-IF
000103           END-IF
000104         END-PERFORM
000105         IF ext = 1 THEN
000106           EXIT PERFORM
000107         END-IF
000108       END-IF
000109     END-PERFORM
000110   END-IF.
000111 END PROGRAM ABC_104_C.
000112 
000113 IDENTIFICATION DIVISION.
000114 PROGRAM-ID. SET_EXTERNAL.
000115 *> 外部データ
000116 *> 実行単位中の複数のプログラムで使用する定数を設定
000117 *> external data
000118 *> Set constants used for multiple programs in running unit
000119 DATA DIVISION.
000120 WORKING-STORAGE SECTION.
000121 01 BNY        EXTERNAL PIC 9(1).
000122 01 BIT4       EXTERNAL PIC 9(1).
000123 01 BYT4       EXTERNAL PIC 9(1).
000124 01 BYT32      EXTERNAL PIC 9(2).
000125 01 BYT256     EXTERNAL PIC 9(3).
000126 01 HXD        EXTERNAL PIC 9(2).
000127 01 NUM_OFF    EXTERNAL PIC 9(1).
000128 01 NUM_ON     EXTERNAL PIC 9(1).
000129 01 NUM_X      EXTERNAL PIC 9(1).
000130 01 OCT        EXTERNAL PIC 9(1).
000131 *> 16進数 対応表 0 ? 15
000132     01 H_TBL1 EXTERNAL.
000133         03 H_TBL11 OCCURS 16.
000134             05 H_TBL PIC X(1).
000135 
000136 PROCEDURE DIVISION.
000137     MOVE 2 TO BNY.
000138     MOVE 4 TO BIT4.
000139     MOVE 4 TO BYT4.
000140     MOVE 32 TO BYT32.
000141     MOVE 256 TO BYT256.
000142     MOVE 16 TO HXD.
000143     MOVE 0 TO NUM_OFF.
000144     MOVE 1 TO NUM_ON.
000145     MOVE 9 TO NUM_X.
000146     MOVE 8 TO OCT.
000147     MOVE "0123456789ABCDEF" TO H_TBL1.
000148 END PROGRAM SET_EXTERNAL.
000149 
000150 IDENTIFICATION DIVISION.
000151 PROGRAM-ID. B_TABLE.
000152 *> 2進数 対応表 0 ? 15
000153 *> 0001
000154 *> 0010
000155 *> 中略
000156 *> 1111
000157 DATA DIVISION.
000158 WORKING-STORAGE SECTION.
000159 *> 16
000160 01 HXD        EXTERNAL PIC 9(2).
000161 *> 2
000162 01 BNY        EXTERNAL PIC 9(1).
000163 *> 4
000164 01 BYT4       EXTERNAL PIC 9(1).
000165 *> 8
000166 01 OCT        EXTERNAL PIC 9(1).
000167 01 p          PIC 9(1).
000168 01 i          PIC 9(8).
000169 01 j          PIC 9(8).
000170 01 q          PIC 9(2).
000171 01 r          PIC 9(1).
000172 01 s          PIC X(1).
000173 01 str        PIC X(4).
000174 01 len        PIC 9(1).
000175 01 idx        PIC 9(2).
000176 *> 2進数 対応表 0 ? 15
000177 01 B_TBL1 EXTERNAL.
000178     03 B_TBL11 OCCURS 16.
000179         05 B_TBL PIC X(4).
000180 
000181 PROCEDURE DIVISION.
000182 *> 0 ? 15
000183   PERFORM VARYING i FROM 0 BY 1 UNTIL HXD <= i
000184     MOVE i TO q
000185     MOVE ALL ZERO TO str
000186 *> 繰り返し 2 で割る
000187     PERFORM VARYING j FROM 0 BY 1 UNTIL q <= 0
000188       DIVIDE BNY INTO q GIVING q REMAINDER r
000189       COMPUTE p = FUNCTION STORED-CHAR-LENGTH(str)
000190       SUBTRACT j FROM p
000191       MOVE r TO s
000192       STRING
000193         s
000194         INTO str WITH POINTER p
000195       END-STRING
000196     END-PERFORM
000197     ADD 1 TO i GIVING idx
000198 *> 2進数 対応表 設定
000199     MOVE str TO B_TBL(idx)
000200   END-PERFORM.
000201 END PROGRAM B_TABLE.
000202 
000203 IDENTIFICATION DIVISION.
000204 PROGRAM-ID. DCM_TO_BNY.
000205 *> 10進数 を 2進数 に変換
000206 *> 2 byte (16 bit) 用
000207 *> Convert decimal number to binary number
000208 *> For 2 byte (16 bit)
000209 DATA DIVISION.
000210 WORKING-STORAGE SECTION.
000211 *> 4
000212 01 BIT4       EXTERNAL PIC 9(1).
000213 *> 2
000214 01 BNY        EXTERNAL PIC 9(1).
000215 *> 4
000216 01 BYT4       EXTERNAL PIC 9(1).
000217 *> 32
000218 01 BYT32      EXTERNAL PIC 9(2).
000219 *> 256
000220 01 BYT256     EXTERNAL PIC 9(3).
000221 *> 16
000222 01 HXD        EXTERNAL PIC 9(2).
000223 *> 8
000224 01 OCT        EXTERNAL PIC 9(1).
000225 01 i          PIC 9(2).
000226 01 j          PIC 9(1).
000227 01 k          PIC 9(2).
000228 01 m          PIC 9(1).
000229 01 q          PIC 9(5).
000230 01 r          PIC 9(2).
000231 *> 2進数 対応表 0 ? 15
000232 01 B_TBL1 EXTERNAL.
000233    03 B_TBL11 OCCURS 16.
000234       05 B_TBL PIC X(4).
000235 *> 16進数 対応表 0 ? 15
000236 01 H_TBL1 EXTERNAL.
000237    03 H_TBL11 OCCURS 16.
000238       05 H_TBL PIC X(1).
000239 
000240 LINKAGE SECTION.
000241 *> (IN)  d_num
000242 *> (OUT) b_txt
000243 01 d_num      PIC 9(5).
000244 01 b_txt      PIC X(16).
000245 
000246 PROCEDURE DIVISION USING d_num b_txt.
000247   MOVE ALL ZERO TO b_txt.
000248   MOVE d_num TO q.
000249   PERFORM VARYING i FROM 1 BY 1 UNTIL q <= 0
000250 *> 16 - 4 * i + 1
000251     COMPUTE k = HXD - BYT4 * i + 1
000252 *> 10進数 を 16 で割る
000253     DIVIDE HXD INTO q GIVING q REMAINDER r
000254 *> 後ろから格納していく
000255 *> [1111]
000256     MOVE B_TBL(r + 1) TO b_txt(k:BIT4)
000257   END-PERFORM.
000258 END PROGRAM DCM_TO_BNY.

