000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_095_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 NX1.
000007    03 NX11 OCCURS 2.
000008       05 NX   PIC 9(8).
000009 01 cur        PIC 9(2) VALUE 1.
000010 01 i          PIC 9(18) VALUE 1.
000011 01 j          PIC 9(18).
000012 01 k          PIC 9(18).
000013 01 len        PIC 9(2).
000014 01 ln         PIC X(11).
000015 01 ln2        PIC 9(4).
000016 01 maxlen     PIC 9(1) VALUE 2.
000017 01 mn         PIC 9(6).
000018 01 sm         PIC 9(6).
000019 01 tmp        PIC 9(8).
000020 01 x          PIC 9(6).
000021 01 zs         PIC Z(9).
000022 
000023 PROCEDURE DIVISION.
000024   ACCEPT ln.
000025   PERFORM maxlen TIMES
000026     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000027     END-PERFORM
000028     COMPUTE len = j - cur
000029     MOVE ln(cur:len) TO NX(i)
000030     COMPUTE cur = j + 1
000031     ADD 1 TO i
000032   END-PERFORM.
000033   MOVE 0 TO sm.
000034   MOVE 1001 TO mn.
000035   PERFORM VARYING k FROM 1 BY 1 UNTIL NX(1) < k
000036     ACCEPT ln2
000037     ADD ln2 TO sm
000038     COMPUTE mn = FUNCTION MIN(mn, ln2)
000039   END-PERFORM.
000040   SUBTRACT sm FROM NX(2) GIVING tmp.
000041   DIVIDE mn INTO tmp GIVING x.
000042   ADD x TO NX(1).
000043   MOVE NX(1) TO zs.
000044   DISPLAY FUNCTION TRIM(zs).
000045   STOP RUN.

