000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_105_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 N          PIC 9(10).
000008 01 K          PIC 9(10).
000009 01 ans        PIC X(30).
000010 01 d          PIC 9(3).
000011 01 r          PIC 9(3).
000012 01 zs         PIC Z(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO N K.
000017   DIVIDE K INTO N GIVING d REMAINDER r.
000018   IF ZERO = r
000019     DISPLAY ZERO
000020   ELSE
000021     DISPLAY 1
000022   END-IF.
000023   STOP RUN.

