000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_205_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 ans        PIC Z(9)9.9(2).
000009 01 ln         PIC X(30).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO A B.
000014   COMPUTE ans = A * B / 100.
000015   DISPLAY FUNCTION TRIM(ans).
000016   STOP RUN.

