000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_068_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(3).
000007 01 R          PIC 9(3).
000008 01 i          PIC 9(3).
000009 01 j          PIC 9(3).
000010 01 mxt        PIC 9(3).
000011 01 mxv        PIC 9(3).
000012 01 t          PIC 9(3).
000013 01 tmp        PIC 9(3).
000014 01 zs         PIC Z(4).
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT N.
000018   MOVE 1 TO mxv.
000019   MOVE 0 TO mxt.
000020   PERFORM VARYING i FROM 2 BY 1 UNTIL N < i
000021     MOVE 0 TO t
000022     MOVE i TO tmp
000023     PERFORM VARYING j FROM 1 BY 1 UNTIL tmp = 0
000024       ADD 1 TO t
000025       DIVIDE 2 INTO tmp GIVING tmp REMAINDER R
000026       IF R = 1 THEN
000027         EXIT PERFORM
000028       END-IF
000029     END-PERFORM
000030     IF mxt < t THEN
000031       MOVE i TO mxv
000032       MOVE t TO mxt
000033     END-IF
000034   END-PERFORM.
000035   MOVE mxv TO zs.
000036   DISPLAY FUNCTION TRIM(zs).
000037   STOP RUN.

