000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_128_B.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 maxlen     PIC 9(10) VALUE 100 COMP.
000080 01 i          PIC 9(10) VALUE 1 COMP.
000090 01 j          PIC 9(10) COMP.
000100 01 zs         PIC Z(9)9.
000110 01 N          PIC 9(10).
000120 01 restaurant1.
000130    03 restaurant11 OCCURS 100 DEPENDING ON N.
000140       05 num  PIC 9(10).
000150       05 S    PIC X(10).
000160       05 P    PIC 9(10).
000170 
000180 PROCEDURE DIVISION.
000190   ACCEPT N.
000200   MOVE N TO maxlen.
000210   PERFORM maxlen TIMES
000220     MOVE i TO num(i)
000230     ACCEPT ln
000240     UNSTRING ln DELIMITED BY SPACE INTO S(i) P(i)
000250     ADD 1 TO i
000260   END-PERFORM.
000270   SORT restaurant11 ASCENDING S
000280                     DESCENDING P.
000290   PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000300     MOVE num(j) TO zs
000310     DISPLAY FUNCTION TRIM(zs)
000320   END-PERFORM.
000330   STOP RUN.
