000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_003_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(10).
000007 01 T          PIC X(10).
000008 01 atcoder    PIC X(7) VALUE "atcoder".
000009 01 cur        PIC X(1).
000010 01 flg        PIC 9(1) VALUE 1.
000011 01 i          PIC 9(10) COMP.
000012 01 num        PIC 9(10).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT S.
000016   ACCEPT T.
000017   PERFORM VARYING i FROM 1 BY 1
000018   UNTIL FUNCTION STORED-CHAR-LENGTH(S) < i
000019     MOVE SPACE TO cur
000020     IF "@" = S(i:1) AND "@" NOT = T(i:1) THEN
000021       MOVE T(i:1) TO cur
000022     ELSE
000023       IF "@" NOT = S(i:1) AND "@" = T(i:1) THEN
000024         MOVE S(i:1) TO cur
000025       ELSE
000026         IF "@" NOT = S(i:1) AND "@" NOT = T(i:1)
000027         AND S(i:1) NOT = T(i:1) THEN
000028           MOVE ZERO TO flg
000029           EXIT PERFORM
000030         END-IF
000031       END-IF
000032     END-IF
000033     IF SPACE NOT = cur THEN
000034       MOVE ZERO TO num
000035       INSPECT atcoder TALLYING num FOR ALL cur
000036       IF ZERO = num THEN
000037         MOVE ZERO TO flg
000038         EXIT PERFORM
000039       END-IF
000040     END-IF
000041   END-PERFORM.
000042   IF ZERO = flg THEN
000043     DISPLAY "You will lose"
000044   ELSE
000045     DISPLAY "You can win"
000046   END-IF.
000047   STOP RUN.

