000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_112_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 D          PIC 9(10).
000008 01 R          PIC 9(10).
000009 01 ans        PIC 9(10).
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   DIVIDE N BY 111 GIVING D REMAINDER R.
000015   IF ZERO = R
000016     MOVE N TO ans
000017   ELSE
000018     COMPUTE ans = N + 111 - R
000019   END-IF.
000020   MOVE ans TO zs.
000021   DISPLAY FUNCTION TRIM(zs).
000022   STOP RUN.
