000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_126_B.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 S          PIC X(4).
000070 
000080 PROCEDURE DIVISION.
000090   ACCEPT S.
000100   IF (S(1:2) < "01" OR "12" < S(1:2))
000110   AND (S(3:2) < "01" OR "12" < S(3:2))
000120     DISPLAY "NA"
000130   ELSE
000140     IF (S(1:2) < "01" OR "12" < S(1:2))
000150     AND ("01" <= S(3:2) AND S(3:2) <= "12")
000160       DISPLAY "YYMM"
000170     ELSE
000180       IF ("01" <= S(1:2) AND S(1:2) <= "12")
000190       AND (S(3:2) < "01" OR "12" < S(3:2))
000200         DISPLAY "MMYY"
000210       ELSE
000220         DISPLAY "AMBIGUOUS"
000230   END-IF.
000240   STOP RUN.
