000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_203_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 abc1.
000007    03 abc     PIC 9(10) OCCURS 3.
000008 01 ans        PIC 9(10) VALUE ZERO.
000009 01 ln         PIC X(30).
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO abc(1) abc(2) abc(3).
000015   SORT abc ASCENDING abc.
000016   IF abc(1) = abc(2) AND abc(3)
000017     MOVE abc(1) TO ans
000018   END-IF.
000019   IF abc(1) = abc(2) AND abc(2) NOT = abc(3)
000020     MOVE abc(3) TO ans
000021   END-IF.
000022   IF abc(2) = abc(3) AND abc(3) NOT = abc(1)
000023     MOVE abc(1) TO ans
000024   END-IF.
000025   MOVE ans TO zs.
000026   DISPLAY FUNCTION TRIM(zs).
000027   STOP RUN.

