000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_108_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 D          PIC 9(10).
000007 01 K          PIC 9(10).
000008 01 X          PIC 9(10).
000009 01 ans        PIC 9(10).
000010 01 zs         PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT K.
000014   DIVIDE K BY 2 GIVING D.
000015   COMPUTE ans = D * (K - D).
000016   MOVE ans TO zs.
000017   DISPLAY FUNCTION TRIM(zs).
000018   STOP RUN.
