000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_204_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ans       PIC Z(9)9.
000007 01 ln        PIC X(30).
000008 01 x         PIC 9(10).
000009 01 y         PIC 9(10).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED SPACE INTO x y.
000014   IF x = y MOVE x TO ans ELSE COMPUTE ans = 3 - x - y.
000015   DISPLAY FUNCTION TRIM(ans).
000016   STOP RUN.

