000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_127_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 ans        PIC 9(10).
000008 01 zs         PIC Z(9)9.
000009 01 A          PIC 9(10).
000010 01 B          PIC 9(10).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO A B.
000015   IF 13 <= A
000016     MOVE B TO ans
000017   ELSE
000018     IF 6 <= A
000019       COMPUTE ans = B / 2
000020     ELSE
000021       MOVE ZERO TO ans
000022     END-IF
000023   END-IF.
000024   MOVE ans TO zs.
000025   DISPLAY FUNCTION TRIM(zs).
000026   STOP RUN.
