000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_188_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD  SYSIN.
000012 01 INDATA PIC X(500000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 A11.
000016    03 A      PIC S9(10) OCCURS 100000 DEPENDING N.
000017 01 AB        PIC S9(10) VALUE ZERO.
000018 01 B11.
000019    03 B      PIC S9(10) OCCURS 100000 DEPENDING N.
000020 01 N         PIC 9(10).
000021 01 i         PIC 9(10) COMP.
000022 01 lna       PIC X(500000).
000023 01 lnb       PIC X(500000).
000024 01 pt        PIC S9(10).
000025 
000026 PROCEDURE DIVISION.
000027   OPEN INPUT SYSIN.
000028   READ SYSIN INTO N.
000029   READ SYSIN INTO lna.
000030   READ SYSIN INTO lnb.
000031   CLOSE SYSIN.
000032   MOVE 1 TO pt.
000033   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000034     UNSTRING lna DELIMITED SPACE INTO A(i) WITH POINTER pt
000035   END-PERFORM.
000036   MOVE 1 TO pt.
000037   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000038     UNSTRING lnb DELIMITED SPACE INTO B(i) WITH POINTER pt
000039   END-PERFORM.
000040   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000041     COMPUTE AB = AB + A(i) * B(i)
000042   END-PERFORM.
000043   IF ZERO = AB THEN
000044     DISPLAY "Yes"
000045   ELSE
000046     DISPLAY "No"
000047   END-IF.
000048   STOP RUN.

