000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_127_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 ans        PIC 9(10).
000008 01 zs         PIC Z(9)9.
000009 01 r          PIC 9(10).
000010 01 D          PIC 9(10).
000011 01 x          PIC 9(10).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO r D x.
000016   PERFORM 10 TIMES
000017     COMPUTE x = r * x - D
000018     MOVE x TO zs
000019     DISPLAY FUNCTION TRIM(zs)
000020   END-PERFORM.
000021   STOP RUN.
