000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_183_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 Gx         PIC S9(10).
000007 01 Gy         PIC S9(10).
000008 01 Sx         PIC S9(10).
000009 01 Sy         PIC S9(10).
000010 01 ans        PIC -(9)9.9(10).
000011 01 ln         PIC X(40).
000012 01 x          PIC S9(10).
000013 01 y          PIC S9(10).
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED BY SPACE INTO Sx Sy Gx Gy.
000018   COMPUTE Gy = -1 * Gy.
000019   SUBTRACT Gx FROM Sx GIVING x.
000020   SUBTRACT Gy FROM Sy GIVING y.
000021   COMPUTE ans = Sx - x * Sy / y.
000022   DISPLAY FUNCTION TRIM(ans).
000023   STOP RUN.

