000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_131_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(30).
000007 01 flg        PIC 9(10) VALUE ZERO.
000008 01 i          PIC 9(10).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT S.
000012   PERFORM VARYING i FROM 2 BY 1
000013   UNTIL FUNCTION STORED-CHAR-LENGTH(S) < i
000014     IF S(i - 1:1) = S(i:1)
000015       MOVE 1 TO flg
000016       EXIT PERFORM
000017     END-IF
000018   END-PERFORM.
000019   IF ZERO <> flg
000020     DISPLAY "Bad"
000021   ELSE
000022     DISPLAY "Good"
000023   END-IF.
000024   STOP RUN.

