000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_051_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 K          PIC 9(4).
000007 01 S          PIC 9(4).
000008 01 cnt        PIC 9(9).
000009 01 i          PIC 9(4) BINARY.
000010 01 j          PIC 9(4) BINARY.
000011 01 ln         PIC X(9).
000012 01 tmp        PIC 9(9).
000013 01 zs         PIC Z(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED BY SPACE INTO K S.
000018   MOVE ZERO TO cnt.
000019   PERFORM VARYING i FROM 0 BY 1 UNTIL 3 * K < i
000020     IF K < i THEN
000021       EXIT PERFORM
000022     END-IF
000023     PERFORM VARYING j FROM 0 BY 1 UNTIL 3 * K < j
000024       IF K < j THEN
000025         EXIT PERFORM
000026       END-IF
000027       ADD i TO j GIVING tmp
000028       IF tmp <= S AND S - tmp <= K THEN
000029         ADD 1 TO cnt
000030       ELSE
000031         IF S < tmp THEN
000032           EXIT PERFORM
000033         END-IF
000034       END-IF
000035     END-PERFORM
000036   END-PERFORM.
000037   MOVE cnt TO zs.
000038   DISPLAY FUNCTION TRIM(zs).
000039   STOP RUN.

