000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_037_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 L          PIC 9(3).
000007 01 N          PIC 9(3).
000008 01 Q          PIC 9(3).
000009 01 R          PIC 9(3).
000010 01 T          PIC 9(10).
000011 01 a1.
000012    03 a       PIC 9(10) OCCURS 100 VALUE ZERO.
000013 01 i          PIC 9(3) BINARY.
000014 01 j          PIC 9(3) BINARY.
000015 01 ln         PIC X(7).
000016 01 ln2        PIC X(18).
000017 01 zs         PIC Z(10)9.
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT ln.
000021   UNSTRING ln DELIMITED BY SPACE INTO N Q.
000022   PERFORM VARYING i FROM 1 BY 1 UNTIL Q < i
000023     ACCEPT ln2
000024     UNSTRING ln2 DELIMITED BY SPACE INTO L R T
000025     PERFORM VARYING j FROM L BY 1 UNTIL R < j
000026       MOVE T TO a(j)
000027     END-PERFORM
000028   END-PERFORM.
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000030     MOVE a(i) TO zs
000031     DISPLAY FUNCTION TRIM(zs)
000032   END-PERFORM.

