000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_064_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 b          PIC 9(1).
000007 01 g          PIC 9(2).
000008 01 ln         PIC X(5).
000009 01 num        PIC 9(3) VALUE 0.
000010 01 r          PIC 9(3).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO r g b.
000015   MULTIPLY 100 BY r.
000016   MULTIPLY 10 BY g.
000017   ADD r g TO b GIVING num.
000018   IF FUNCTION MOD(num, 4) = 0 THEN
000019     DISPLAY "YES"
000020   ELSE
000021     DISPLAY "NO"
000022   END-IF.
000023   STOP RUN.

