000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_104_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 R          PIC 9(10).
000007 
000008 PROCEDURE DIVISION.
000009 ACCEPT R.
000010 IF R < 1200 THEN
000011   DISPLAY "ABC"
000012 ELSE
000013   IF R < 2800 THEN
000014     DISPLAY "ARC"
000015   ELSE
000016     DISPLAY "AGC"
000017   END-IF
000018 END-IF.
000019 STOP RUN.

