000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_019_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 abc1.
000007    03 abc     PIC 9(10) OCCURS 3.
000008 01 ln         PIC X(400).
000009 01 zs         PIC Z(9)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED BY SPACE INTO abc(1) abc(2) abc(3)
000014   SORT abc ASCENDING abc.
000015   MOVE abc(2) TO zs.
000016   DISPLAY FUNCTION TRIM(zs).
000017   STOP RUN.

