000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_104_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(30).
000007 01 cnt        PIC 9(1).
000008 01 chr.
000009    03 num USAGE BINARY-CHAR.
000010 01 flg        PIC 9(1).
000011 01 i          PIC 9(2).
000012 01 idx        PIC 9(2).
000013 01 len        PIC 9(2).
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT S.
000017   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
000018   IF S(1:1) = 'A' THEN
000019     MOVE 0 TO cnt
000020     MOVE 99 TO idx
000021     PERFORM VARYING i FROM 3 BY 1 UNTIL len - 1 < i
000022       IF S(i:1) = 'C' THEN
000023         ADD 1 TO cnt
000024         MOVE i TO idx
000025       END-IF
000026     END-PERFORM
000027     IF cnt = 1 THEN
000028       PERFORM VARYING i FROM 2 BY 1 UNTIL len < i
000029         IF i NOT = idx THEN
000030           MOVE S(i:1) TO chr
000031           IF S(i:1) < 'a' OR 'z' < S(i:1) THEN
000032             MOVE 1 TO flg
000033           END-IF
000034         END-IF
000035       END-PERFORM
000036       IF flg = 1 THEN
000037         DISPLAY "WA"
000038       ELSE
000039         DISPLAY "AC"
000040       END-IF
000041     ELSE
000042       DISPLAY "WA"
000043     END-IF
000044   ELSE
000045     DISPLAY "WA"
000046   END-IF
000047   STOP RUN.

