000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_109_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 A          PIC 9(10).
000008 01 AB         PIC 9(10).
000009 01 B          PIC 9(10).
000010 01 D          PIC 9(10).
000011 01 R          PIC 9(10).
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED BY SPACE INTO A B.
000016   MULTIPLY A BY B GIVING AB.
000017   DIVIDE AB BY 2 GIVING D REMAINDER R.
000018   IF ZERO = R
000019     DISPLAY "No"
000020   ELSE
000021     DISPLAY "Yes"
000022   END-IF.
000023   STOP RUN.
