000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_035_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(30).
000007 01 H          PIC 9(10).
000008 01 W          PIC 9(10).
000009 01 dvh        PIC 9(10).
000010 01 dvw        PIC 9(10).
000011 01 rmh        PIC 9(10).
000012 01 rmw        PIC 9(10).
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED BY SPACE INTO W H.
000017   DIVIDE W BY 16 GIVING dvw REMAINDER rmw.
000018   DIVIDE H BY 9 GIVING dvh REMAINDER rmh.
000019   IF ZERO = rmw AND ZERO = rmh THEN
000020   DISPLAY "16:9"
000021   ELSE
000022   DISPLAY "4:3"
000023   END-IF.
000024   STOP RUN.

