000001 PROGRAM-ID. ABC_014_B.
000002 DATA DIVISION.
000003 WORKING-STORAGE SECTION.
000004 01 NUM_OFF    EXTERNAL PIC 9(1).
000005 01 NUM_ON     EXTERNAL PIC 9(1).
000006 01 NUM_X      EXTERNAL PIC 9(1).
000007 01 X          PIC 9(10).
000008 01 a1.
000009    03 a11 OCCURS 20 DEPENDING ON n.
000010       05 a    PIC 9(10).
000011 01 b_txt      PIC X(32) VALUE SPACE.
000012 01 cur        PIC 9(10) VALUE 1 COMP.
000013 01 cr         PIC 9(10) VALUE 1.
000014 01 d_num      PIC 9(10) VALUE ZERO.
000015 01 h_num      PIC X(4) VALUE X"00000000".
000016 01 h_txt      PIC X(8) VALUE SPACE.
000017 01 i          PIC 9(10) VALUE 1 COMP.
000018 01 j          PIC 9(10) COMP.
000019 01 ln         PIC X(100).
000020 01 len        PIC 9(10) COMP.
000021 01 maxlen     PIC 9(10) VALUE 100 COMP.
000022 01 n          PIC 9(10).
000023 01 n_bit      PIC 9(1).
000024 01 r          PIC 9(10).
000025 01 sm         PIC 9(10) VALUE ZERO.
000026 01 x_th       PIC 9(2) VALUE ZERO.
000027 01 x_div      PIC 9(1) VALUE ZERO.
000028 01 zs         PIC Z(9)9.
000029 
000030 PROCEDURE DIVISION.
000031   ACCEPT ln.
000032   UNSTRING ln DELIMITED BY SPACE INTO n X.
000033   ACCEPT ln.
000034   MOVE n TO maxlen.
000035   PERFORM maxlen TIMES
000036     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000037     END-PERFORM
000038     COMPUTE len = j - cur
000039     MOVE ln(cur:len) TO a(i)
000040     COMPUTE cur = j + 1
000041     ADD 1 TO i
000042   END-PERFORM.
000043   PERFORM WITH TEST AFTER UNTIL X <= ZERO
000044     *> 外部データ
000045     *> 実行単位中の複数のプログラムで使用する定数を設定
000046     CALL "SET_EXTERNAL"
000047     *> 2進数 対応表 0 〜 15
000048     CALL "B_TABLE"
000049     *> 演算対象 の 10進数 設定
000050     MOVE X TO d_num
000051     *> 10進数 を 16進数 に変換
000052     CALL "DCM_TO_HEX" USING BY CONTENT d_num
000053                             BY REFERENCE h_num
000054     *> 16進数 を 2進数、10進数 に変換
000055     CALL "HEX_TO_OTHER" USING BY CONTENT h_num
000056                               BY REFERENCE b_txt
000057                               BY REFERENCE d_num
000058                               BY REFERENCE h_txt
000059     MOVE 1 TO x_th
000060     CALL "GET_NTH_BIT" USING BY CONTENT x_th
000061                               BY CONTENT d_num
000062                               BY REFERENCE n_bit
000063     IF 1 = n_bit THEN
000064       ADD A(cr) TO sm
000065     END-IF
000066     DIVIDE X BY 2 GIVING X
000067     ADD 1 TO cr
000068   END-PERFORM.
000069   MOVE sm TO zs.
000070   DISPLAY FUNCTION TRIM(zs).
000071   STOP RUN.
000072 END PROGRAM ABC_014_B.
000073 
000074 PROGRAM-ID. SET_EXTERNAL.
000075 *> 外部データ
000076 *> 実行単位中の複数のプログラムで使用する定数を設定
000077 *> external data
000078 *> Set constants used for multiple programs in running unit
000079 DATA DIVISION.
000080 WORKING-STORAGE SECTION.
000081     01 BNY     EXTERNAL PIC 9(1).
000082     01 BIT4    EXTERNAL PIC 9(1).
000083     01 BYT4    EXTERNAL PIC 9(1).
000084     01 BYT32   EXTERNAL PIC 9(2).
000085     01 BYT256  EXTERNAL PIC 9(3).
000086     01 HXD     EXTERNAL PIC 9(2).
000087     01 NUM_OFF EXTERNAL PIC 9(1).
000088     01 NUM_ON  EXTERNAL PIC 9(1).
000089     01 NUM_X   EXTERNAL PIC 9(1).
000090     01 OCT     EXTERNAL PIC 9(1).
000091 
000092 *> 16進数 対応表 0 〜 15
000093     01 H_TBL1 EXTERNAL.
000094         03 H_TBL11 OCCURS 16.
000095             05 H_TBL PIC X(1).
000096 
000097 PROCEDURE DIVISION.
000098     MOVE 2 TO BNY.
000099     MOVE 4 TO BIT4.
000100     MOVE 4 TO BYT4.
000101     MOVE 32 TO BYT32.
000102     MOVE 256 TO BYT256.
000103     MOVE 16 TO HXD.
000104     MOVE 0 TO NUM_OFF.
000105     MOVE 1 TO NUM_ON.
000106     MOVE 9 TO NUM_X.
000107     MOVE 8 TO OCT.
000108 
000109     MOVE "0123456789ABCDEF" TO H_TBL1.
000110 END PROGRAM SET_EXTERNAL.
000111 
000112 PROGRAM-ID. B_TABLE.
000113 *> 2進数 対応表 0 〜 15
000114 *> 0001
000115 *> 0010
000116 *> 中略
000117 *> 1111
000118 DATA DIVISION.
000119 WORKING-STORAGE SECTION.
000120 *> 16
000121     01 HXD     EXTERNAL PIC 9(2).
000122 *> 2
000123     01 BNY     EXTERNAL PIC 9(1).
000124 *> 4
000125     01 BYT4    EXTERNAL PIC 9(1).
000126 *> 8
000127     01 OCT     EXTERNAL PIC 9(1).
000128 
000129     01 p       PIC 9(1).
000130 
000131     01 i       PIC 9(8).
000132     01 j       PIC 9(8).
000133 
000134     01 q       PIC 9(2).
000135     01 r       PIC 9(1).
000136 
000137     01 s       PIC X(1).
000138     01 str     PIC X(4).
000139 
000140     01 len     PIC 9(1).
000141     01 idx     PIC 9(2).
000142 
000143 *> 2進数 対応表 0 〜 15
000144     01 B_TBL1 EXTERNAL.
000145         03 B_TBL11 OCCURS 16.
000146             05 B_TBL PIC X(4).
000147 
000148 PROCEDURE DIVISION.
000149 *> 0 〜 15
000150     PERFORM VARYING i FROM 0 BY 1 UNTIL HXD <= i
000151 
000152         MOVE i TO q
000153         MOVE ALL ZERO TO str
000154 
000155 *> 繰り返し 2 で割る
000156         PERFORM VARYING j FROM 0 BY 1 UNTIL q <= 0
000157 
000158             DIVIDE BNY INTO q GIVING q REMAINDER r
000159 
000160             COMPUTE p = FUNCTION STORED-CHAR-LENGTH(str)
000161             SUBTRACT j FROM p
000162 
000163             MOVE r TO s
000164 
000165             STRING
000166                 s
000167                 INTO str WITH POINTER p
000168             END-STRING
000169 
000170         END-PERFORM
000171 
000172         ADD 1 TO i GIVING idx
000173 *> 2進数 対応表 設定
000174         MOVE str TO B_TBL(idx)
000175 
000176     END-PERFORM.
000177 END PROGRAM B_TABLE.
000178 
000179 PROGRAM-ID. DCM_TO_HEX.
000180 *> 10進数 を 16進数 に変換
000181 *> 4 byte (32 bit) 用
000182 *> Convert decimal number to hexadecimal number
000183 *> For 4 byte (32 bit)
000184 DATA DIVISION.
000185 WORKING-STORAGE SECTION.
000186 *> 2
000187     01 BNY     EXTERNAL PIC 9(1).
000188 *> 4
000189     01 BYT4    EXTERNAL PIC 9(1).
000190 *> 256
000191     01 BYT256  EXTERNAL PIC 9(3).
000192 *> 8
000193     01 OCT     EXTERNAL PIC 9(1).
000194 
000195     01 d       PIC 9(3) BINARY.
000196 
000197     01 filler REDEFINES d.
000198         03 filler PIC X.
000199         03 dbyte  PIC X.
000200 
000201     01 i       PIC 9(1).
000202     01 idx     PIC 9(1).
000203 
000204     01 q       PIC 9(10).
000205     01 r       PIC 9(3).
000206 
000207 LINKAGE SECTION.
000208 *> (IN)  d_num
000209 *> (OUT) h_num
000210     01 d_num   PIC 9(10).
000211     01 h_num   PIC X(4).
000212 
000213 PROCEDURE DIVISION USING d_num h_num.
000214     INITIALIZE h_num
000215     MOVE d_num TO q
000216 
000217 *> 1 byte ずつ処理
000218     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH of h_num < i
000219 *> 4 - i
000220         COMPUTE idx = BYT4 - i
000221 
000222 *> 10進数 を 256 で割る
000223         DIVIDE BYT256 INTO q GIVING q REMAINDER r
000224 
000225 *> 余り(10進数 1 byte) を 代入することで
000226         MOVE r TO d
000227 
000228 *> 16進数 を得ることができる
000229         MOVE dbyte TO h_num(idx + 1:1)
000230     END-PERFORM.
000231 END PROGRAM DCM_TO_HEX.
000232 
000233 PROGRAM-ID. HEX_TO_OTHER.
000234 *> 16進数 を 2進数、10進数 に変換
000235 *> 4 byte (32 bit) 用
000236 *> Convert hexadecimal number to binary number, decimal number
000237 *> For 4 byte (32 bit)
000238 DATA DIVISION.
000239 WORKING-STORAGE SECTION.
000240 *> 4
000241     01 BIT4    EXTERNAL PIC 9(1).
000242 *> 2
000243     01 BNY     EXTERNAL PIC 9(1).
000244 *> 4
000245     01 BYT4    EXTERNAL PIC 9(1).
000246 *> 256
000247     01 BYT256  EXTERNAL PIC 9(3).
000248 *> 16
000249     01 HXD     EXTERNAL PIC 9(2).
000250 *> 8
000251     01 OCT     EXTERNAL PIC 9(1).
000252 
000253     01 d       PIC 9(3) BINARY.
000254 
000255     01 filler REDEFINES d.
000256         03 filler PIC X.
000257         03 dbyte  PIC X.
000258 
000259     01 i       PIC 9(1).
000260 
000261     01 j       PIC 9(1).
000262     01 k       PIC 9(2).
000263     01 m       PIC 9(1).
000264 
000265     01 q       PIC 9(10).
000266     01 r       PIC 9(2).
000267 
000268 *> 2進数 対応表 0 〜 15
000269     01 B_TBL1 EXTERNAL.
000270         03 B_TBL11 OCCURS 16.
000271             05 B_TBL PIC X(4).
000272 
000273 *> 16進数 対応表 0 〜 15
000274     01 H_TBL1 EXTERNAL.
000275         03 H_TBL11 OCCURS 16.
000276             05 H_TBL PIC X(1).
000277 
000278 LINKAGE SECTION.
000279 *> (IN)  h_num
000280 *> (OUT) b_txt
000281 *>       d_num
000282 *>       h_txt
000283     01 h_num   PIC X(4).
000284     01 b_txt   PIC X(32).
000285     01 d_num   PIC 9(10).
000286     01 h_txt   PIC X(8).
000287 
000288 PROCEDURE DIVISION USING h_num b_txt d_num h_txt.
000289     INITIALIZE b_txt
000290     INITIALIZE d_num
000291     INITIALIZE h_txt
000292 
000293 *> 1 byte ずつ処理
000294     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH OF h_num < i
000295 *> 2 * i - 1
000296         COMPUTE j = BNY * i - 1
000297 
000298 *> 8 * i - 7
000299         COMPUTE k = OCT * (i - 1) + 1
000300 
000301 *> 7 - (2 * i - 1)
000302         COMPUTE m = OCT - BNY * i
000303 
000304 *> 16進数 1 byte を 代入することで
000305         MOVE h_num(i:1) TO dbyte
000306 
000307 *> 得られた 10進数 を 16 で割る
000308         DIVIDE HXD INTO d GIVING q REMAINDER r
000309 
000310 *> 前から格納していく
000311 *> [F]
000312         MOVE H_TBL(q + 1) TO h_txt(j:1)
000313 *> [FF]
000314         MOVE H_TBL(r + 1) TO h_txt(j + 1:1)
000315 
000316 *> [1111]
000317         MOVE B_TBL(q + 1) TO b_txt(k:BIT4)
000318 *> [11111111]
000319         MOVE B_TBL(r + 1) TO b_txt(k + BIT4:BIT4)
000320 
000321 *> 16^0 の位 から 16^7 の位 までの 8桁
000322 *> 10進数 上位桁 足し込み
000323         COMPUTE d_num = d_num + HXD ** (m + 1) * q
000324 
000325 *> 10進数 下位桁 足し込み
000326         COMPUTE d_num = d_num + HXD ** m * r
000327     END-PERFORM.
000328 END PROGRAM HEX_TO_OTHER.
000329 
000330 PROGRAM-ID. DCM_TO_BNY.
000331 *> 10進数 を 2進数 に変換
000332 *> 4 byte (32 bit) 用
000333 *> Convert decimal number to binary number
000334 *> For 4 byte (32 bit)
000335 DATA DIVISION.
000336 WORKING-STORAGE SECTION.
000337 *> 4
000338     01 BIT4    EXTERNAL PIC 9(1).
000339 *> 2
000340     01 BNY     EXTERNAL PIC 9(1).
000341 *> 4
000342     01 BYT4    EXTERNAL PIC 9(1).
000343 *> 32
000344     01 BYT32   EXTERNAL PIC 9(2).
000345 *> 256
000346     01 BYT256  EXTERNAL PIC 9(3).
000347 *> 16
000348     01 HXD     EXTERNAL PIC 9(2).
000349 *> 8
000350     01 OCT     EXTERNAL PIC 9(1).
000351 
000352     01 i       PIC 9(2).
000353 
000354     01 j       PIC 9(1).
000355     01 k       PIC 9(2).
000356     01 m       PIC 9(1).
000357 
000358     01 q       PIC 9(10).
000359     01 r       PIC 9(2).
000360 
000361 *> 2進数 対応表 0 〜 15
000362     01 B_TBL1 EXTERNAL.
000363         03 B_TBL11 OCCURS 16.
000364             05 B_TBL PIC X(4).
000365 
000366 *> 16進数 対応表 0 〜 15
000367     01 H_TBL1 EXTERNAL.
000368         03 H_TBL11 OCCURS 16.
000369             05 H_TBL PIC X(1).
000370 
000371 LINKAGE SECTION.
000372 *> (IN)  d_num
000373 *> (OUT) b_txt
000374     01 d_num   PIC 9(10).
000375     01 b_txt   PIC X(32).
000376 
000377 PROCEDURE DIVISION USING d_num b_txt.
000378     MOVE ALL ZERO TO b_txt
000379 
000380     MOVE d_num TO q
000381 
000382     PERFORM VARYING i FROM 1 BY 1 UNTIL q <= 0
000383 *> 32 - 4 * i + 1
000384         COMPUTE k = BYT32 - BYT4 * i + 1
000385 
000386 *> 10進数 を 16 で割る
000387         DIVIDE HXD INTO q GIVING q REMAINDER r
000388 
000389 *> 後ろから格納していく
000390 *> [1111]
000391         MOVE B_TBL(r + 1) TO b_txt(k:BIT4)
000392 
000393     END-PERFORM.
000394 END PROGRAM DCM_TO_BNY.
000395 
000396 PROGRAM-ID. BNY_TO_DCM.
000397 *> 2進数 を 10進数 に変換
000398 *> 4 byte (32 bit) 用
000399 *> Convert binary number to decimal number
000400 *> For 4 byte (32 bit)
000401 DATA DIVISION.
000402 WORKING-STORAGE SECTION.
000403 *> 4
000404     01 BIT4    EXTERNAL PIC 9(1).
000405 *> 2
000406     01 BNY     EXTERNAL PIC 9(1).
000407 *> 4
000408     01 BYT4    EXTERNAL PIC 9(1).
000409 *> 32
000410     01 BYT32   EXTERNAL PIC 9(2).
000411 *> 256
000412     01 BYT256  EXTERNAL PIC 9(3).
000413 *> 16
000414     01 HXD     EXTERNAL PIC 9(2).
000415 *> 8
000416     01 OCT     EXTERNAL PIC 9(1).
000417 
000418     01 i       PIC 9(2).
000419     01 j       PIC 9(2).
000420 
000421     01 tmp     PIC 9(1).
000422 
000423 LINKAGE SECTION.
000424 *> (IN)  b_num
000425 *> (OUT) d_num
000426     01 b_txt   PIC X(32).
000427     01 d_num   PIC 9(10).
000428 
000429 PROCEDURE DIVISION USING b_txt d_num.
000430     INITIALIZE d_num
000431 
000432     MOVE ZERO TO i
000433 
000434 *> 32 bit 処理
000435     PERFORM BYT32 TIMES
000436 
000437 *> 32 - i
000438         COMPUTE j = BYT32 - i
000439 
000440         MOVE b_txt(j:1) TO tmp
000441 
000442 *> 2^0 の位 から 2^31 の位 までの 32 bit
000443 *> 10進数 足し込み
000444         COMPUTE d_num = d_num + BNY ** i * tmp
000445 
000446         ADD 1 TO i
000447 
000448     END-PERFORM.
000449 END PROGRAM BNY_TO_DCM.
000450 
000451 PROGRAM-ID. BNY_TO_HEX.
000452 *> 2進数 を 16進数 に変換
000453 *> 4 byte (32 bit) 用
000454 *> Convert binary number to hexadecimal number
000455 *> For 4 byte (32 bit)
000456 DATA DIVISION.
000457 WORKING-STORAGE SECTION.
000458 *> 4
000459     01 BIT4    EXTERNAL PIC 9(1).
000460 *> 2
000461     01 BNY     EXTERNAL PIC 9(1).
000462 *> 4
000463     01 BYT4    EXTERNAL PIC 9(1).
000464 *> 256
000465     01 BYT256  EXTERNAL PIC 9(3).
000466 *> 16
000467     01 HXD     EXTERNAL PIC 9(2).
000468 *> 8
000469     01 OCT     EXTERNAL PIC 9(1).
000470 
000471     01 d       PIC 9(4) BINARY.
000472 
000473     01 filler REDEFINES d.
000474         03 filler PIC X.
000475         03 dbyte  PIC X.
000476 
000477     01 i       PIC 9(2).
000478     01 j       PIC 9(2).
000479     01 k       PIC 9(2).
000480 
000481     01 tmp     PIC 9(1).
000482 
000483 LINKAGE SECTION.
000484 *> (IN)  b_txt
000485 *> (OUT) h_num
000486     01 b_txt   PIC X(32).
000487     01 h_num   PIC X(4).
000488 
000489 PROCEDURE DIVISION USING b_txt h_num.
000490     INITIALIZE h_num
000491 
000492 *> 1 byte ずつ処理
000493     PERFORM VARYING i FROM 1 BY 1 UNTIL LENGTH OF h_num < i
000494 
000495         MOVE ZERO TO d
000496 
000497 *> 8 * (i - 1) + 1
000498         COMPUTE k = OCT * (i - 1) + 1
000499 
000500 *> 2進数 から 1 byte 取得 10進数 を 代入することで
000501         PERFORM VARYING j FROM 1 BY 1 UNTIL OCT < j
000502             MOVE b_txt(k + j - 1:1) TO tmp
000503             COMPUTE d = d + BNY ** (OCT - j) * tmp
000504         END-PERFORM
000505 
000506 *> 16進数 を得ることができる
000507         MOVE dbyte TO h_num(i:1)
000508     END-PERFORM.
000509 END PROGRAM BNY_TO_HEX.
000510 
000511 PROGRAM-ID. GET_NTH_BIT.
000512 *> Nビット目 を 取り出す
000513 *> 4 byte (32 bit) 用
000514 *> Get N-th bit
000515 *> For 4 byte (32 bit)
000516 DATA DIVISION.
000517 WORKING-STORAGE SECTION.
000518 *> 2
000519     01 BNY     EXTERNAL PIC 9(1).
000520 *> 4
000521     01 BYT4    EXTERNAL PIC 9(1).
000522 *> 32
000523     01 BYT32   EXTERNAL PIC 9(2).
000524 *> 256
000525     01 BYT256  EXTERNAL PIC 9(3).
000526 *> 16
000527     01 HXD     EXTERNAL PIC 9(2).
000528 *> 8
000529     01 OCT     EXTERNAL PIC 9(1).
000530 
000531     01 b_tmp   PIC X(32).
000532 
000533 LINKAGE SECTION.
000534 *> (IN)  x_th
000535 *>       d_num
000536 *> (OUT) n_bit
000537     01 x_th    PIC 9(2) VALUE ZERO.
000538     01 d_num   PIC 9(10).
000539     01 n_bit   PIC 9(1).
000540 
000541 PROCEDURE DIVISION USING x_th d_num n_bit.
000542     INITIALIZE n_bit
000543 
000544     CALL "DCM_TO_BNY" USING BY CONTENT d_num
000545                               BY REFERENCE b_tmp
000546 
000547 *> 右から x_th 番目を取り出す
000548     MOVE b_tmp(BYT32 - x_th + 1:1) TO n_bit.
000549 END PROGRAM GET_NTH_BIT.
000550 
000551 PROGRAM-ID. SET_NTH.
000552 *> Nビット目 操作
000553 *> 4 byte (32 bit) 用
000554 *> Set N-th bit operation
000555 *> For 4 byte (32 bit)
000556 DATA DIVISION.
000557 WORKING-STORAGE SECTION.
000558 *> 2
000559     01 BNY     EXTERNAL PIC 9(1).
000560 *> 4
000561     01 BYT4    EXTERNAL PIC 9(1).
000562 *> 32
000563     01 BYT32   EXTERNAL PIC 9(2).
000564 *> 256
000565     01 BYT256  EXTERNAL PIC 9(3).
000566 *> 16
000567     01 HXD     EXTERNAL PIC 9(2).
000568 *> 0
000569     01 NUM_OFF EXTERNAL PIC 9(1).
000570 *> 1
000571     01 NUM_ON  EXTERNAL PIC 9(1).
000572 *> 9
000573     01 NUM_X   EXTERNAL PIC 9(1).
000574 *> 8
000575     01 OCT     EXTERNAL PIC 9(1).
000576 
000577     01 b_tmp   PIC X(32).
000578     01 h_tmp   PIC X(4).
000579 
000580 LINKAGE SECTION.
000581 *> (IN)  x_th
000582 *>       x_div
000583 *>       d_num
000584 *> (OUT) d_num
000585 *>       h_num
000586     01 x_th    PIC 9(2).
000587     01 x_div   PIC 9(1).
000588     01 d_num   PIC 9(10).
000589     01 h_num   PIC X(4).
000590 
000591 PROCEDURE DIVISION USING x_th x_div d_num h_num.
000592     MOVE ALL ZERO TO b_tmp
000593 
000594     IF x_div = NUM_OFF THEN
000595 *> 1111 1111 1111 1111 1111 1111 1111 1111
000596         MOVE ALL '1' TO b_tmp
000597     END-IF
000598 
000599 *> フラグ設定
000600     MOVE x_div TO b_tmp(BYT32 - x_th + 1:1)
000601 
000602     IF x_div = NUM_X THEN
000603 *> 1
000604         MOVE NUM_ON TO b_tmp(BYT32 - x_th + 1:1)
000605     END-IF
000606 
000607     CALL "BNY_TO_HEX" USING BY CONTENT b_tmp
000608                               BY REFERENCE h_tmp
000609 
000610 *> Nビット目 操作
000611 *> 0 をセットする
000612     IF x_div = NUM_OFF THEN
000613         CALL "CBL_AND" USING h_tmp, h_num, BY VALUE BYT4
000614     ELSE
000615 *> 1 をセットする
000616         IF x_div = NUM_ON THEN
000617             CALL "CBL_OR" USING h_tmp, h_num, BY VALUE BYT4
000618 *> 反転する
000619         ELSE
000620             CALL "CBL_XOR" USING h_tmp, h_num, BY VALUE BYT4
000621         END-IF
000622     END-IF.
000623 END PROGRAM SET_NTH.

