000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_225_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(10).
000007 01 a          PIC 9(10).
000008 01 b          PIC 9(10).
000009 01 grp1.
000010    03 grp     PIC 9(10) VALUE ZERO OCCURS 100000 DEPENDING N.
000011 01 i          PIC 9(10) COMP.
000012 01 ln         PIC X(30).
000013 01 mx         PIC 9(10) VALUE ZERO.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT N.
000017   PERFORM VARYING i FROM 1 BY 1 UNTIL N - 1 < i
000018     ACCEPT ln
000019     UNSTRING ln DELIMITED SPACE INTO a b
000020     ADD 1 TO grp(a)
000021     ADD 1 TO grp(b)
000022     IF mx < grp(a) MOVE grp(a) TO mx END-IF
000023     IF mx < grp(b) MOVE grp(b) TO mx END-IF
000024   END-PERFORM.
000025   IF mx = N - 1 DISPLAY "Yes" ELSE DISPLAY "No".
000026   STOP RUN.

