000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_055_A.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(3).
000007 01 tmp        PIC 9(6).
000008 01 tmpN       PIC 9(3).
000009 01 zs         PIC Z(7).
000010
000011 PROCEDURE DIVISION.
000012   ACCEPT N.
000013   DIVIDE 15 INTO N GIVING tmpN.
000014   COMPUTE tmp = 800 * N - tmpN * 200.
000015   MOVE tmp TO zs.
000016   DISPLAY FUNCTION TRIM(zs).
000017   STOP RUN.

