000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_122_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 i          PIC 9(10) VALUE 1 COMP.
000007 01 S          PIC X(10).
000008 01 ACGT       PIC X(4) VALUE "ACGT".
000009 01 cnt        PIC 9(10) VALUE ZERO.
000010 01 num        PIC 9(10) VALUE ZERO.
000011 01 ans        PIC 9(10) VALUE ZERO.
000012 01 zs         PIC Z(9)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT S.
000016   PERFORM VARYING i FROM 1 BY 1
000017   UNTIL FUNCTION STORED-CHAR-LENGTH(S) < i
000018     MOVE ZERO TO cnt
000019     INSPECT ACGT TALLYING cnt FOR ALL S(i:1)
000020     IF ZERO < cnt
000021       ADD 1 TO num
000022     ELSE
000023       MOVE ZERO TO num
000024     END-IF
000025     IF ans < num
000026       MOVE num TO ans
000027     END-IF
000028   END-PERFORM.
000029   MOVE ans TO zs.
000030   DISPLAY FUNCTION TRIM(zs).
000031   STOP RUN.
