000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_106_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 maxlen     PIC 9(10) VALUE 100 COMP.
000008 01 cur        PIC 9(10) VALUE 1 COMP.
000009 01 i          PIC 9(10) VALUE 1 COMP.
000010 01 j          PIC 9(10) COMP.
000011 01 len        PIC 9(10) COMP.
000012 01 ans        PIC 9(10).
000013 01 zs         PIC Z(9)9.
000014 01 N          PIC 9(10).
000015 01 cnt        PIC 9(10).
000016 01 d          PIC 9(10).
000017 01 m          PIC 9(10).
000018 01 tmp        PIC 9(10).
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT N.
000022 
000023   MOVE ZERO TO cnt.
000024 
000025   PERFORM VARYING i FROM 1 BY 2 UNTIL N < i
000026     MOVE ZERO TO tmp
000027     PERFORM VARYING j FROM 1 BY 1 UNTIL i < j
000028       DIVIDE j INTO i GIVING D REMAINDER m
000029       IF ZERO = m
000030         ADD 1 TO tmp
000031       END-IF
000032     END-PERFORM
000033     IF 8 = tmp
000034       ADD 1 TO cnt
000035     END-IF
000036   END-PERFORM
000037   MOVE cnt TO zs.
000038   DISPLAY FUNCTION TRIM(zs).
000039   STOP RUN.

