000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_054_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A1.
000007    03 A11 OCCURS 50 DEPENDING ON N.
000008       05 A    PIC X(50).
000009 01 B1.
000010    03 B11 OCCURS 50 DEPENDING ON M.
000011       05 B    PIC X(50).
000012 01 N          PIC 9(10).
000013 01 M          PIC 9(10).
000014 01 flg        PIC 9(1).
000015 01 i          PIC 9(10) VALUE 1 COMP.
000016 01 j          PIC 9(10) VALUE 1 COMP.
000017 01 k          PIC 9(10) VALUE 1 COMP.
000018 01 ln         PIC X(400).
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT ln.
000022   UNSTRING ln DELIMITED BY SPACE INTO N M.
000023   PERFORM N TIMES
000024     ACCEPT A(i)
000025     ADD 1 TO i
000026   END-PERFORM.
000027   MOVE 1 TO i.
000028   PERFORM M TIMES
000029     ACCEPT B(i)
000030     ADD 1 TO i
000031   END-PERFORM.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i + M - 1
000033     PERFORM VARYING j FROM 1 BY 1 UNTIL N < j + M - 1
000034       MOVE ZERO TO flg
000035       PERFORM VARYING k FROM 1 BY 1 UNTIL M < k
000036         IF A(i + k - 1)(j : M) NOT = B(k)
000037           MOVE 1 TO flg
000038           EXIT PERFORM
000039         END-IF
000040       END-PERFORM
000041       IF flg = ZERO THEN
000042         EXIT PERFORM
000043       END-IF
000044     END-PERFORM
000045     IF flg = ZERO THEN
000046       EXIT PERFORM
000047     END-IF
000048   END-PERFORM
000049   IF flg = ZERO THEN
000050     DISPLAY "Yes"
000051   ELSE
000052     DISPLAY "No"
000053   END-IF.
000054   STOP RUN.

