000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_107_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(400).
000007 01 H          PIC 9(10).
000008 01 W          PIC 9(10).
000009 01 i          PIC 9(10) COMP.
000010 01 j          PIC 9(10) COMP.
000011 01 a1.
000012    03 a11 OCCURS 100 DEPENDING H INDEXED XA.
000013       05 a    PIC X(100).
000014 01 cntH1.
000015    03 cntH11 OCCURS 100 DEPENDING H INDEXED XH.
000016       05 cntH PIC 9(1) VALUE ZERO.
000017 01 cntW1.
000018    03 cntW11 OCCURS 100 DEPENDING W INDEXED XW.
000019       05 cntW PIC 9(1) VALUE ZERO.
000020 01 c          PIC 9(10) VALUE ZERO.
000021 01 flgH       PIC 9(1).
000022 01 flgW       PIC 9(1).
000023 01 st         PIC X(100).
000024 
000025 PROCEDURE DIVISION.
000026   ACCEPT ln.
000027   UNSTRING ln DELIMITED BY SPACE INTO H W.
000028 
000029   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000030     SET XA TO i
000031     ACCEPT a(XA)
000032   END-PERFORM
000033 
000034   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000035     MOVE 1 TO flgH
000036     PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
000037       SET XA TO i
000038       IF a(XA)(j:1) = '#'
000039         MOVE ZERO TO flgH
000040         EXIT PERFORM
000041       END-IF
000042     END-PERFORM
000043     IF 1 = flgH
000044       SET XH TO i
000045       MOVE 1 TO cntH(XH)
000046     END-IF
000047   END-PERFORM.
000048 
000049   PERFORM VARYING i FROM 1 BY 1 UNTIL W < i
000050     MOVE 1 TO flgW
000051     PERFORM VARYING j FROM 1 BY 1 UNTIL H < j
000052       SET XA TO j
000053       IF a(XA)(i:1) = '#'
000054         MOVE ZERO TO flgW
000055         EXIT PERFORM
000056       END-IF
000057     END-PERFORM
000058     IF 1 = flgW
000059       SET XW TO i
000060       MOVE 1 TO cntW(XW)
000061     END-IF
000062   END-PERFORM.
000063 
000064   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000065     SET XH TO i
000066     SET XA TO i
000067     IF ZERO = cntH(XH)
000068       MOVE ZERO TO c
000069       PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
000070         SET XW TO j
000071         IF ZERO = cntW(XW)
000072           MOVE a(XA)(j:1) TO st(j - c:1)
000073         ELSE
000074           ADD 1 TO c
000075         END-IF
000076       END-PERFORM
000077       DISPLAY st(1:FUNCTION STORED-CHAR-LENGTH(st))
000078     END-IF
000079   END-PERFORM.
000080 
000081   STOP RUN.
