000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_233_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X         PIC 9(10).
000007 01 Y         PIC 9(10).
000008 01 ln        PIC X(30).
000009 01 yen       PIC S9(10).
000010 01 zs        PIC Z(9)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED SPACE INTO X Y.
000015   SUBTRACT X FROM y GIVING yen.
000016   IF yen < ZERO MOVE ZERO TO yen.
000017   ADD 9 TO yen.
000018   COMPUTE zs = yen / 10.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

