000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_250_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 C          PIC 9(10).
000007 01 H          PIC 9(10).
000008 01 R          PIC 9(10).
000009 01 W          PIC 9(10).
000010 01 ln         PIC X(30).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED SPACE INTO H W.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO R C.
000017   IF 1 = H AND 1 = W DISPLAY 0
000018   ELSE IF H = 1 AND 1 < C AND C < W DISPLAY 2
000019   ELSE IF H = 1 DISPLAY 1
000020   ELSE IF W = 1 AND 1 < R AND R < H DISPLAY 2
000021   ELSE IF W = 1 DISPLAY 1
000022   ELSE IF 1 < R AND R < H AND 1 < C AND C < W DISPLAY 4
000023   ELSE IF (R = 1 OR H) AND (C = 1 OR W) DISPLAY 2
000024   ELSE DISPLAY 3.
000025   STOP RUN.

