000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_031_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 H          PIC 9(10).
000008 01 L          PIC 9(10).
000009 01 N          PIC 9(10).
000010 01 ans        PIC S9(10).
000011 01 i          PIC 9(10) COMP.
000012 01 ln         PIC X(30).
000013 01 zs         PIC -(9)9.
000014 
000015 PROCEDURE DIVISION.
000016   ACCEPT ln.
000017   UNSTRING ln DELIMITED BY SPACE INTO L H.
000018   ACCEPT N.
000019   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000020     ACCEPT A
000021     IF A < L THEN
000022       COMPUTE ans = L - A
000023     ELSE
000024       IF L <= A AND A <= H THEN
000025         MOVE ZERO TO ans
000026       ELSE
000027         MOVE -1 TO ans
000028       END-IF
000029     END-IF
000030     MOVE ans TO zs
000031     DISPLAY FUNCTION TRIM(zs)
000032   END-PERFORM.
000033   STOP RUN.

