000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_257_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 K          PIC 9(10).
000008 01 L          PIC 9(10).
000009 01 N          PIC 9(10).
000010 01 Q          PIC 9(10).
000011 01 i          PIC 9(10) COMP.
000012 01 ln         PIC X(4000).
000013 01 pieces1.
000014    03 pieces  PIC 9(10) VALUE ZERO OCCURS 200 DEPENDING K.
000015 01 pt         PIC S9(10).
000016 01 squares1.
000017    03 squares PIC 9(1) VALUE ZERO OCCURS 200 DEPENDING N.
000018 01 zs         PIC Z(9)9.
000019 
000020 PROCEDURE DIVISION.
000021   ACCEPT ln.
000022   UNSTRING ln DELIMITED SPACE INTO N K Q.
000023   MOVE 1 TO pt.
000024   ACCEPT ln.
000025   PERFORM VARYING i FROM 1 BY 1 UNTIL K < i
000026     UNSTRING ln DELIMITED SPACE INTO A POINTER pt
000027     MOVE 1 TO squares(A)
000028     MOVE A TO pieces(i)
000029   END-PERFORM.
000030   MOVE 1 TO pt.
000031   ACCEPT ln.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL Q < i
000033     UNSTRING ln DELIMITED SPACE INTO L POINTER pt
000034     IF pieces(L) + 1 <= N AND ZERO = squares(pieces(L) + 1)
000035       MOVE 1 TO squares(pieces(L) + 1)
000036       MOVE ZERO TO squares(pieces(L))
000037       ADD 1 TO pieces(L)
000038   END-PERFORM.
000039   PERFORM VARYING i FROM 1 BY 1 UNTIL K < i
000040     MOVE pieces(i) TO zs
000041     DISPLAY FUNCTION TRIM(zs) WITH NO ADVANCING
000042     DISPLAY SPACE WITH NO ADVANCING
000043   END-PERFORM.
000044   DISPLAY SPACE.
000045   STOP RUN.

