000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_163_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 R          PIC 9(3)V9(7).
000007 01 ans        PIC 9(3)V9(7).
000008 01 pi         PIC 9(3)V9(7) VALUE 3.1415926.
000009 01 zs         PIC Z(2)9.9(7).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT R.
000013   COMPUTE ans = 2 * R * pi.
000014   MOVE ans TO zs.
000015   DISPLAY FUNCTION TRIM(zs).
000016   STOP RUN.

