000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_253_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 a          PIC 9(10).
000007 01 b          PIC 9(10).
000008 01 c          PIC 9(10).
000009 01 ln         PIC X(30).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT ln.
000013   UNSTRING ln DELIMITED SPACE INTO a b c.
000014   IF c <= b AND b <= a DISPLAY "Yes"
000015   ELSE IF a <= b AND b <= c DISPLAY "Yes"
000016   ELSE DISPLAY "No".
000017   STOP RUN.

