000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_089_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(3).
000007 01 S          PIC X(1).
000008 01 cnt        PIC 9(3).
000009 01 cur        PIC 9(3) VALUE 1.
000010 01 i          PIC 9(18) VALUE 1.
000011 01 j          PIC 9(18).
000012 01 len        PIC 9(3).
000013 01 ln         PIC X(200).
000014 01 maxlen     PIC 9(3).
000015 
000016 PROCEDURE DIVISION.
000017   ACCEPT N.
000018   ACCEPT ln.
000019   MOVE 0 TO cnt.
000020   MOVE N TO maxlen.
000021   PERFORM maxlen TIMES
000022     PERFORM VARYING j FROM cur BY 1
000023       UNTIL ln(j:1) = SPACE
000024     END-PERFORM
000025     COMPUTE len = j - cur
000026     MOVE ln(cur:len) TO S
000027     IF S = 'Y' THEN
000028       MOVE 1 TO cnt
000029       EXIT PERFORM
000030     END-IF
000031     COMPUTE cur = j + 1
000032     ADD 1 TO i
000033   END-PERFORM.
000034   IF 0 < cnt THEN
000035     DISPLAY "Four"
000036   ELSE
000037     DISPLAY "Three"
000038   END-IF.
000039   STOP RUN.
