000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_100_D.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC 9(4).
000007 01 M          PIC 9(4).
000008 01 ln         PIC X(38).
000009 01 a          PIC 9(4).
000010 01 b          PIC 9(4).
000011 01 x          PIC S9(11).
000012 01 y          PIC S9(11).
000013 01 z          PIC S9(11).
000014 01 mx         PIC 9(14).
000015 01 sm         PIC S9(14).
000016 01 c000_1.
000017    03 c000_11 OCCURS 1000 DEPENDING N.
000018       05 c000 PIC S9(11).
000019 01 c001_1.
000020    03 c001_11 OCCURS 1000 DEPENDING N.
000021       05 c001 PIC S9(11).
000022 01 c010_1.
000023    03 c010_11 OCCURS 1000 DEPENDING N.
000024       05 c010 PIC S9(11).
000025 01 c100_1.
000026    03 c100_11 OCCURS 1000 DEPENDING N.
000027       05 c100 PIC S9(11).
000028 01 c011_1.
000029    03 c011_11 OCCURS 1000 DEPENDING N.
000030       05 c011 PIC S9(11).
000031 01 c101_1.
000032    03 c101_11 OCCURS 1000 DEPENDING N.
000033       05 c101 PIC S9(11).
000034 01 c110_1.
000035    03 c110_11 OCCURS 1000 DEPENDING N.
000036       05 c110 PIC S9(11).
000037 01 c111_1.
000038    03 c111_11 OCCURS 1000 DEPENDING N.
000039       05 c111 PIC S9(11).
000040 01 cake000    PIC 9(14) VALUE ZERO.
000041 01 cake001    PIC 9(14) VALUE ZERO.
000042 01 cake010    PIC 9(14) VALUE ZERO.
000043 01 cake100    PIC 9(14) VALUE ZERO.
000044 01 cake011    PIC 9(14) VALUE ZERO.
000045 01 cake101    PIC 9(14) VALUE ZERO.
000046 01 cake110    PIC 9(14) VALUE ZERO.
000047 01 cake111    PIC 9(14) VALUE ZERO.
000048 01 zs         PIC Z(14)9.
000049 01 i          PIC 9(4) BINARY.
000050 
000051 PROCEDURE DIVISION.
000052   ACCEPT ln.
000053   UNSTRING ln DELIMITED BY SPACE INTO N M.
000054   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000055     ACCEPT ln
000056     UNSTRING ln DELIMITED BY SPACE INTO x y z
000057     COMPUTE sm = -x - y - z
000058     MOVE sm TO c000(i)
000059     COMPUTE sm = -x - y + z
000060     MOVE sm TO c001(i)
000061     COMPUTE sm = -x + y - z
000062     MOVE sm TO c010(i)
000063     COMPUTE sm = x - y - z
000064     MOVE sm TO c100(i)
000065     COMPUTE sm = -x + y + z
000066     MOVE sm TO c011(i)
000067     COMPUTE sm = x - y + z
000068     MOVE sm TO c101(i)
000069     COMPUTE sm = x + y - z
000070     MOVE sm TO c110(i)
000071     COMPUTE sm = x + y + z
000072     MOVE sm TO c111(i)
000073   END-PERFORM.
000074   SORT c000_11 DESCENDING c000.
000075   SORT c001_11 DESCENDING c001.
000076   SORT c010_11 DESCENDING c010.
000077   SORT c100_11 DESCENDING c100.
000078   SORT c011_11 DESCENDING c011.
000079   SORT c101_11 DESCENDING c101.
000080   SORT c110_11 DESCENDING c110.
000081   SORT c111_11 DESCENDING c111.
000082   PERFORM VARYING i FROM 1 BY 1 UNTIL M < i
000083     ADD c000(i) TO cake000
000084     ADD c001(i) TO cake001
000085     ADD c010(i) TO cake010
000086     ADD c100(i) TO cake100
000087     ADD c011(i) TO cake011
000088     ADD c101(i) TO cake101
000089     ADD c110(i) TO cake110
000090     ADD c111(i) TO cake111
000091   END-PERFORM.
000092   COMPUTE mx = FUNCTION MAX(cake000, cake001, cake010, cake100,
000093     cake011, cake101, cake110, cake111).
000094   MOVE mx TO zs.
000095   DISPLAY FUNCTION TRIM(zs).
000096   STOP RUN.

