000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_214_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N         PIC 9(10).
000007 01 ans       PIC Z(9)9.
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT N.
000011   MOVE 8 TO ans.
000012   IF 1 <= N AND N <= 125 MOVE 4 TO ans
000013   ELSE IF 126 <= N AND N <= 211 MOVE 6 TO ans
000014   END-IF.
000015   DISPLAY FUNCTION TRIM(ans).
000016   STOP RUN.

