000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_153_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A              PIC 9(5).
000007 01 H              PIC 9(5).
000008 01 LN             PIC X(11).
000009 01 num            PIC 9(5).
000010 01 zs             PIC Z(4)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT LN.
000014   UNSTRING LN DELIMITED BY SPACE INTO H A.
000015   COMPUTE num = (H + (A - 1)) / A.
000016   MOVE num TO zs.
000017   DISPLAY FUNCTION TRIM(zs).
000018   STOP RUN.

