000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_098_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 AB1.
000007    03 AB11 OCCURS 2.
000008       05 AB   PIC S9(8).
000009 01 ans        PIC -(8)9.
000010 01 cur        PIC 9(2) VALUE 1.
000011 01 i          PIC 9(18) VALUE 1.
000012 01 j          PIC 9(18).
000013 01 len        PIC 9(2).
000014 01 ln         PIC X(10).
000015 01 maxlen     PIC 9(1) VALUE 2.
000016 
000017 PROCEDURE DIVISION.
000018   ACCEPT ln.
000019   PERFORM maxlen TIMES
000020     PERFORM VARYING j FROM cur BY 1 UNTIL ln(j:1) = SPACE
000021     END-PERFORM
000022     COMPUTE len = j - cur
000023     MOVE ln(cur:len) TO AB(i)
000024     COMPUTE cur = j + 1
000025     ADD 1 TO i
000026   END-PERFORM.
000027   MOVE FUNCTION MAX(
000028     AB(1) + AB(2),AB(1) - AB(2),AB(1) * AB(2)) TO ans.
000029   DISPLAY FUNCTION TRIM(ans).
000030   STOP RUN.

