000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_103_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(100) VALUE SPACE.
000007 01 REDEFINES S.
000008    03 SC      PIC X OCCURS 100.
000009 01 SLEN       PIC 9(3).
000010 01 T          PIC X(100) VALUE SPACE.
000011 01 REDEFINES T.
000012    05 TC      PIC X OCCURS 100.
000013 01 bk         PIC X(1).
000014 01 flg        PIC 9(1).
000015 01 i          PIC 9(3).
000016 01 j          PIC 9(3).
000017 01 tmp        PIC X(1).
000018 
000019 PROCEDURE DIVISION.
000020   ACCEPT S.
000021   ACCEPT T.
000022   COMPUTE SLEN = FUNCTION STORED-CHAR-LENGTH(S).
000023   MOVE ZERO TO flg.
000024   IF S = T THEN
000025     MOVE 1 TO flg
000026   ELSE
000027     PERFORM VARYING i FROM 1 BY 1 UNTIL SLEN <= i
000028       MOVE SC(1) TO bk
000029       PERFORM VARYING j FROM 1 BY 1 UNTIL SLEN <= j
000030         MOVE SC(j + 1) TO tmp
000031         MOVE bk TO SC(j + 1)
000032         MOVE tmp TO bk
000033       END-PERFORM
000034       MOVE bk TO SC(1)
000035       IF S = T THEN
000036         MOVE 1 TO flg
000037         EXIT PERFORM
000038       END-IF
000039     END-PERFORM
000040   END-IF.
000041   IF flg = 1 THEN
000042     DISPLAY "Yes"
000043   ELSE
000044     DISPLAY "No"
000045   END-IF.
000046   STOP RUN.

