000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_106_C.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006  01 S1.
000007     03 S PIC X(1) OCCURS 100.
000008 01 K          PIC 9(19).
000009 01 N          PIC 9(10).
000010 01 i          PIC 9(19).
000011 01 zs         PIC Z(9)9.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT S1.
000015   ACCEPT K.
000016 
000017   PERFORM VARYING i FROM 1 BY 1 UNTIL K < i
000018     IF FUNCTION STORED-CHAR-LENGTH(S1) < i
000019       EXIT PERFORM
000020     END-IF
000021     IF 1 NOT = S(i)
000022       DISPLAY S(i)
000023       STOP RUN
000024     END-IF
000025   END-PERFORM.
000026 
000027   DISPLAY '1'
000028   STOP RUN.

