000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_248_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          BINARY-DOUBLE UNSIGNED.
000007 01 B          BINARY-DOUBLE UNSIGNED.
000008 01 K          BINARY-DOUBLE UNSIGNED.
000009 01 cnt        PIC 9(10) VALUE ZERO COMP.
000010 01 ln         PIC X(50).
000011 01 num        BINARY-DOUBLE UNSIGNED.
000012 01 zs         PIC Z(19)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT ln.
000016   UNSTRING ln DELIMITED SPACE INTO A B K.
000017   MOVE A TO num.
000018   PERFORM UNTIL B <= num
000019     MULTIPLY K BY num
000020     ADD 1 TO cnt
000021   END-PERFORM
000022   MOVE cnt TO zs.
000023   DISPLAY FUNCTION TRIM(zs).
000024   STOP RUN.

