000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_180_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(800000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 N          PIC 9(10).
000016 01 chebyshev  BINARY-DOUBLE VALUE ZERO.
000017 01 euclidean  FLOAT-LONG VALUE ZERO.
000018 01 i          PIC 9(10) COMP.
000019 01 ln         PIC X(800000).
000020 01 pt         PIC 9(10) VALUE 1 COMP.
000021 01 taxicab    BINARY-DOUBLE VALUE ZERO.
000022 01 x          PIC 9(11).
000023 01 zsc        PIC Z(10)9.
000024 01 zse        PIC Z(10)9.9(15).
000025 01 zst        PIC Z(10)9.
000026 
000027 PROCEDURE DIVISION.
000028   OPEN INPUT SYSIN.
000029   READ SYSIN INTO N.
000030   READ SYSIN INTO ln.
000031   CLOSE SYSIN.
000032   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000033     UNSTRING ln DELIMITED BY SPACE INTO x WITH POINTER pt
000034     ADD x TO taxicab
000035     COMPUTE euclidean = euclidean + x ** 2
000036     IF chebyshev < x THEN
000037       MOVE x TO chebyshev
000038     END-IF
000039   END-PERFORM.
000040   COMPUTE euclidean = euclidean ** 0.5.
000041   MOVE chebyshev TO zsc.
000042   MOVE euclidean TO zse.
000043   MOVE taxicab TO zst.
000044   DISPLAY FUNCTION TRIM(zst).
000045   DISPLAY FUNCTION TRIM(zse).
000046   DISPLAY FUNCTION TRIM(zsc).
000047   STOP RUN.

