000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_049_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 C          PIC X(100).
000007 01 H          PIC 9(3).
000008 01 W          PIC 9(3).
000009 01 i          PIC 9(3).
000010 01 ln         PIC X(7).
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT ln.
000014   UNSTRING ln DELIMITED BY SPACE INTO H W.
000015   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000016     ACCEPT C
000017     DISPLAY C(1:FUNCTION STORED-CHAR-LENGTH(C))
000018     DISPLAY C(1:FUNCTION STORED-CHAR-LENGTH(C))
000019   END-PERFORM.
000020   STOP RUN.

