000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_033_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N          PIC X(4).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT N.
000010   IF N(1:1) = N(2:1) AND N(3:1) AND N(4:1) THEN
000011     DISPLAY "SAME"
000012   ELSE
000013     DISPLAY "DIFFERENT"
000014   END-IF.
000015   STOP RUN.

