000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_152_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 LN             PIC X(7).
000007 01 M              PIC 9(3).
000008 01 N              PIC 9(3).
000009 01 ans            PIC X(3).
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT LN.
000013   UNSTRING LN DELIMITED BY SPACE INTO N M.
000014   IF N = M
000015       DISPLAY "Yes"
000016   ELSE
000017       DISPLAY "No"
000018   END-IF.
000019   STOP RUN.

