000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_062_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 ln         PIC X(5).
000007 01 x          PIC 9(2).
000008 01 y          PIC 9(2).
000009 
000010 PROCEDURE DIVISION.
000011   ACCEPT ln.
000012   UNSTRING ln DELIMITED BY SPACE INTO x y.
000013   IF x = 1 OR 3 OR 5 OR 7 OR 8 OR 10 OR 12 THEN
000014     IF y = 1 OR 3 OR 5 OR 7 OR 8 OR 10 OR 12 THEN
000015       DISPLAY "Yes"
000016     ELSE
000017       DISPLAY "No"
000018     END-IF
000019   ELSE
000020     IF x = 4 OR 6 OR 9 OR 11 THEN
000021       IF y = 4 OR 6 OR 9 OR 11 THEN
000022         DISPLAY "Yes"
000023       ELSE
000024         DISPLAY "No"
000025       END-IF
000026     ELSE
000027       IF y = 2 THEN
000028         DISPLAY "Yes"
000029       ELSE
000030         DISPLAY "No"
000031       END-IF
000032     END-IF
000033   END-IF.
000034   STOP RUN.

