000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_181_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 N          PIC 9(10).
000009 01 ans        BINARY-DOUBLE VALUE ZERO.
000010 01 i          PIC 9(10).
000011 01 ln         PIC X(30).
000012 01 zs         PIC Z(19)9.
000013 
000014 PROCEDURE DIVISION.
000015   ACCEPT N.
000016   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000017     ACCEPT ln
000018     UNSTRING ln DELIMITED BY SPACE INTO A B
000019     COMPUTE ans = ans + B * (B + 1)
000020     COMPUTE ans = ans - A * (A - 1)
000021   END-PERFORM.
000022   DIVIDE ans BY 2 GIVING ans.
000023   MOVE ans TO zs.
000024   DISPLAY FUNCTION TRIM(zs).
000025   STOP RUN.

