000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_174_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X          PIC S9(10).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT X.
000010   IF 30 <= X THEN
000011     DISPLAY "Yes"
000012   ELSE
000013     DISPLAY "No"
000014   END-IF.
000015   STOP RUN.

