000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_102_C.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 
000009 DATA DIVISION.
000010 FILE SECTION.
000011 FD SYSIN.
000012 01 INDATA     PIC X(2200000).
000013 
000014 WORKING-STORAGE SECTION.
000015 01 B1.
000016    03 B11 OCCURS 2200000 DEPENDING ON maxlen INDEXED BIX.
000017       05 B    PIC S9(11).
000018 01 N          PIC 9(6).
000019 01 INP        PIC X(2200000).
000020 01 cur        PIC 9(7) VALUE 1.
000021 01 i          PIC 9(18) BINARY VALUE 1.
000022 01 j          PIC 9(18).
000023 01 len        PIC 9(7).
000024 01 maxlen     PIC 9(7).
000025 01 s          PIC 9(15).
000026 01 t          PIC 9(10).
000027 01 tmp        PIC 9(6).
000028 01 x          PIC S9(11).
000029 01 zs         PIC Z(15)9.
000030 
000031 PROCEDURE DIVISION.
000032   ACCEPT N.
000033   OPEN INPUT SYSIN.
000034   READ SYSIN INTO INP.
000035   CLOSE SYSIN.
000036   MOVE N TO maxlen.
000037   PERFORM maxlen TIMES
000038     PERFORM VARYING j FROM cur BY 1
000039       UNTIL INP(j:1) = SPACE
000040     END-PERFORM
000041     COMPUTE len = j - cur
000042     MOVE INP(cur:len) TO x
000043     SUBTRACT i FROM x
000044     SET BIX TO i
000045     MOVE x TO B(BIX)
000046     COMPUTE cur = j + 1
000047     ADD 1 TO i
000048   END-PERFORM.
000049   SORT B11 ON ASCENDING KEY B.
000050 *> 中央 index
000051   SUBTRACT 1 FROM N GIVING tmp.
000052   DIVIDE 2 INTO tmp GIVING tmp.
000053   ADD 1 TO tmp.
000054   SET BIX TO tmp.
000055   MOVE B(BIX) TO x.
000056   MOVE ZERO TO s.
000057   MOVE 1 TO i.
000058   PERFORM maxlen TIMES
000059     SET BIX TO i
000060     SUBTRACT B(BIX) FROM x GIVING t
000061     ADD t TO s
000062     ADD 1 TO i
000063   END-PERFORM.
000064   MOVE s TO zs.
000065   DISPLAY FUNCTION TRIM(zs).
000066   STOP RUN.

