000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABC_125_A.
000030 
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 ln         PIC X(400).
000070 01 ans        PIC 9(10).
000080 01 zs         PIC Z(9)9.
000090 01 A          PIC 9(10).
000100 01 B          PIC 9(10).
000110 01 T          PIC 9(10).
000120 01 TA         PIC 9(10).
000130 
000140 PROCEDURE DIVISION.
000150   ACCEPT ln.
000160   UNSTRING ln DELIMITED BY SPACE INTO A B T.
000170   DIVIDE T BY A GIVING TA.
000180   COMPUTE ans = TA * B.
000190   MOVE ans TO zs.
000200   DISPLAY FUNCTION TRIM(zs).
000210   STOP RUN.
