000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_242_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 B          PIC 9(10).
000008 01 C          PIC 9(10).
000009 01 X          PIC 9(10).
000010 01 ln         PIC X(30).
000011 01 zs         PIC Z(9)9.9(12) VALUE 0.0.
000012 
000013 PROCEDURE DIVISION.
000014   ACCEPT ln.
000015   UNSTRING ln DELIMITED SPACE INTO A B C X.
000016   IF X <= A MOVE 1 TO zs
000017   ELSE IF A < X AND X <= B COMPUTE zs = C / (B - A).
000018   DISPLAY FUNCTION TRIM(zs).
000019   STOP RUN.

