000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_114_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X          PIC 9(10).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT X.
000010   IF X = 7 OR 5 OR 3
000011     DISPLAY "YES"
000012   ELSE
000013     DISPLAY "NO"
000014   END-IF.
000015   STOP RUN.
