000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_106_D.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 INP1       PIC X(17).
000007 01 INP2       PIC X(7).
000008 01 M          PIC 9(6).
000009 01 N          PIC 9(3).
000010 01 Q          PIC 9(6).
000011 01 X          PIC 9(3).
000012 01 Y          PIC 9(3).
000013 *> 2次元累積和用
000014 01 train1.
000015    03 train11 OCCURS 500 INDEXED YX1 YX2.
000016       05 train PIC 9(6) OCCURS 500 INDEXED XX1 XX2 VALUES ZERO.
000017 01 ans        PIC X(6).
000018 01 i          PIC 9(3) BINARY.
000019 01 j          PIC 9(3) BINARY.
000020 01 k          PIC 9(6) BINARY.
000021 01 tmp        PIC 9(3) BINARY.
000022 01 t          PIC 9(6).
000023 01 zs         PIC Z(6)9.
000024 
000025 PROCEDURE DIVISION.
000026   ACCEPT INP1.
000027 
000028   UNSTRING INP1 DELIMITED BY SPACE INTO N M Q.
000029 
000030   PERFORM VARYING k FROM 1 BY 1 UNTIL M < k
000031     ACCEPT INP2
000032 
000033     UNSTRING INP2 DELIMITED BY SPACE INTO X Y
000034 
000035 *> train(Y X)
000036     SET XX1 TO X
000037     SET YX1 TO Y
000038     ADD 1 TO train(YX1 XX1)
000039   END-PERFORM.
000040 
000041 *> 2次元累積和 横
000042   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000043     PERFORM VARYING j FROM 2 BY 1 UNTIL N < j
000044       SUBTRACT 1 FROM j GIVING tmp
000045       SET XX1 TO tmp
000046       SET XX2 TO j
000047       SET YX1 TO i
000048       ADD train(YX1 XX1) TO train(YX1 XX2)
000049     END-PERFORM
000050   END-PERFORM.
000051 
000052 *> 2次元累積和 縦
000053   PERFORM VARYING i FROM 2 BY 1 UNTIL N < i
000054     PERFORM VARYING j FROM 1 BY 1 UNTIL N < j
000055       SUBTRACT 1 FROM i GIVING tmp
000056       SET YX1 TO tmp
000057       SET YX2 TO i
000058       SET XX1 TO j
000059       ADD train(YX1 XX1) TO train(YX2 XX1)
000060     END-PERFORM
000061   END-PERFORM.
000062 
000063 *> A        - B - C + D = E
000064 *> □□□□   □□□□ □□□□ □□□□ □□□□
000065 *> ■■■□   ■□□□ □□□□ □□□□ □■■□
000066 *> ■■■□   ■□□□ □□□□ □□□□ □■■□
000067 *> ■■■□   ■□□□ ■■■□ ☆□□□ □□□□
000068 
000069   PERFORM VARYING k FROM 1 BY 1 UNTIL Q < k
000070     ACCEPT INP2
000071     UNSTRING INP2 DELIMITED BY SPACE INTO X Y
000072     SET XX1 TO Y
000073     SET YX1 TO Y
000074     IF 1 = X THEN
000075       MOVE train(YX1 XX1) TO t
000076     ELSE
000077       SUBTRACT 1 FROM X GIVING tmp
000078       SET XX2 TO tmp
000079       SET YX2 TO tmp
000080       COMPUTE
000081         t = train(YX1 XX1) - train(YX1 XX2)
000082           - train(YX2 XX1) + train(YX2 XX2)
000083     END-IF
000084     MOVE t TO zs
000085     DISPLAY FUNCTION TRIM(zs)
000086   END-PERFORM.
000087   STOP RUN.

