000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_168_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 K          PIC 9(10).
000007 01 S          PIC X(100).
000008 
000009 PROCEDURE DIVISION.
000010   ACCEPT K.
000011   ACCEPT S.
000012   IF K < FUNCTION STORED-CHAR-LENGTH(S)
000013     DISPLAY S(1 : K) "..."
000014   ELSE
000015     DISPLAY FUNCTION TRIM(S)
000016   END-IF.
000017   STOP RUN.

