000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_186_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 A          PIC 9(10).
000007 01 H          PIC 9(10).
000008 01 W          PIC 9(10).
000009 01 ans        PIC Z(9)9.
000010 01 cur        PIC S9(10).
000011 01 i          PIC 9(10) COMP.
000012 01 j          PIC 9(10) COMP.
000013 01 ln         PIC X(400).
000014 01 mn         PIC 9(10) VALUE 1000000007.
000015 01 pt         PIC 9(10).
000016 01 sm         PIC 9(10) VALUE ZERO.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT ln.
000020   UNSTRING ln DELIMITED BY SPACE INTO H W.
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000022     ACCEPT ln
000023     MOVE 1 TO pt
000024     PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
000025       UNSTRING ln DELIMITED BY SPACE INTO A WITH POINTER pt
000026       IF A < mn THEN
000027         MOVE A TO mn
000028       END-IF
000029       ADD A TO sm
000030     END-PERFORM
000031   END-PERFORM.
000032   COMPUTE ans = sm - H * W * mn.
000033   DISPLAY FUNCTION TRIM(ans).
000034   STOP RUN.

