000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_165_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 X          PIC 9(19).
000007 01 ans        PIC 9(10).
000008 01 cur        PIC 9(19).
000009 01 zs         PIC Z(9)9.
000010 
000011 PROCEDURE DIVISION.
000012   ACCEPT X.
000013   MOVE 100 TO cur.
000014   PERFORM UNTIL X <= cur
000015     ADD 1 TO ans
000016     MULTIPLY cur BY 1.01 GIVING cur
000017   END-PERFORM.
000018   MOVE ans TO zs.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

