IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N          PIC X(11).
01 NUM        PIC 9(10).
01 R          PIC 9(10).
01 SN         PIC 9(3).
01 X          PIC 9(10).
01 i          PIC 9(2).
01 now        PIC 9(1).

PROCEDURE DIVISION.
  ACCEPT N.
  MOVE N TO NUM.
  MOVE ZERO TO SN.
  PERFORM VARYING i FROM 1 BY 1 UNTIL N(i:1) = SPACE
    MOVE N(i:1) TO now
    COMPUTE SN = SN + now
  END-PERFORM.
  DIVIDE SN INTO NUM GIVING X REMAINDER R.
  IF ZERO = R THEN
    DISPLAY "Yes"
  ELSE
    DISPLAY "No"
  END-IF.
  STOP RUN.

