000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_076_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 K          PIC 9(2).
000007 01 N          PIC 9(2).
000008 01 board      PIC 9(11) VALUE 1.
000009 01 i          PIC 9(2).
000010 01 zs         PIC Z(12)9.
000011 
000012 PROCEDURE DIVISION.
000013   ACCEPT N.
000014   ACCEPT K.
000015   PERFORM VARYING i FROM 1 BY 1 UNTIL N < i
000016     COMPUTE board = FUNCTION MIN (board * 2, board + K)
000017   END-PERFORM.
000018   MOVE board TO zs.
000019   DISPLAY FUNCTION TRIM(zs).
000020   STOP RUN.

