000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_063_B.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(26).
000007 01 alpha      PIC X(26) VALUE "abcdefghijklmnopqrstuvwxyz".
000008 01 flg1.
000009    03 flg11 OCCURS 26.
000010       05 flg  PIC 9(1) VALUE ZERO.
000011 01 i          PIC 9(2).
000012 01 j          PIC 9(2).
000013 01 ln         PIC X(30).
000014 01 len        PIC 9(2).
000015 01 num        PIC 9(2) VALUE 26.
000016 01 used       PIC 9(1) VALUE 0.
000017 
000018 PROCEDURE DIVISION.
000019   ACCEPT S.
000020   COMPUTE len = FUNCTION STORED-CHAR-LENGTH(S).
000021   PERFORM VARYING i FROM 1 BY 1 UNTIL len < i
000022     PERFORM VARYING j FROM 1 BY 1 UNTIL num < j
000023       IF S(i:1) = alpha(j:1) THEN
000024         IF flg(j) = 1 THEN
000025           MOVE 1 TO used
000026           EXIT PERFORM
000027         END-IF
000028         MOVE 1 TO flg(j)
000029       END-IF
000030     END-PERFORM
000031     IF used = 1 THEN
000032       EXIT PERFORM
000033     END-IF
000034   END-PERFORM.
000035   IF used = 1 THEN
000036     DISPLAY "no"
000037   ELSE
000038     DISPLAY "yes"
000039   END-IF.
000040   STOP RUN.

