000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_225_A.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 S          PIC X(3).
000007 
000008 PROCEDURE DIVISION.
000009   ACCEPT S.
000010   IF S(1:1) = S(2:1) AND S(3:1) DISPLAY 1
000011   ELSE IF S(1:1) NOT = S(2:1) AND S(3:1) AND S(2:1) NOT = S(3:1)
000012     DISPLAY 6
000013   ELSE DISPLAY 3.
000014   STOP RUN.

