000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. ABC_237_B.
000003 
000004 ENVIRONMENT DIVISION.
000005 INPUT-OUTPUT SECTION.
000006 FILE-CONTROL.
000007 SELECT SYSIN_B ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000008 SELECT SYSIN_S ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.
000009 
000010 DATA DIVISION.
000011 FILE SECTION.
000012 FD SYSIN_B.
000013 01 INDATA_B   PIC X(1100000).
000014 FD SYSIN_S.
000015 01 INDATA_S   PIC X(22).
000016 
000017 WORKING-STORAGE SECTION.
000018 01 B1.
000019    03 B       PIC 9(10) OCCURS 100000 DEPENDING HW.
000020 01 H          PIC 9(10).
000021 01 HW         PIC 9(10).
000022 01 W          PIC 9(10).
000023 01 cur        PIC 9(10).
000024 01 i          PIC 9(10) COMP.
000025 01 j          PIC 9(10) COMP.
000026 01 ln         PIC X(30).
000027 01 pt         PIC S9(10).
000028 01 zs         PIC Z(9)9.
000029 
000030 PROCEDURE DIVISION.
000031   ACCEPT ln.
000032   UNSTRING ln DELIMITED SPACE INTO H W.
000033   MULTIPLY H BY W GIVING HW.
000034   IF 50000 <= H
000035     OPEN INPUT SYSIN_S
000036     PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000037       READ SYSIN_S
000038       MOVE 1 TO pt
000039       PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
000040         UNSTRING INDATA_S DELIMITED SPACE
000041         INTO B(i + H * (j - 1)) POINTER pt
000042       END-PERFORM
000043     END-PERFORM
000044     CLOSE SYSIN_S
000045   ELSE
000046     OPEN INPUT SYSIN_B
000047     PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000048       READ SYSIN_B
000049       MOVE 1 TO pt
000050       PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
000051         UNSTRING INDATA_B DELIMITED SPACE
000052         INTO B(i + H * (j - 1)) POINTER pt
000053       END-PERFORM
000054     END-PERFORM
000055     CLOSE SYSIN_B
000056   END-IF.
000057   PERFORM VARYING j FROM 1 BY 1 UNTIL W < j
000058     MOVE 1 TO pt
000059     PERFORM VARYING i FROM 1 BY 1 UNTIL H < i
000060       MOVE B(i + H * (j - 1)) TO zs
000061       DISPLAY FUNCTION TRIM(zs) SPACE WITH NO ADVANCING
000062     END-PERFORM
000063     DISPLAY SPACE
000064   END-PERFORM.
000065   STOP RUN.

